{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/d8cc41f7-2ac3-43ae-ad1a-eeefaee7cdca", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["changing", "conf fourty two", "dmitry bardysh", "ecommerce", "forecasts", "head of bb operations", "insights", "traditional", "trends", "yandex delivery"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "f7085bb9-4d73-4d27-bc14-51fd0071c851", "status": "completed", "error": null, "text": "Hi everyone, everyone, my name is Dmitry Bardysh and I'm happy to see you all. The conference today I'm going to share my thoughts on the emergency of e commerce and the future of traditional shopping. So let's get to the point. I think everybody knows that while e commerce is growing quickly, the physical stores themselves continue playing a major role. The question remains whether in store shopping can survive and compete with the convenience and personalization of ecommerce over the long term, or if online shopping will eventually dominate the retail landscape. But first of all, let me give you a quick introduction about me. So here you can see my career highlights and I've got more than six or six years of work experience at ride changing, food, tech and delivery and here are some links if you want to connect with me. I'm happy to have chat with you guys on the various of topics. So let's talk about the problem itself, how it all started and how it is going now, right? Ecommerce has undeniably surged in recent years, with sales skyrocketing to over $6 trillion globally in 2022 and still poised to climb even further. Its share of retail market has also seen remarkable growth, reaching 18% in 2022 and projected to hit almost 22% by 2024. With estimated almost 3 billion online shoppers in 2024, the digital shopping landscape is expanding rapidly, fueled in part by the COVID-19 pandemic which accelerated online adoption during lockdowns. On the other hand, instore shopping remains robust, bouncing back in 20, 29 21 sorry. With an almost 8% growth to almost 21 trillion of dollars, surpassing pre pandemic levels, a recent survey shows that almost 43% of the consumers still prefer the tangible experience of in store shopping. So with that all being said, we may come up with the hypothesis like that the future of commerce is a dynamic interplay between the digital and traditional retail realms. But let's try to answer the simple question why people can't resist online shopping. In order to find the answer to this question, we have to go deep into the main reasons of ecommerce. Boom. And it all started from the obvious, the rise of the mobile devices when it comes to number of factors, right? And let's get a bit more in depth about them. The first one is a global reach. Ecommerce provides businesses with the ability to reach a global audience, breaking down the geographical barriers. They have 24 per seven days. Accessibility. Online stores are open almost every hour, every minute, and it basically allows customers to shop there at their convenience, regardless of the time zones or business hours. Also, about the convenience, right? Consumers can shop from the comfort of their homes, avoiding the need to travel to physical stores. Also, it's all about the wide product selection. Ecommerce platforms themselves offer a different number of products, often more extensive than it is available in brick and mortar stores. Don't forget about the cost savings. Both businesses and consumers can save on costs related to physical storefronts such as rent, utilities, travel expenses and salaries. Don't forget about time efficiency as well. Online shopping eliminates the need to wait in line, searching for the crowds or deal with the limited store hours. Also, don't forget about the personalization. Ecommerce websites can offer personalized recommendations based on the user preferences and purchase history. Also, it's all about the ease of comparison. Consumers can easily compare prices, features and reviews of products across different brands and vendors. We already talked about the personalization, right? But don't forget about the user reviews themselves. Customers can make informed decisions based on the experiences of others and reviews shared by other buyers before even trying to buy the real product. Also, ecommerce boom gives accessibility for small businesses. What does it mean? Basically, it's all about the fact that ecommerce levels the playing field, allowing small businesses to compete with larger enterprises on the global scale. Also, it's all about reduced marketing costs. Digital marketing is often more cost effective than traditional advertising methods make it more accessible to businesses of all sizes. In addition, it's about data collection. Ecommerce platforms can collect valuable data on customer behavior, helping businesses refine their strategies and offerings. Also, due to the ecommerce boom, we can see the faster transactions between people and between the company and people. Online payments and digital transactions streamline the purchasing process, reducing checkout times. Also, in terms of the inventory management, basically, ecommerce systems enable efficient tracking and management of inventory levels, reducing the likelihood of overstock on stockholms. Also, we already spoke about targeted marketing, but let's say about that as well. Businesses can tailor marketing efforts based on customer data, ensuring that promotions are super relevant and appealing. Also, don't forget about the flexible shopping experience. Consumers can shop using various devices such as smartphones, tablets, computers, even TV, changing flexibility. Also, it is important to say about the environmental impact digital transactions and online shopping contribute to reducing the environmental impact associated with traditional retail practices. Also, there is one thing which is quite important for the companies, it's the dynamic pricing. Ecommerce allows for them dynamic pricing strategies. Adjusting prices based on demand, seasonality or other factors. Also altogether gives them ability to focus on the customer service and chatbots automated systems which can handle routine customer inquiries, basically improving efficiency and responsiveness. And finally, don't forget about the scalability. Ecommerce businesses can easily scale their operations abroad, accommodating increased demand without the need of significant infrastructure changes. When we talk about the ecommerce, we have to talk about some main trends which take place at the moment. And let's start from the first one. I think the most notable trend in ecommerce is the surge in mobile commerce. For example, in 2019, mobile ecommerce constituted only 67% of total ecommerce sales, but by 2021 figure projected to rise by almost 73%, according to Statista. This shift is fueled by the widespread of use of smartphones and tablets, providing the convenient shopping experiences for businesses to remain competitive. Having a mobile friendly website or app is quite crucial at the moment. Another trend in ecommerce is the increasing importance of social commerce. Platforms like Instagram and Facebook and TikTok and others are now becoming significant sales channels for businesses. According to Shopify, almost 80% of american consumers say that they have discovered products on the Facebook and 55 of them have purchased products online after discovering them on social media. That's why I can say that user experience is quite crucial to the success of the ecommerce websites. And the last one. According to a study by Kiss Metrics, 47% of consumers expect a page to load in 2 seconds or less, and 40% will abandon a website that takes more than 3 seconds to load. Additionally to that, 88% of online consumers are less likely to return to a site after a bad experience. This basically means that businesses need to invest in fast, responsive websites, intuitive navigation and user friendly interfaces. But the question is still in the air. Why do people still love shopping in real life? In my point of view, there are four main reasons for it. The first one is tangible experience. Despite the conveniences of ecommerce, many still favor in store shopping for its tangible and experiential nature. The second one is the avoiding risks, which may happen in online instore shopping has some online risks like shipping fees, delays and potential issues with damaged items. A retail dive survey reveals that 62% prefer physical examination of the products, with 49% aiming to dodge shipping costs. Also, don't forget about the face to face experience and according to PwC survey, 74% of global consumers desire more human interaction while shopping. And the last one is overall appeal. And I would say that music, mood, sense and visuals contribute to overall appeal, as indicated by a survey where 90% of people are more likely to purchase than they enjoy the stores environment. But let's think about some examples of really big companies, how they adapted to new reality. In my opinion, they use a kind of mixed approach and it can be stated that we witness some kind of omnichannel revolution. That basically means that successful retailers, or e retailers as they say, will use online and in store experiences to define the unique and successful brand differentiation. Basically, there are three good examples which I would like to point out. And here are the success stories of Walmart, Starbucks and Sephora. All of them integrated physical and online channels for a seamless shopping experience. And all of them benefited from it by getting an enhanced convenience selection and better personalization for customers. But let's talk about some numbers here. For example, Starbucks recently reached 31 million monthly app users and 41% of US sales from rewards program. In terms of Walmart, Walmart has more than 268,000,000 customers and more than 63% of growth in ecommerce sales year over year by the 2021. In terms of C four, they got 31 million loyalty members, exceptional customer retention and according to recent research. But let's talk about some future trends in retail. I personally would like to point out three of them. The first one is a personalized mobile shopping. And I think that consumers seek tailored recommendations and experiences by using their mobile devices, laptops or whatever. And the good example here will be Shopify's success, who's got 1.75 billion merchants and 86% revenue increase in 2020. The second one is sustainability practices. It's all about the growing demand for eco friendly practices in retail. And I can say that there is a leader in Patagonia which company donates 1% of sales to environmental causes. And the third one is the emergent technologies. And I would like to stay here a bit for more. I personally believe that all the things related to new technologies, such as virtual reality, using chat, GPT, using all other things which are kind of popular right now, enhance immersive shopping experiences. And the good example here can be Ikea's AR app, which basically boosts online sales through visualizing products in customer homes. But if you think about the future and about the upcoming years, the question will be quite simple. Can retailers crack the code to seamlessly blend the tactile allure of physical stores with the boundless possibilities of digital shopping, ultimately sculpting a retail landscape that caters perfectly to diverse consumer needs and preferences? And in my opinion, the short answer is yes. The first point here is diverse consumer preferences. And I would say that physical stores appeal to tangible interactions and immersive experiences, and online shopping caters to innovation, convenience and personalized recommendations. Also, the second thing here is omnichannel integrations. It's all about the blending physical and digital models which enhance convenience, loyalty and data insights. Also, it's all about the ongoing innovations. And as I said earlier, it comes to the personalization, mobile tech and sustainability which contributes to reshaping the retail landscape itself. The third thing here is adaptable brand for the future. And I think that traditional retail's future relies on adaptable, creative brands. And it's all about the thoughtful transformation of physical spaces which can maintain relevance. And the fourth thing here is a consumer driven equilibrium. I think that future success depends on defining the ideal balance between in person and digital experiences. And retailers must listen to consumer preferences and strategically chart and omnichannel courses for added value for the final customer. Now we come up to some kind of conclusion and I would like to say that going forward, traditional retail's future depends on adaptable and creative brands that keep pace with the consumer's changing needs. Purely physical stores may fade over time, I hope. No, but thoughtfully transformed spaces can retain relevance. Ultimately, consumers will determine the ideal equilibrium between in person and digital, weighing each channel's upsides and downsides. Retail will remain vibrant if retailers listen carefully and chart an omnichannel course that adds some value to the final customer. So guys, here is thanks for your time, thanks for listening. I'm happy to answer your questions, I'm happy to share my thoughts and I'm happy to have any kind of discussions on related topic. Thanks for your time.", "words": [], "utterances": null, "confidence": 0.935164228380319, "audio_duration": 990.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Dmitry Bardysh shares his thoughts on the emergency of e commerce and the future of traditional shopping. While e commerce is growing quickly, the physical stores themselves continue playing a major role. The question remains whether in store shopping can survive and compete with the convenience of ecommerce.\n- The main reasons of ecommerce are a global reach, convenience and cost savings. Also, ecommerce boom gives accessibility for small businesses. The future of commerce is a dynamic interplay between digital and traditional retail realms.\n- In 2019, mobile ecommerce constituted only 67% of total ecommerce sales. By 2021 figure projected to rise by almost 73%. Another trend in ecommerce is the increasing importance of social commerce. Having a mobile friendly website or app is quite crucial at the moment.\n- Despite the conveniences of ecommerce, many still favor in store shopping for its tangible and experiential nature. Successful retailers will use online and in store experiences to define the unique and successful brand differentiation.\n- Future trends in retail include personalization, mobile tech and sustainability. Future success depends on defining the ideal balance between in person and digital experiences. Traditional retail's future relies on adaptable, creative brands. Retail will remain vibrant if retailers listen carefully.", "auto_highlights_result": {"status": "success", "results": [{"count": 5, "rank": 0.07, "text": "online shopping", "timestamps": [{"start": 54852, "end": 55546}, {"start": 168222, "end": 169490}, {"start": 251348, "end": 252346}, {"start": 401088, "end": 401894}, {"start": 861012, "end": 861754}]}, {"count": 3, "rank": 0.07, "text": "store shopping", "timestamps": [{"start": 47692, "end": 48306}, {"start": 149392, "end": 150410}, {"start": 591008, "end": 591606}]}, {"count": 1, "rank": 0.07, "text": "online instore shopping", "timestamps": [{"start": 599312, "end": 601690}]}, {"count": 1, "rank": 0.07, "text": "online consumers", "timestamps": [{"start": 556068, "end": 556986}]}, {"count": 1, "rank": 0.07, "text": "immersive shopping experiences", "timestamps": [{"start": 809162, "end": 811114}]}, {"count": 1, "rank": 0.07, "text": "Ecommerce businesses", "timestamps": [{"start": 439574, "end": 440854}]}, {"count": 2, "rank": 0.06, "text": "digital shopping", "timestamps": [{"start": 116408, "end": 117214}, {"start": 838112, "end": 839222}]}, {"count": 1, "rank": 0.06, "text": "Online stores", "timestamps": [{"start": 203050, "end": 203978}]}, {"count": 1, "rank": 0.06, "text": "store experiences", "timestamps": [{"start": 672008, "end": 672846}]}, {"count": 1, "rank": 0.06, "text": "traditional shopping", "timestamps": [{"start": 33548, "end": 34870}]}, {"count": 2, "rank": 0.06, "text": "ecommerce sales", "timestamps": [{"start": 475916, "end": 477110}, {"start": 724168, "end": 725230}]}, {"count": 5, "rank": 0.06, "text": "physical stores", "timestamps": [{"start": 42108, "end": 42866}, {"start": 221208, "end": 222450}, {"start": 835148, "end": 836178}, {"start": 856228, "end": 857114}, {"start": 942086, "end": 943126}]}, {"count": 1, "rank": 0.06, "text": "online sales", "timestamps": [{"start": 817598, "end": 818498}]}, {"count": 1, "rank": 0.06, "text": "total ecommerce sales", "timestamps": [{"start": 475580, "end": 477110}]}, {"count": 2, "rank": 0.06, "text": "instore shopping", "timestamps": [{"start": 127948, "end": 128882}, {"start": 600290, "end": 601690}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}