{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/323e0689-3e13-4fdf-8764-5a5f6e64798a", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["accelerating", "advances", "amit taneja", "bridging", "by", "computing", "conf fourty two", "costs", "cuttingedge", "dont", "engineering lead", "groundbreaking", "integrations", "pharma", "pharmaceuticals", "revolutionizing"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "8646a524-5170-4447-b2a6-94828944bf3b", "status": "completed", "error": null, "text": "Hi everyone. My name is Amit Anaja. Thank you so much for joining in the conference. The topic here is accelerating pharmaceutical innovation and how we can leverage artificial intelligence in drug discovery. The idea is transforming the drug discovery process with advanced machine learning algorithms. So the first thing we need to talk about is what are the different challenges that we see in the traditional drug discovery? The traditional drug discovery process is way too lengthy. It often takes like over a decade from initial discovery to market launch. And along with that, the costs associated with bringing a new drug to the market are staggering, frequently exceeding over $2.6 billion per drug. The pharmaceutical industry is in dire need of innovative solutions to expedite the drug discovery process and reduce the development costs. Now, how AI can help this there are different AI powered methodologies in drug discovery. Advanced machine learning algorithms such as deep learning, reinforcement learning are being employed to revolutionize the drug discovery. These AI powered methodologies can actually analyze vast datasets to accurately predict different molecular interactions and identify promising drug candidates rapidly. By leveraging the power of AI, these different pharmaceutical companies can significantly streamline the drug discovery process and exploit innovation. Let's talk about comprehensive chemical and bioactivity databases. There are different databases like which are extensive chemical and bioactive databases like Campbell and Pupkin, which serves as essential resources for training AI models in drug discovery. These databases enable virtual screening and molecular docking techniques that greatly enhance the efficiency of identifying and optimizing drug candidates. By leveraging the wealth of data available in these databases, AI models can make more accurate predictions and uncover novel drug candidates. Let's take a case study here identifying novel cancer enzyme inhibitors a deep learning model was actually applied to the Kembl database to identify novels inhibitors for key enzymes involved in cancer progression. The AI model successfully pinpointed several promising inhibitors that were previously unknown. Experimental assays confirmed that these AI identified inhibitors exhibited high efficiency and favorable safety profiles. These novel inhibitors show great potential for further clinical trials and could lead to the development of new cancer therapies. Now, what's the impact we see of AI on drug discovery? The AI powered methodologies do have the potential to significantly reduce the time to market for new drugs, bringing innovative treatments to patients faster. By streamlining the drug discovery process, AI can actually slash research and development costs by up to 70%, making discovery development more cost effective. The integration of AI in drug discovery accelerates the delivery of new treatments to patients, improving healthcare outcomes. AI enhances the pharmaceutical industry's ability to respond swiftly to emerging health crisis, such as pandemic or new disease outbreaks. Now let's talk about the pharmaceutical research future with AI. As AI and machine learning technologies continue to advance, the future of pharmaceutical research looks incredibly promising. The AI powered discovery has the potential to revolutionize the development of more effective target treatments. By leveraging AI, pharmaceutical companies and can actually deliver new therapeutics at an unprecedented space. Meeting patient needs more efficiently. AI also paves the way for personalized medicine, enabling the development of targeted therapies tailored to individual patient characteristics. Let's talk about challenges and considerations. Ensuring the quality and standardization of data used to train AI models is very crucial for accurate predictions and reliable results. Addressing ethical concerns and potential biases in AI algorithms is essential to ensure fair and unbiased drug discovery. Collaboration between AI experts and domain experts in pharmaceuticals is necessary to validate AI generated insights and ensure their practical relevance, and then navigating the regulatory landscapes and approval processes for AI discovered drugs may also present new challenges that need to be addressed. See the integration of AI technologies in drug discovery represents a significant leap forward in pharmaceutical innovation. AI is transforming the pharmaceutical industry by accelerating the development of new drugs and improving patient outcomes. By delivering more efficient treatments to patients faster and at lower costs, AI has the potential to revolutionize healthcare. Continued research and development in aipowered drug discovery will actually help unlock its full potential and shape the future of pharmaceutical innovation. Thank you so much, everyone.", "words": [], "utterances": null, "confidence": 0.908905251396649, "audio_duration": 361.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- The topic here is accelerating pharmaceutical innovation and how we can leverage artificial intelligence in drug discovery. The idea is transforming the drug discovery process with advanced machine learning algorithms.\n- The traditional drug discovery process is way too lengthy. It often takes like over a decade from initial discovery to market launch. Advanced machine learning algorithms are being employed to revolutionize the drug discovery. The integration of AI in drug discovery accelerates the delivery of new treatments to patients.\n-  AI powered discovery has the potential to revolutionize the development of more effective target treatments. Addressing ethical concerns and potential biases in AI algorithms is essential to ensure fair and unbiased drug discovery. Continued research and development in aipowered drug discovery will help unlock its full potential and shape the future of pharmaceutical innovation.", "auto_highlights_result": {"status": "success", "results": [{"count": 15, "rank": 0.11, "text": "drug discovery", "timestamps": [{"start": 35650, "end": 36754}, {"start": 38210, "end": 38906}, {"start": 47970, "end": 49074}, {"start": 50074, "end": 50666}, {"start": 71358, "end": 71966}, {"start": 79470, "end": 80554}, {"start": 87258, "end": 88202}, {"start": 106858, "end": 107466}, {"start": 126330, "end": 127330}, {"start": 194950, "end": 196038}, {"start": 207638, "end": 208262}, {"start": 218620, "end": 219412}, {"start": 300958, "end": 302034}, {"start": 327980, "end": 328660}, {"start": 352402, "end": 353370}]}, {"count": 1, "rank": 0.11, "text": "aipowered drug discovery", "timestamps": [{"start": 351082, "end": 353370}]}, {"count": 3, "rank": 0.1, "text": "AI models", "timestamps": [{"start": 125370, "end": 126066}, {"start": 142058, "end": 142802}, {"start": 286806, "end": 287470}]}, {"count": 2, "rank": 0.1, "text": "new drugs", "timestamps": [{"start": 202414, "end": 203350}, {"start": 337452, "end": 338224}]}, {"count": 1, "rank": 0.1, "text": "AI algorithms", "timestamps": [{"start": 296294, "end": 297398}]}, {"count": 1, "rank": 0.09, "text": "AI technologies", "timestamps": [{"start": 326764, "end": 327684}]}, {"count": 1, "rank": 0.09, "text": "AI experts", "timestamps": [{"start": 303894, "end": 305022}]}, {"count": 1, "rank": 0.09, "text": "discovery development", "timestamps": [{"start": 214428, "end": 215268}]}, {"count": 1, "rank": 0.09, "text": "different AI powered methodologies", "timestamps": [{"start": 77470, "end": 79190}]}, {"count": 3, "rank": 0.09, "text": "drug candidates", "timestamps": [{"start": 98434, "end": 99266}, {"start": 137106, "end": 138210}, {"start": 146458, "end": 147854}]}, {"count": 1, "rank": 0.09, "text": "AI generated insights", "timestamps": [{"start": 309774, "end": 311742}]}, {"count": 1, "rank": 0.09, "text": "novel drug candidates", "timestamps": [{"start": 146098, "end": 147854}]}, {"count": 1, "rank": 0.09, "text": "promising drug candidates", "timestamps": [{"start": 97610, "end": 99266}]}, {"count": 1, "rank": 0.08, "text": "initial discovery", "timestamps": [{"start": 54614, "end": 55366}]}, {"count": 1, "rank": 0.07, "text": "traditional drug discovery process", "timestamps": [{"start": 49594, "end": 50994}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}