{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/5d3fb1bc-0125-4ad1-b3de-12c5d15fba6b", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["adhikar babu", "aification", "booming", "cagr", "compound", "conf fourty two", "fintech", "managers", "methods", "online", "optimizing", "product", "reshaping", "revolutionizing", "senior product manager", "worldpay"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "1f6ca099-a28a-45d6-b8e4-de60130b55fb", "status": "completed", "error": null, "text": "Hello everyone, my name is Adhikar. I'm a senior product manager at Worldpay. Today I'll be talking about aification of financial services. It's a very interesting topic and there's lots of information to absorb. I'll try to keep it short, simple and hopefully sweet. So let's begin. So before we understand the AI repercussions in financial services, here's a quick recap of what does AI mean? What is an AI 101? So the various types of AI which exists, the first is predictive ML. So this is basically the AI which exists today and potentially what all financial services are using of today. So this is all machine learning based, rules based, doing simple text analysis, data extraction, predictions on the basis of you feeding the AI, the artificial intelligence, some rules. Now, the new hype, or the current hype is about Gen AI or generative AI. Now this is where OpenAI and the GPT era has, has come into picture. Now this is more capable than predictive ML because it is multimodal, which is AI speak for saying that it can process information of various types, be it text, videos or images. It can do data summarization, it can be used for code generation. And most importantly, or what we are seeing right now is it can do contextual conversations. Building on this, the future is going to be general intelligence or auto generative AI. So this is basically gen AI, but with deeper context, a persistent memory, so it remembers what the previous conversations were, and a system, two kind of reasoning. So it can not just to summarize information or give you insight, but it can actually try to be more human like in nature, more proactive. Now, this is where the future is going to go towards why is AI coming into so much popularity right now? So it's a case of, it's a case of multiple reasons. So firstly, competent elements. So you're seeing players like hugging phase Openeye or Google's Gemini come into the market with really strong processing and really capable large language models. There's also traction. Now, chat JPT has been one of the fastest companies to reach 10 million users. There's a lot of enthusiasm about chat GPT and also other AI models like mid journey, which is used for creating art. Along with all of these positive, there's also a lot of hype. So for example, I'm just trying to give some examples of what I consider hype. Oral B coming up with an AI kind of a brush, Microsoft adding AI into its PC. So there's a lot of hype about, about AI right now in the tech world. And for that reason, even financial services are curious to understand what could be the repercussions or benefits for them. The potential is huge. It has use cases panning over over industries. So that's why AI is becoming so crucial right now. In terms of who benefits, there would be three key archetypes for companies who can truly unlock the power of AI. Companies which are data rich, so they have the network effects going on. They have a large amounts of data which they can use to come up with recommendations or insights. They are very compliance driven, they are focusing on monitoring and governance. And third, the company or the organization is product led. Now, all of this is not possible if you're not really able to quickly test out your ideas and see if it works or not. So in terms of the gen AI or the generative AI in finance today, in my opinion, I'm largely seeing these use cases emerge in personal finance. So companies like Monarch and Clio are trying to use this for spend management, budgeting and just acting as your AI buddy when it comes to spend management, we are seeing a lot of uptake in customer support. Almost every big bank or fintech has an AI enabled bot. Interestingly, Klarna recently claimed that their AI is able to do a work of 700 agents. So we are seeing already that the conversational side of the AI is being heavily leveraged by the financial services. Now going in the future, I see that these use cases will go deeper into three key areas, which is risk and compliance, developer tools and internal process. So now let's try to unpack this a bit. So risk and compliance in terms of making real time decisions, in terms of understanding the risk, the credit of the unbanked or the underbanked population, be it to b two c or b two b. I see AI playing a huge part in this. We are already seeing this happening on the b two z side with bnpls leveraging AI for real time credit decisioning. But I see this making a huge impact on the b two B side or the trade financing side, which has been largely unexplored in terms of internal processes. We are seeing companies such as Stripe or highradius use this to make sure that the internal data is optimized. So for example, you want to run a query or understand data for your company, you can just ask AI that. Hey AI, I want to find me the transactions for the past 30 days. I want to figure out what has went wrong and these conversational kind of things could be converted into actual insights. This is going to really be a game changer for larger financial organizations where finding data and creating insights is often a challenge in terms of dev tools. Again, I think stripe is one of those early AI leaders who are trying to integrate AI into developer experience. Potentially you will see in the future this becoming omnipresent. You will be seeing developers just conversationally asking that I want to create a payment service using stripe as a payment service method, using Worldpay as an acquirer or any other XYZ service. And the AI is going to ensure that every connection comes into place. With all of this AI bruhaha, there's a word of caution which I feel we should be taking in context. So with AI, there are certain challenges. The AI hallucinations are real, are a problem. So this is basically making some nonsensical assumptions or creating data out of thin air. We have already seen examples of how AI can just sometimes go off topic. So second is the data integrity or the data quality. So it's basically garbage in and garbage out. As my stats professor used to say. If the data is not cleaned enough, has not been removed of any particular biases, the AI is going to be trained accordingly. So companies need to be careful of what data sets the AI is getting, is getting trained on. Third is governance controls in terms of monitoring what AI can and cannot do, how, which of these are mission critical, which of these are regulatory driven and ensuring that AI has proper compliance and governance controls? And fourth is overengineering. Simply putting AI into your product is not going to solve a problem. As I gave these some examples earlier, AI is a means to a problem and not the opposite way. So it should be carefully helping you solve your problem rather than a solution looking for a problem. So given all of this context, how should fis or the financial services respond? So as I pointed out on the last slide, first and foremost, find the right problems to be solved using AI. Look for critical, manually intensive tasks that AI can truly help you solve and can make it more optimum for you. Second is assess options. Look what's out there from an AI perspective, do you need to build by or partner to current options, meet your needs, understand their abilities and limitations before trying to integrate them into your day to day reorganize. I think it's very important for organizations right now to understand that AI is a critical element of your organization and build a culture and the right talent pool which can help your organization adopt to AI. And fourth and foremost, the most important bit is experiment, build, test and iterate. Look at what works for you, what doesn't understand the proof of concepts for various use cases to really understand whether AI is fit for purpose for you. I thank you for taking this time to hear my talk. You can find me on X or Twitter or you can just do message me on LinkedIn. I have a very searchable name. Adhikar Babu. Thanks for your time.", "words": [], "utterances": null, "confidence": 0.934068823124571, "audio_duration": 606.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Adhikar is a senior product manager at Worldpay. Today he'll be talking about aification of financial services. There's lots of information to absorb. I'll try to keep it short, simple and hopefully sweet.\n- The future is going to be general intelligence or auto generative AI. Even financial services are curious to understand what could be the repercussions or benefits for them. The potential is huge. It has use cases panning over industries. Three key archetypes for companies who can truly unlock the power of AI.\n- I see AI playing a huge part in this. We are already seeing this happening on the b two z side with bnpls leveraging AI for real time credit decisioning. This is going to really be a game changer for larger financial organizations. Potentially you will see in the future this becoming omnipresent.\n- With AI, there are certain challenges. The AI hallucinations are real, are a problem. Second is the data integrity or the data quality. Third is governance controls in terms of monitoring what AI can and cannot do. Fourth is overengineering. AI should be a means to a problem and not the opposite way.\n- I thank you for taking this time to hear my talk. You can find me on X or Twitter or you can just do message me on LinkedIn. Thanks for your time.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.1, "text": "generative AI", "timestamps": [{"start": 91716, "end": 92732}, {"start": 126924, "end": 128012}, {"start": 267480, "end": 268456}]}, {"count": 3, "rank": 0.1, "text": "Gen AI", "timestamps": [{"start": 90684, "end": 91372}, {"start": 129780, "end": 130508}, {"start": 266552, "end": 267184}]}, {"count": 1, "rank": 0.06, "text": "also other AI models", "timestamps": [{"start": 187120, "end": 188288}]}, {"count": 1, "rank": 0.06, "text": "data extraction", "timestamps": [{"start": 78038, "end": 79238}]}, {"count": 6, "rank": 0.06, "text": "financial services", "timestamps": [{"start": 34626, "end": 36174}, {"start": 51210, "end": 52370}, {"start": 68262, "end": 69046}, {"start": 212584, "end": 213432}, {"start": 309400, "end": 310808}, {"start": 522500, "end": 523508}]}, {"count": 1, "rank": 0.06, "text": "larger financial organizations", "timestamps": [{"start": 387566, "end": 389446}]}, {"count": 1, "rank": 0.06, "text": "data summarization", "timestamps": [{"start": 110940, "end": 112028}]}, {"count": 1, "rank": 0.06, "text": "general intelligence or auto generative AI", "timestamps": [{"start": 123900, "end": 128012}]}, {"count": 1, "rank": 0.06, "text": "AI kind", "timestamps": [{"start": 202264, "end": 203160}]}, {"count": 1, "rank": 0.06, "text": "AI repercussions", "timestamps": [{"start": 49610, "end": 50898}]}, {"count": 1, "rank": 0.06, "text": "early AI leaders", "timestamps": [{"start": 398206, "end": 399294}]}, {"count": 1, "rank": 0.06, "text": "AI buddy", "timestamps": [{"start": 284682, "end": 285330}]}, {"count": 1, "rank": 0.06, "text": "AI hallucinations", "timestamps": [{"start": 440252, "end": 441516}]}, {"count": 1, "rank": 0.06, "text": "AI bruhaha", "timestamps": [{"start": 428996, "end": 430020}]}, {"count": 1, "rank": 0.06, "text": "AI perspective", "timestamps": [{"start": 545354, "end": 546538}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}