{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/803aff96-8b5a-4cd5-8c61-0b434320e889", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["belonging", "but", "by", "company", "conf fourty two", "creating", "employees", "from", "head of people", "improves", "increases", "najeeb khan", "productivity", "teams", "unattached", "wellbeing"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "20fb0142-b02a-4b37-b541-9e592c8188c8", "status": "completed", "error": null, "text": "Do you ever feel productive yet isolated with your team working remotely? I want to share with you the simple ways to create belonging within remote teams. Hey, I'm Najeef from team land. So by now, everyone's used to working remotely, and we're kind of in our second inning of remote work. We have 80 plus people on a Zoom call, yet we feel isolated. The loneliness aspect happens for a lot of people. The question is, how do we get your remote team to feel more connected than ever before? Well, right now, the reason why people are choosing remote work is they have to, because of COVID But why did people choose remote work beforehand? As someone who's worked remotely for eight plus years, some of the reasons are flexible schedule, being able to work from anywhere, no commute, spending time with family, and the ability to work from home. And because of that, our lives right now, in the past year and a half got impacted because majority of the companies now want to continue a form of remote work post pandemic. And because of that, talent as well. People want to continue a form of remote work, and a third will just flat out quit if they're forced to work remotely in the office full time. Working remotely leads to higher productivity and job satisfaction. I mean, it sounds good, but what are the challenges? Well, for one, the two of the biggest downsides and struggles of working remotely is collaboration and loneliness. These two encompass 40% of the challenges, not including being in a different time zone than your teammates. We're connected every minute, yet still feel isolated. We have slack project management tools, video conferencing tools, notifications, and yet we feel difficult to connect casually with others. Now, it's not necessarily the tech, but without the proper use of tools, we're feeling left alone. Now. Managers don't have it easy as well. When asked managers what they struggle with, 70% struggle with maintaining company culture and team cohesiveness. So what do we do? Well, first thing, the bad News first is that creating belonging isn't a one and done activity. In fact, it's like farming or working out. Now, the good news is that just like working out, it takes time. But there are also different ways of doing. So. If you look at the four stages of a team, forming, storming, norming, and performing, you want to address each aspect differently. When you're starting at a company or the team is afforming, you want to look at how are you onboarding everyone now? Before it used to be, hey, we just go out for a happy hour, but now it has to be done purposefully. Whether it's activity, employee led or company led activities. Now, when it comes from storming, it's conflict resolution that impacts a belonging and it's related to having empathy and understanding, whether it's coming from the manager or the HR. Now, the other aspect of norming is cooperation, entertainment, deepening relationships. Now, these can happen both synchronously and asynchronously, and by creating shared experiences through activities. That is what creates bonds, whether it's something as simple as playing trivia or doing a virtual escape room. Keep in mind, they're not all the same. You want to make sure that it's truly what builds trust when spending time, when it's done effectively. Now lastly, performing and this is where motivation, recognition, self fulfillment comes into play. And these are balanced of both intrinsic and extrinsic. If these are not looked after, it can lead to burnout. And this is where giving praise, affirmation, rewards helps, but not on the surface level. On the deep down aspect, one of the interesting quotes that I heard from one of the events that we've hosted is I like this party because there's no pressure to drink or dance or dress up. We have to realize that people, we're all in this shared struggle, yet we have to make it work uniquely for each employee. Whether it's a virtual cooking class, a yoga, meditation, or a weekly games night. There are a lot of options, but what do you do? I get this question from a lot of managers. What team building activities should I do? It always starts with the goal. Do you want to get to know others casually? Do you want to have cooperation, motivation or entertainment? Once you know that, you can figure out other options. And it can take something like five to 10 hours a month to doing it. But doing it allows you to improve the productivity, mental health and well being of companies, because that's what's needed. If you want to learn some more ideas of what to do of team building ideas, we have a simple generator on our site, teamland. So just check out our teamland.com and my name is Dajib. If you have any questions you can reach me out on Twitter or LinkedIn anytime. Thanks for listening.", "words": [], "utterances": null, "confidence": 0.951518437869824, "audio_duration": 328.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Do you ever feel productive yet isolated with your team working remotely? Najeef shares the simple ways to create belonging within remote teams. Working remotely leads to higher productivity and job satisfaction. 70% of managers struggle with maintaining company culture.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "remote teams", "timestamps": [{"start": 34476, "end": 35590}]}, {"count": 5, "rank": 0.07, "text": "remote work", "timestamps": [{"start": 42780, "end": 43846}, {"start": 61418, "end": 61934}, {"start": 66840, "end": 67538}, {"start": 92752, "end": 93402}, {"start": 100768, "end": 101334}]}, {"count": 1, "rank": 0.07, "text": "team building ideas", "timestamps": [{"start": 313332, "end": 314362}]}, {"count": 1, "rank": 0.07, "text": "team land", "timestamps": [{"start": 37084, "end": 37782}]}, {"count": 1, "rank": 0.07, "text": "team cohesiveness", "timestamps": [{"start": 156724, "end": 158378}]}, {"count": 1, "rank": 0.06, "text": "company culture", "timestamps": [{"start": 155402, "end": 156202}]}, {"count": 1, "rank": 0.06, "text": "video conferencing tools", "timestamps": [{"start": 137298, "end": 139154}]}, {"count": 1, "rank": 0.06, "text": "slack project management tools", "timestamps": [{"start": 135948, "end": 137266}]}, {"count": 5, "rank": 0.05, "text": "time", "timestamps": [{"start": 79538, "end": 79734}, {"start": 106356, "end": 106960}, {"start": 128892, "end": 129094}, {"start": 173320, "end": 173890}, {"start": 237878, "end": 238266}]}, {"count": 1, "rank": 0.05, "text": "What team building activities", "timestamps": [{"start": 285794, "end": 287474}]}, {"count": 1, "rank": 0.05, "text": "higher productivity", "timestamps": [{"start": 109492, "end": 110474}]}, {"count": 2, "rank": 0.05, "text": "activity", "timestamps": [{"start": 165624, "end": 166334}, {"start": 196518, "end": 197174}]}, {"count": 6, "rank": 0.05, "text": "people", "timestamps": [{"start": 45196, "end": 45510}, {"start": 51604, "end": 52206}, {"start": 60596, "end": 60862}, {"start": 66152, "end": 66402}, {"start": 98384, "end": 98874}, {"start": 270392, "end": 270786}]}, {"count": 1, "rank": 0.05, "text": "different ways", "timestamps": [{"start": 175032, "end": 175474}]}, {"count": 1, "rank": 0.05, "text": "struggles", "timestamps": [{"start": 119688, "end": 119966}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}