{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/7f30fe12-b12b-4bec-830b-1888bcb54bdb", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["achieving", "ahmed", "ambitions", "barriers", "be", "becomes", "becoming", "bootstrapping", "but", "by", "career", "ceo", "choosing", "communications", "conf fourty two", "core", "dedicated", "empowered", "excelled", "failurerejection", "from", "has", "holds", "humaira", "humaira ahmed", "humairas", "insecurities", "locelle", "maledominated", "overcoming", "pakistan", "shares", "startup", "struggles", "studying", "taught", "themes", "unique", "university", "values", "was", "women"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "fb1735fe-244a-4aaa-8cf3-71ffca54b949", "status": "completed", "error": null, "text": "Hello everyone. My name is Humaira Ahmed. I'm the founder and CEO of locale which is a mentorship platform created for women in the workplace. We focus on one to one matching with industry leaders for mentorship as well as guidance on the go. I'm so honored to be here in the company of incredible people like like yourself. And today I want to talk about a topic that is near and dear to all of us, that impacts us every single day. It's the topic of fear. While fear has many different forms, it's a broad topic and I want to focus on two types of fear today. One is a fear of failure. It's the fear of losing, the fear of rejection and fear of not being good enough. And we all feel that. And there is the other type of fear that I believe is worth fearing. It is the fear of regret. Because it's the fear of regret that drives us forward, unlike the fear of failure that holds us back. So let me put this into perspective for you. I'll share three of my life stories to give you more insight and to help you really understand the difference. Story number one, I was born and raised in Pakistan and my family moved to Canada 15 years ago. So I moved at the age of 20. In case you're wondering. I don't know how much you know about Pakistan, but it's a very male dominated, mostly suppressive society towards women. Growing up, I was always told what I could do, who I could be, what I couldn't do, who I couldn't be, and most importantly, and unfortunately, who I would marry. And at the age of 15, I was engaged to a man twelve years older than me, almost twice my age. And guess what? I hadn't even seen him. I also want to highlight something here that in Pakistan, engagements are as serious as marriages. It's the status quo. And although I hadn't seen the guy and he was twice my age, what mattered the most was that he was educated, he had a great job and he had money. All the key ingredients that parents look for. There was no consent on my end and I was told there was nothing I could do to get away from all of this because parents know best. On the one hand, I had fear of disappointing my parents. I was always on a vegan girl, wanted to make my parents happy. But on the other hand, I could also see my life being thrown away. It wasn't what I wanted. I had dreams, I had goals like all of you. And I had ambitions. And I knew that this marriage would take it all away. There was only one thing that I could do. And I'm going to tell you that it's going to sound lame, but that's the only thing I could do. And I did. And it was to cry. I would cry every single night. Go to my mom, tell her how much I didn't want to be married and I wanted to do big things in my life. And she would tell me to go study. This was going to happen. We are your parents and we have decided for you we know best. But two months before the wedding, something happened. I became really, really sick. I was so sick that I couldn't eat, I couldn't walk. And the doctors couldn't really find out what was going on. Until one day, one of the doctors diagnosed me with acute depression. At 15, I was depressed. The medicine I got was for depression. And it started to work. After weeks, I became better. And then, guess what? The marriage was happening again. Back on track. But one month before the wedding, my fiance called up my dad and he told him that after four years of trying, he finally received his h one visa to go to the USA to work. He was so excited. And he gave my parents two options. He said, well, he really wanted to take on this opportunity. He had worked really hard for it. And he said one option is that we get married in the next ten days and he goes to us while I stay with his family for three years in his aim and wait for him to come back and he'll take me with him to us. The other option, equally charming, was that I wait for the next three years until he returned and know we could get married. So all this time, either way, I was supposed to be tied to him. And then, remember I told you that engagements were has serious as marriages. His parents thought the same thing. They didn't think anything would happen. I mean, negative. My dad, on the other hand, was furious. He knew that I didn't want this marriage. He saw me cry every night. He told a guy in that moment that it was over. Nobody could believe it, but he said it was over because my daughter is not a burden on me. And by the way, she's not even happy with this marriage. And the options you've proposed are unacceptable. So this engagement is over. That's how I escaped my first engagement. And the lesson that I learned from this is that you never know. On the one hand, I did have this fear of disappointing my parents. A failure. But the bigger fear was the fear of regret. I did the only thing I could do. And little by little, my tears had an impact on my body, on my family, and in the end, it all worked out. So listen to your body, listen to your gut. When something doesn't feel right, it probably isn't. Story number two. Roughly a year later, guess what happened? I was engaged again. This time I had seen the guy and I can tell you did not like what I saw. But you know what, he was also, by the way, twelve years older. That's the theme here. But he had all the key ingredients that parents look for. He was educated, had a job, had money. This time. I mean, I'm seasoned here. I've done this before. I did my crying again, but I knew it wasn't going to be enough this time. So I applied to the best schools and I knew that if I got into the best school for engineering, I could negotiate with my parents. I was really determined to make my dreams into a reality. And I did get into one of the best schools for software engineering in Pakistan. And my parents were so proud. In that moment of pride, my mom called up my fiance's mom and she told her that I got into the best school for software engineering and that she'll go to school soon. My fiance's mom hung up and called back after half an hour and I was sitting right there with her, with my mom, and this is what she said. So I've spoken to my son and he's basically said that Shemera is not going to go to school. She's not going to go to school because three reasons, very good reasons. She'll lose her complexion. I mean, I'm going to get tanned. They like me because I was light skinned. For Pakistan people, that is the thing. Two, I'll have affairs because that's what happens. He doesn't want his fiance to go to school to have affairs. And three, that I wasn't going to work anyway after school. So why waste your money? So three good reasons. Loose complexion, she'll have affairs and she's not going to be working after marriage anyway. Why are you wasting your money? Very good reasons. But here's the interesting part. Not only that, they actually recommended three things that I should be doing or my parents should be doing to help. The first one is to learn to cook different types of breakfasts because my fiance didn't eat the same breakfast every day. So I mean, of course that's a useful skill because that's how I'm going to make my husband happy. So one was to learn to cook different types of breakfast every day. Number two was to lose weight. I was fat. I mean, I wasn't fat. I was athletic. But there's no such thing as athletic in Pakistan. I should lose fat and stop eating rice and potatoes and focus on my looks. And the third thing is, I should learn to be a good housewife and learn all the skills that I need to. If I really need to go to school, I could go to home economics and just focus on how to be a good housewife. These are the lessons that they believed that were going to be useful to me, helpful to my parents, versus going to school for software engineering. And how could I? I mean, he was also, by the way, an engineer. How could I compete with my fiance? So my mom was dedicated. And I remember she looked at me in the eye and said, I am so sorry. We made another mistake. We rushed into it and I think we're going to end this for you. I just couldn't believe it. I mean, once, sure, you can get away. Second time, yes. My dad got home from work and my mom told him everything. And my dad asked me for the rink back. I mean, I knew this was legit, this was going to happen. And so my dad called up my fiance's mom and said, we would like to have you over tonight and talk about something important. And guess what? They were waiting to come to our house. They came over that night in full core with ten people. They have their family, like the brothers, the sisters, the kids. Everybody came to tell us how it was going to be done. And my dad, he just looked at them and he's like, whoa, before you say anything else, here is your ring back. This engagement is over. My daughter, again, is not a burden on me. And you have shown us your true colors even before marriage. And it was over. They were crying. And anyway, long story short, that engagement ended, too. So the lesson I learned from that was to commit to yourself. I knew that crying was going to help a little bit, but because I had done it before, this was not going to fly. This time, I needed a legit reason. But I did that by really working hard to get into the best school, because that was so important. I mean, in Pakistan and a lot of cultures like Pakistan, education is everything. Like, you need to be a doctor, scientist, lawyer, engineer, all of those things, and you're respected. And I had gotten into the best schools. So that was the one thing. If I had just sobbed and not worked hard to get into this school, I mean, none of this stuff would have happened, right? So commit to yourself. Show up for yourself. That is an important lesson that I've learned that we all need to do to further our lives in the way that we want. Last story. Story number three. Fast forward ten years from then. I'm in Canada. Barriers to the guy of my dreams. I have two little girls. I'm a mother of them, and they're just so wonderful. And I have all the support in the world. It sounds fantastic, but less than three years ago, I had an idea about my company, Locelle. I wanted to be an entrepreneur. Many people told me that only 5% of ceos in tech are women. And over 90% of the tech startups fail in the first year. So if you put the two and two together, the chances of me failing were really, really high. Why bother? Not as many female role models. And even today, there are so few women leading tech companies. And I could have taken the easy route or get worried. Fear of failure, fear of losing. Fear of rejection. But I have two little girls, and I want them to lead life fearlessly. And I wanted to set a really good example, not just for them, but for other women and girls. So instead of fear of failure, I focused on the fear of regret. Hey, sure, a lot of companies fail, but what if I was one of a few success stories? What if I didn't even try? I would never know. So when you have that feeling that you want to do something, go for it, listen to it. It's rarely ever wrong. Lots of failures, lots of challenges. But I have no regrets. I've pursued every opportunity, including this. And we're working with amazing tech companies, very reputable tech companies, as clients, and we're making the world a better place. We are on a mission to create equitable workplaces for women. And that's exactly what we're doing through our mentorship, through our guidance, through our democratization of access to knowledge for women. Because, again, we don't have a playbook. We are creating that playbook. So, I challenge status quo. I am one of the 5% of the CEO in Canada today, but 90% of the companies fail. Sure, I knew I would try it and see what if I became one of the 10% of the companies that actually succeeded? And I'm so excited to share with you that we actually just celebrated a third anniversary last week, and less than 30% of the companies actually make it beyond the three years. So in some ways, we have already challenged status quo. And we have actually done a lot core than people expected of me. I challenge status quo every single day. By being a woman in tech, by being a woman leader, CEO in tech, woman of color. And it's all worth it. So with all these three stories, I want to share. Recap the common three lessons. One, challenge. The status quo. Especially if it's the right thing to do. There will be people who will tell you what to do, do what feels right to you. Two, persevere. Persevere with all your might for the right things in your life. Never give up. And the last lesson that I can share with you today is to commit to yourself. Show up for yourself. And I know a lot of themes, especially has girls, just people in general. We're raised to put others before us, care for others, especially women and girls. And we give more than we take. But you know what? Sometimes it's really good to be selfish and show up for yourself and put yourself first. And so I'm now happily married with two girls. I'm an entrepreneur. I'm doing great things with my company, and I can tell you, even my family is very happy. My parents are so proud. They share about me with everybody. My girls have someone to look up to, and I'm helping other women because I did challenge the status quo. I did persevere, and I showed up for myself. So today, I encourage all of you to connect with people at this conference. Reach out. They're amazing leaders here. And show up for yourself. And today, I also want you to think of something you really, really want for yourself. Write it down and focus on it. Something you'll regret in life if you don't go for your dreams. So I'm going to end this talk by sharing that. Do not let the fear of failure stop you from shaping your life. Use the fear of regret to drive you to do the great things you are meant to do. Thank you so much.", "words": [], "utterances": null, "confidence": 0.957433333333332, "audio_duration": 878.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Humaira Ahmed is the founder and CEO of locale which is a mentorship platform created for women in the workplace. We focus on one to one matching with industry leaders for mentorship as well as guidance on the go.\n- In Pakistan, engagements are as serious as marriages. The fear of regret drives us forward, unlike the fear of failure that holds us back. I'll share three of my life stories to give you more insight and to help you understand the difference.\n- Shemera got into one of the best schools for software engineering in Pakistan. But her parents didn't want her to go to school for three reasons: She'll lose her complexion, have affairs and not work after marriage. Her parents recommended three things she should do to improve her looks.\n- Only 5% of ceos in tech are women. Over 90% of the tech startups fail in the first year. Locelle is on a mission to create equitable workplaces for women. \"I challenge status quo every single day\"\n- So with all these three stories, I want to share. the common three lessons. One, challenge the status quo. Two, persevere. Persevere with all your might for the right things in your life. And the last lesson that I can share with you today is to commit to yourself.\n- And today, I also want you to think of something you really, really want for yourself. Write it down and focus on it. Something you'll regret in life if you don't go for your dreams. Do not let the fear of failure stop you from shaping your life.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.06, "text": "tech companies", "timestamps": [{"start": 665018, "end": 665854}, {"start": 707444, "end": 708158}, {"start": 708938, "end": 709342}]}, {"count": 1, "rank": 0.06, "text": "amazing tech companies", "timestamps": [{"start": 707012, "end": 708158}]}, {"count": 22, "rank": 0.06, "text": "fear", "timestamps": [{"start": 58276, "end": 58922}, {"start": 59476, "end": 59786}, {"start": 65284, "end": 65514}, {"start": 68100, "end": 68286}, {"start": 69944, "end": 70126}, {"start": 70968, "end": 71118}, {"start": 72392, "end": 72654}, {"start": 77388, "end": 77778}, {"start": 80508, "end": 80786}, {"start": 82444, "end": 82658}, {"start": 86268, "end": 86466}, {"start": 165252, "end": 165546}, {"start": 321992, "end": 322382}, {"start": 325758, "end": 326382}, {"start": 327048, "end": 327246}, {"start": 668750, "end": 669086}, {"start": 669582, "end": 669806}, {"start": 670238, "end": 670446}, {"start": 679868, "end": 680098}, {"start": 681564, "end": 681698}, {"start": 866548, "end": 866794}, {"start": 870932, "end": 871274}]}, {"count": 2, "rank": 0.06, "text": "other women", "timestamps": [{"start": 678108, "end": 678502}, {"start": 834754, "end": 835414}]}, {"count": 1, "rank": 0.06, "text": "Pakistan people", "timestamps": [{"start": 417128, "end": 418338}]}, {"count": 2, "rank": 0.05, "text": "great things", "timestamps": [{"start": 824776, "end": 825154}, {"start": 874148, "end": 874918}]}, {"count": 14, "rank": 0.05, "text": "parents", "timestamps": [{"start": 155124, "end": 155546}, {"start": 162116, "end": 162426}, {"start": 166388, "end": 166950}, {"start": 169688, "end": 169966}, {"start": 205492, "end": 205914}, {"start": 247408, "end": 247734}, {"start": 284492, "end": 284834}, {"start": 323448, "end": 323950}, {"start": 357492, "end": 357866}, {"start": 377032, "end": 377470}, {"start": 385932, "end": 386274}, {"start": 448784, "end": 449046}, {"start": 495568, "end": 496166}, {"start": 829048, "end": 829338}]}, {"count": 1, "rank": 0.05, "text": "Many people", "timestamps": [{"start": 645494, "end": 646042}]}, {"count": 11, "rank": 0.05, "text": "school", "timestamps": [{"start": 373784, "end": 374402}, {"start": 393552, "end": 393706}, {"start": 395728, "end": 395914}, {"start": 407828, "end": 408206}, {"start": 409124, "end": 409390}, {"start": 424168, "end": 424354}, {"start": 429100, "end": 429622}, {"start": 487644, "end": 487862}, {"start": 497296, "end": 497514}, {"start": 585932, "end": 586326}, {"start": 607732, "end": 608270}]}, {"count": 1, "rank": 0.05, "text": "big things", "timestamps": [{"start": 200512, "end": 200954}]}, {"count": 1, "rank": 0.05, "text": "incredible people", "timestamps": [{"start": 48636, "end": 49606}]}, {"count": 2, "rank": 0.04, "text": "different types", "timestamps": [{"start": 453594, "end": 454186}, {"start": 467214, "end": 467598}]}, {"count": 1, "rank": 0.04, "text": "Last story", "timestamps": [{"start": 624472, "end": 625410}]}, {"count": 1, "rank": 0.04, "text": "many different forms", "timestamps": [{"start": 60116, "end": 61322}]}, {"count": 7, "rank": 0.04, "text": "life", "timestamps": [{"start": 92112, "end": 92314}, {"start": 172648, "end": 172834}, {"start": 201328, "end": 201610}, {"start": 673992, "end": 674242}, {"start": 796832, "end": 797322}, {"start": 860148, "end": 860574}, {"start": 869716, "end": 870174}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}