{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/91ad65b2-fee5-4afb-9e42-7c4a0da8be4e", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["aiml", "algorithms", "app", "basics", "briefly", "by", "can", "chatgpt", "chief innovation officer", "conf fourty two", "english", "experts", "machine learning", "ml", "product", "rich niemiec", "understand", "understanding", "viscosity north america"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "01781d60-b057-43ae-b012-e27a00824bd0", "status": "completed", "error": null, "text": "How do you make a difference in the world? The answer is you leverage technology. Are you leveraging technology today? There's many types out there right now, but I'm going to look at some of the ways you can use not just AI, it's a big word right now in the world, but how to also leverage things like machine learning and start to build foundation models for the company that you serve. We're also going to look at where exactly to use AI and machine learning for a given company. And I can tell you this, it's different for every company. I have a few examples of the Twilight zone. That's an image here that it shows. But we're moving very quickly from machine learning algorithms to deep learning. As we look at a neural network and image recognition, we use deep learning and moving to foundation models. Those models like large language models. We'll talk more about those in a little bit. I work for a company called Viscosity, though we do a lot of different services. I spent a lot of time on the database, but I've also done apps, much development, especially machine learning, different clouds, not just Oracle, but Azure, Google, et cetera. I work with a company that has several oracle aces, and these are basically the best of the best that are out there, and they've written many books. Some of these are mine. But whether it be tuning, whether it be on Linux, whether it be on hardware, whether it be on Docker, if you want to copy these slides, you can send it to the hello@viscosityna.com. Or you could just send it to my email as well. And there's my Twitter where I tweet a lot of stuff. This is from the Midwest Oracle user group where we actually had spot the dog, Boston Dynamics. We talked about AI, and that was a couple of years ago now. But like I say, how do you do well? How do you make a difference at the company you're at? And the answer is, remember the acronym win? What's important now? What's important now so that you will be able to leverage the things you need in AI? What are the little pieces of technology that are needed for your specific company that maybe doesn't matter as much to others? We're going to start with the economic potential of Gen AI, generative AI, and also AI in general, economic impact of robots. How's that going to play out over the next few years? Machine learning and Oracle. This will give you a feel for some of the algorithms that are out there and how you might use them. And we'll look at some generative AI that's coming in. The paper that started it all with large language models, transformers, which came chat, GPT was based on with OpenAI, and then foundation models, maybe where we're going and the vector database and companies like Cohere as well, Bard from Google and so on. We'll look a little bit at robots and where we're going, but if we look at the economic potential of Gen AI, currently, 25% of a firm's value is digital capital, but most of them aren't using it. Are you using that? One of the reasons people won't share their digital capital is here on the left, can be copied perfectly, infinitely. And this comes from a McKinsey paper that Oracle recently mentioned. There's also a symbiotic relationship between you and a robot that can help you do your job. And you could see they talk about ceos or cios. They say you have to have algorithmic business thinking. And this is from the university. MIT could see this is their most expensive class, but it's giving you what a robot can do. Well. Well, they don't have that creative human touch, but basically there's this physical and digital that. If we combine those two worlds, you'll be even better. With that augmented help in Twilight Zone, they had something called the brain center at Whipples. That was an episode where they tried to start to talk about how they're going to eliminate jobs, and they eventually eliminated the boss's job. I think robots are much more advanced than the ones you saw here. Amika has expressions. Spot and Atlas can do physical things that are amazing. Sophia robot very intelligent. Tesla bot coming. Elon Musk said Tesla bot will be bigger than Tesla the car. But there's definitely going to be an impact to jobs. And in certain countries, it'll be heavier, but usually at the lower level jobs, not to say some of the higher level jobs won't be hit. You could see it at Amazon's warehouse, where robots are constantly moving that warehouse to make it most efficient, where robots stack things, where robots drive cars or deliver things. How about leverage? Are you leveraging the database, gps robotics in your company? And then some people say, well, are we going to be obsolete? And in the twilight zone, obsolete, man, the guy worked at the library, was librarian. But there's a lot of jobs that are obsolete. Pinsetters, telephone operators that used to just plug in different phones, ice cutters. Do we need those jobs, or should we leverage robotics to help us to do better? Now, if you're a database administrator and I know a lot of people are here. I know we have a lot of security talks here, which is phenomenal. I have some great python, a great python talk, which also has to do with machine learning. But when you look at the jobs, they're still growing. If I look at emerging jobs for developers and dbas work as part of the, not the analytics team, really, the machine learning or AI team used to be the analytics team. I always tell people analytics is maybe when you're looking at 100,000 records or something like that, whereas machine learning, you're looking at billions, trillions, and you're looking at them over and over and you're looking at them in different ways. But when I look at the big data that's out there, I like the five v's, volume, it's big. Velocity is coming at you very fast, but the value is different. Very important to have somebody that understands the value of those different varieties of data and also the truth, the veracity of that data. Oracle has tried to put it. So you could do Json, or you could do relational, you could do graph database inside the same database, or spatial for that matter. That's a little bit about that. But what does data do? For me, it tells me something. What do I need? It was a guy that would give you what you needed in the future in this twilight zone. But what does a CFO need? We don't want to give them what we used to give them, which was analytics. Oh, here's how your numbers were. We want to give them something that's more predictive. Here's what your numbers are going to be, or even prescriptive. Prescribe. I'm going to prescribe to you what you need to do to hit the number you need to hit. So we're moving from predictive to prescriptive right now. Also, some people think most of the job when I get to the world of AI and machine learning is with a data scientist, but that's 20% of the job generally. Most of the other part of the job is making sure I have the right data, identifying it well, making sure it's cleansed, making sure I don't have any bad data, making sure it's correct, make sure it doesn't have any biases. These are going to be dbas and developers doing those jobs. But Oracle has a database called an autonomous database. Is it a robot? Well, lux is a robot, Siri is a robot. They just don't walk around and they work 24/7 they don't ask for a raise. But the autonomous database, manage my database, secure a system, use machine learning and AI to secure it, to tune it, to put on a patch before I even know the patch exists or is needed. Even Oracle unveiled this in 18 C, and right now in their main database, 19 C, they have it also in their later versions. But Oracle's focus isn't to be a retail innovator. Let's say like Amazon. They don't want to be a search or marketing innovator like Google. They're literally about making you the innovator. They want you to win. They like, as Larry Allison says, I like leaders. People do things before they become fashionable or popular. He's saying, I like innovators, people that do things first, that leverage and use the technology. And they put machine learning in all kinds of things, their apps, financials, manufacturing, and so on. They've also built an autonomous database. We'll talk about that in a minute. They also bought an open source platform called datascience.com, where you can actually leverage those open source algorithms. When you look at machine learning, I think it's very important to start with the business problem. What am I trying to solve? I have good customers. I want to know which ones are good or bad. I want to know which ones in big data look like my good customers. What is that business problem I want to solve? It's not to make more money. It's to do something specific that maybe will lead to making more of a profit. Then I find a function. What do I want to perform? Why I want to separate good and bad customers. Maybe I want to classify them. Then I have several classification algorithms I can use. So what's the problem? Do I want to cluster big data to see a certain age group that I know buys my product because I want to increase my sales, is the business. And then the function is clustering, then the algorithms. One of the clustering algorithms. Or am I looking for anomalies like fraud or things like that? So first I'm going to train the model with 60% of my data so it gets to know my data well. Then I'm going to use the other 40% and say, how are you doing? Are you finding the right stuff? Are you finding the most important things? And as I said, I'm just going to give you a feel for this. I'm not going to teach you machine learning. You can download this talk, obviously, but you'll have to use it in the specific parts of your business that matter. So a business understanding product, employees that leave no based on past employees, maybe that voluntarily left, maybe that we're doing a great job, target the best customers. What makes my best customer? Is it how much they buy? How profitable it is? What do they buy together? They buy item a and item c. Is there another customer that I should be using a chat bot to tell them you should be buying item c as well? Or is it clustering of data or something else with Oracle? And I won't go into too much coding here, but all it takes is, you know, what am I trying to do, trying to find out what are the attributes attribute importance of certain customers that get them to want to buy insurance. And if you know SQl, you could see I look at a table and I want to do it by customer id and whether they're going to buy insurance or not and what are the attributes, then the output is going to tell me what really matters as to whether they're going to buy insurance or not. Then I'm going to classify that data. I'm going to say now that I know the attributes when a person walks in the door. Now I want to know if they're going to buy insurance based on those attributes that I know are the most important attributes. And then I can predict that. Or I can have a salesperson call different people to see which ones are likely to buy it. I'm not looking to teach you SQL or show you that. I'm just trying to show you it's not difficult to make a very large impact. This would already make a large impact in your company. Now these are some of the algorithms that are out there. I'm not going to dwell on these. These are some of the Oracle algorithms names. They also have different know. If I'm clustering data. Well, how many clusters is it? And then Oracle, also very important, has a product called autonomous database. And you can go to www.oracle.com, go to cloud slash free, and you could actually get a free copy of this as long as you're using it. You get this provision which means you've built a database in all two minutes and then to start it up 30 seconds. Then they give you a lot of different examples. So again, how do I leverage these algorithms? I could do it by getting this free version of the autonomous database and then go and cluster some data with R if I know R or with Python if I know Python, or with SQL if I know SQl. So actually they give me a way to do that in different ways. Now once I go in there, there's something called a notebook and it's a series of Python or SQl statements similar to the SQL I showed you earlier, where I call some algorithms to do some function. Once I know what business problem I want to solve, start there first, and then I can graphically use some of the other stuff. But what do I need to know? SQl, Python R. In this case, I'm predicting where it's anomalous customers and why are they anomalous, what are the attributes? So once I found that they're anomalous, what are the attributes making them anomalous? I look at machine learning, and it's a lot like the twilight zone, where it's a game of pole, and the guy says, you want to be the best at something, you've got to have talent. You've got to have a little bit of luck. Got to be at the right place at the right time. Oh, you're watching this video. You're at the right place at the right time. At a time when machine learning and AI is coming. You got to work. You got to actually build stuff. You got to leverage your knowledge, but also add to it, and you got to have nerves. You got to be able to go to somebody and say, I can make a business decision. I can make a business impact if you'll make a decision to use AI. So now I just want to show you, to give you a feel for some of what's out there. As I said, what's my problem? Maybe I want to get good and bad customers. Well, I could use classification algorithms. So these are the algorithms in black, and classification is the function I'm trying to perform. But these algorithms are not doing the same thing as each other. So one of them, let's look at an example of one decision tree algorithms. Looks at, oh, maybe I'm a lawyer. I take a case. Maybe I proceed. Maybe I'm going to win. Maybe I'm going to lose. Maybe there's costs if I lose. Maybe there's benefits or damages if I win. Then I calculate all those models and say they should take the offer instead. So what is a decision tree? A lot of different choices of data you already know about a business to make decisions quickly. One algorithms to classify whether I should take a case or not. Here's an example. I don't know what happened there. Sorry. Here's an example of where I'm using a decision tree, and I want to find out. I want to classify the data to see if somebody will buy this sports logo credit card. And then after I do that, I run it, and now I have the probability and the cost of this that I could now give to my salespeople. But it's not a lot of code. I'm not teaching you the code, but just showing you it's not a lot. I'm giving it a function. What is it doing? I'm giving it a table, a column, and will somebody actually by it or not? And first again train it with 60% and then use it with big data or something like that. Now, random forest, similar to a decision tree, but it's like having a lot of decision trees. And I don't want this curvy line. I want to smooth things out a little while a decision tree, if I have six ones and three zeros, it'll say, well, it's a one, and it keeps us from too closely fitting things. Or do I want to do a neural network classifier? This is great for classifying images. Let's see, I show it 1000 pictures of cats and it knows what a can is. 1000 pictures of dogs, 1000 pictures of people. And then I tell the autonomous car, don't hit these three things. Well, you need more than three. But it also does speech recognition, handwriting recognition, and it's built based on basically math that was built maybe 70 years ago. Some of it, some of it was even in the late 18 hundreds, just to let you know. But I have this neural network, a set of neurons, and maybe I'm looking at the images and I find edges or I find object parts and that becomes objects. Then through this equation, going through these levels, I use something called backpropagation to find and kind of tweak it. And you see a lot here. I know this slide I could probably spend an hour on, but it simulates or really copies the mind. I'm looking at a dog, I look at different levels of different things I'm looking at. Then it can tell me is a cat or a dog. Now, the difference with deep learning is maybe I tell it about which features I want with machine learning, whereas in deep learning it just looks at the images and it figures out the features that are important. So am I trying to classify things? Am I trying to classify cases? Am I trying to classify images? Am I trying to classify words? Depending on what it is, you might choose a different algorithm. Or am I doing anomaly detection? What's in this sphere and what's outside? Am I looking for anomalies? Somebody built the math maybe 50 years ago and said, this is what's inside the circle and these are outliers. They might not be anything that's a problem, but they're anomalies, and I might look closely at it. There's also a linear one where it will separate good and bad customers as well, not by the green or blue line, but by the red line. They also use anomaly detection with very minor subtle anomalies. Nuclear power plants use them, major airline jets. Oracle's exadata hardware uses them to look for those subtle anomalies. So am I looking for big anomalies, subtle anomalies, and there's clustering of data after. Let's call k three down below, trying to find separate this into three equal groups by distance, just to let you know. I can also do that with Oracle's analytics cloud product and just set it to that number. But Oracle goes one step further, says, I'm going to give you another algorithm where it separates it by density. When it comes to voting, well, people are grouped together. It's not distance based where k means is distance based o cluster density based clustering. It's also time series algorithms. Is this the kind of problem you have as a business or the kind of opportunity while your video games are extremely seasonal, or maybe an Airbnb is around certain events that happen? I don't show it, but they also have some models like exponential smoothing and double exponential smoothing for Holt winners. So would you think of a line of a stock that's very going up, down, up, down, up down? Let's smooth that out a little with exponential Smoothing. Another kind of time series algorithm. It's also regression. Most people look at regression and they go, wow, it's a straight line. There's some points. I know what's going to happen in the future, but if the points are far from the line, there's a big difference. The r squared, it's called coefficient of determination. How far are those points from the line? That matters a lot on how good your prediction is going to be. It's a linear regression. But what about when the points are all over the place? Well, with machine learning, I can still put lines through that and find it. Let's say it's a sine wave or a cosine wave. I could use some of the other ones, like support vector machines. How about attribute importance? I found my good and bad customers. Now let me find out what attributes are making them a good customer or a bad customer. Can I fix it? Some of those that are out there, principal component analysis does what if you think of all the things that, let's say, make up your good customer. Oh, they're a good customer because they buy very often. They're near us, things they buy are very profitable. They buy consistently. They tell other customers we're good. Then I make a matrix of numbers and say, this is a great customer. Then I compute that eigenvector, or what are the principal components of that matrix? Maybe I have 80 different reasons of why this person buys something, but 20 of them really matter a lot. Well, that makes it a lot faster if I limit it down. But the word eigen comes from the dutch or german word, which means just like my very own. So you might buy a car. You say, well, what I really want is a car that's just like the one I have now. I want my Eigen car. Well, what you really want to find is your Eigen customer out there with all those values. Principal component analysis tells me what attributes they are, and they're also putting these in toys. Now they know what attributes make a good toy. Then there's association rules. Now I found the good customer, the attributes that make it. What are they buying together? Can I use a chat bot to get them to buy other things, also known as what you would like. Next algorithm. You bought the bread. Now I bet you would like the milk. Maybe it's called the a priori algorithm. Specifically, what do they buy together? Well, they buy the beer and the bread and the diapers and the bread and the milk. Well, really it's just the bread, diapers and milk that they buy together. Do I want those close together or far apart? I guess it depends on the store. But do you have that kind of association market basket kind of algorithm or function that you want to perform? And there's feature extraction, and this is to speed things up. So maybe I have a matrix, but really I just need a few pieces of each of those matrices, so I'll speed it up. And then again, I can use principal component analysis as well. Where I'm looking at the main components, there are very few components that make up a face. So I can limit it down very quickly. And it doesn't have to be eigen faces. It could be cats and dogs, for that matter. But there are things happening right now with robotics where people, and this is an example, etern nine is saying, hey, we can make you better. We can make somebody that helps you work by augmenting you. Let's give a robot that will help you, but it's based on maybe your attributes and things like that. So things are going fast and you want them to look exactly like you. Well, they have all the cosmetics they need. What about SQL analytics? What I really want to do is look at different views, whether I'm a regional manager, ad hoc, or want to look at all sales or financial managers, view whoever it is falls into a different category. So a product that does, and Oracle does this, where they look at different aggregates in different ways and dimensions, but they also put those things in memory, you get to partition it so I don't have to look at everything. So it's much faster. But at the same time, I could put that in memory as well. And they also have some statistical functions in Oracle and other products too. But pretty much anything you could ever think you want to do, it's out there somewhere. So what did I try to do with machine learning? I'm trying to find out my problem and the more detail I can get. Maybe it's a number problem, maybe it's words, maybe it's something over time, whatever that is. Then I say, what function is it? Classify good and bad customers? Regression. See if I'm going to hit my numbers or tell me what attributes I need to hit my numbers. And then which algorithms out of the algorithms for a given function do I want to use? And I'll train that model, find that out who's good and bad, score it on the other 40%. Did it work? Maybe I got to do a different algorithm and then use that algorithms against things like big data. With Oracle and other products, there's also auto machine learning where I just say, hey, I want to try all the different algorithms and classification in this case, and I want to create. You create the notebook for me when you find the best one with the highest accuracy, and then in this case, it's building a python notebook for me. Something took me days to do, Oracle took all of four minutes to do. I think you get time enough at last with auto machine learning. And the reason why it's important is because AI is really driving things fast, and auto machine learning can give you these notebooks very quickly. Oracle also has hardware that does this, whether it be multi tenant. Maybe those are different business groups or different customers. Even in memory database, real application clusters, if one node goes down, the others are up. That's for recoverability or for availability. Rather, can active data guard is an off site failover where it has recoverability. But like I say, these are some of the key algorithms I think you should start with. Think of your business. What am I trying to do? And is there something that can help us do it faster? Number one job, AI machine learning specialist. It could be you, maybe after this class. What are you trying to do supervised learning. That means you have data, then you want to classify it and see what is identified as fraud. Or are you looking to build an autonomous car and you need to do image classification to see so you don't hit things on the road? Or is it regression to a market forecast? Or maybe you don't have data unsupervised. Learn just cluster data and give me customers that are similar to my best customers. Oracle does this in all of their products where you don't even have to do that. Whether it be financials, whether it be sales, whether it be retail. They bought a company called will it be manufacturing something like JD Edwards or human capital management where know looking at employees and what they need to make sure I keep them. Oracle Lowe's going one step further now. They've got, as I said, the autonomous data warehouse. You could try it for free, but they also build into it hundreds of pre built dashboards for financial supply chain and these other products that are out there. They're also putting generative AI. So generative AI is I'm using data to generate even new data. And here's a QR code that you could get to look at their vector search that they're building now, but their goal is to put it everywhere to start to use large language model to generate the SQL for you. And I'm going to show you an example of that prompt engineer, just to let you know, you go to Chat GPT and say show me an elephant dancing. Well, that would be Dali images. But if you said build me some SQL that will find my top customers given my table name is this and I want to look by this column or sales or something like that. So a prompt engineer new job coming will do that for me. And then Oracle is going to build that SQL for you. So here's an example of a prompt. The more instructions you give in the prompt, the better your answer will be. I'm giving it the names, I'm giving it the tables. Maybe I'll even have it create the tables. And then I'm going to find out the average salary of employees that are out there. Oracle has a product called Apex, comes free with the database. I find this to be almost the best product on planet Earth. I forget exactly how many implementations are, but it's well over a million different products that are out there. They have some quicksQl of building a table with different values and then it shows you the create table and create employee table that it's building based on just this little bit of SQL. That's helping me a lot. I could also look at the table view and how these tables relate to each other. And again, some quick SQL here. But then I can create a page item and say, oh, I want a chart of employees by department. It's words, it's not SQL or anything else. So I say, okay, create a page. The prompt is, I could say, I want a chart of employees by employee and give you some examples of what you want. And then you go next and you start and it builds the SQL. You need to look at these tables that you had built very quickly, and now you run it and actually shows you employees by department very quickly. Now I want to go one step further and say, well, how about show me average salaries by job? It'll take that SQl query and it'll now make it average salary by jobs. This just shows, if you're familiar with Apex, how it's building that SQL for you that you used to build yourself. So is it replacing me, a developer? No, it's augmenting me. It's making me faster. Then this just shows me. Now I have an employee by department and I have the average salary by job. Took me all of a minute and I'm done. Here's the one. So it's 2 million apex apps 3000 a day are being built. It is the number one low code, no code product that's out there. But they're going one step further. They want generative AI to do this for me. The developer in English gives it to you. The database retrieves what it needs, then it gives it back to you based on the context that you're looking for. When Larry Ellison was at Cloudworld, just, I think it was a couple of months ago, he said, hey, generative eye is going to change everything. He said, is it the most important thing ever? And he said, well, you're about to find out because they've spent billions on it. So you're going to find out. Chat GPT is actually 3.5, came out last year. There's also cohere, and there's also bard and other things like a lot of large language models. Think of the algorithms we had. Well, some of those algorithms are for language. Well, somebody took some of those algorithms and they started building a very large model, really a foundation model for language so that they could then ask questions and make it basically do it for chat. Oracle's doing a lot with healthcare because they bought a company called Cerner. It's making them improve their products because they're using their own products. Oracle is also driving first responders using the future. Tesla car actually used to use the old one. They're driving first responders using AI. But, you know, AI is going to be big because if you look at things like Uber, it took 70 months to hit 100 million users. Instagram took 30 months, still over a couple of years, two and a half years. TikTok only took nine months, but Chat GPT-2 months. And if you look at Chat GPT 3.5 and Chat GPT four, it also does things like images, the more recent version. And I put a few things in here. I don't have time to cover it all, but Chat GPT, how does it work? It's trying to predict the next word. You're asking a question. It's formulating a response based on the entire Internet or whatever else they have. But it's going to get us to artificial general intelligence. I'll show that in a minute. But it's this time of what I would call exponential development. But also some things it doesn't have. When you're thinking about something and you're working, you're thinking, you don't write that down. The other downside is they also have hallucinations, 100 layers of neurons, but still hallucinates means comes up with something that doesn't make any sense. Oh, Rich spoke in southern Illinois, and maybe I never did, just because I had spoken in a lot of other places. These are all the different large language models that are out there. There's many of them. But if you go to Chat GPT and say, what's the top ten database? And when you sign up for it on OpenAI, you get Chat GPT, you also get Dolly. Chat GPT is words, dolly images. There's also an API, but it gives me the top database. Oracle MySQL, SQl server, postgres, mongo. Now, if I go to Bard and do the same thing. Oh, and I did want to show you that GPT four arrived just in March. Chat GPT 3.5 was November 30. That was the one that changed everything. It hasn't been that long, but Google's bard, which they've also been working on a long time, gives me the same thing. Oracle MySQl, SQl serve, postgres, manga. But then they have some different databases at the end. And the reason why is, notice, I'm going to go back again a second. As of my knowledge, as of September 2021, Chat GPT, whereas Bard is right now. So the top half of it is the same. But what started all this is a paper called transformers. I'm going to point to Aidan Gomez in a minute, but basically it's a neural network, has an encoder and a decoder. The left and the right use something called transformer technology. And it's looking for, notice the name of the paper. Attention is all you need. It's looking at as I get a statement, what words do I pay more or less attention to? And then it feeds them back in. And then as I'm writing an answer, I'll even feed back in what I'm putting so it can use that information as well. And this talks about it more if you download this. But GPT stands for generative pre train transformer. I'm training it on language so that now when you use it as a chat bot, it knows something based on all of this training that I gave it. And how much do I train it? Well, GPT 3175,000,000,000 parameters. GPT-2 was only 1.5 billion. GPT four, 1 trillion parameters. People use it with things like deep fake GPT four, not as much information about it. And here's just how it looks as well. But I'm going to put images and numbers now and words so I can get answers. Oracle, those going maybe a step more functionally towards something you can use, and they're using a product called Cohere to do the large language model, but they're also building and now have a vector database. So basically I'm taking something and I want to store it in that vector database. So I very quickly can use a large language model to ask it questions. And I want to show you an example of that in a second. But they also have vector indexes, because Oracle is very good at security, they're good at data, they're good at indexes. They've also put that into the vector database. But basically I take a document or image based on the content, not necessarily the pixels, like I would do in a neural network, but it's the content of the image. It matters more. Then I could talk to the system like Chat GPT and pose questions. But now I'm using a vector search in the database to get that answer. It's not going to replace experts, but let's look at an example. So vector represents the image, represents a document or a video or something like that, a series of numbers for those that know vectors, what's the type of roof? You can think of it as the eigenvector. This is my eigenvector of the house. I want to buy, well, when it stores other houses, it says, well, these houses are vector wise very close, but this one not so close. So you're not going to want to buy these two, even though maybe they're in the right location. I can have an app and say, hey, I want this one, go look at this in this other area and it will tell me which ones are similar. So if I wanted this house, I'd find one similar. Then Oracle, in addition to JSON documents, graph data, JSON data, relational data, spatial data, it also is now adding vector data. So now I can just use SQL and just say, give me the house based on this photo that I gave you, which of course is going to have a vector associated with it in this city at this price in this house. Now I could search for it just like I do other things in SQL relational database, but now I could do it with an image in a vector wise. So Oracle's added that vector and there's that QR code again, if you want to look at that vector search. Oracle didn't build their own large language model. They partnered with a company called Cohere. And I said, remember that guy, his name on the transformer paper, Aidan Gomez? Well, he started a company called Cohere and he worked on that paper that came from Google brain. But basically they're turning those words into numbers, but with semantic knowledge and attention of which words matter and trying to find the answer. So you don't want it to read 100 documents. I'm going to feed those into this large language model and I can go to the vector database. But the hallucination is still a problem. So they added something called retrieval augmented generation. They said, you know what, you go to Chat GPT and you ask questions, well, they're keeping whatever you're putting there. We're going to give you a way for your company to store its knowledge in a protected Oracle database where nobody gets it, including Oracle, only you. And now I can use retrieval augmented generation to give a better answer and it just becomes much more accurate. And you can see it also compresses things better, but 96% accurate. And some of the other ones were only conf fourty two, fifty percent accurate. So retrieval augmented generation, I give it a question, basically in English, goes to the vector database, finds the answer, builds the sql, and then gives it back to me an answer in English. So Oracle coming soon, generative AI. But Oracle has put AI in all kinds of different products they have. And if you use something called MySQL, heatwave on things like AWS. It's also very know where do I app that? Well, maybe it's some chat bot where somebody on their phone says, hey, my power generator is not working. I don't know what the issue is, and tells you what it is. And they give you, here's the user guide right here. And it looks like you need this park. It looks like you're missing a spark plug. Where am I going to get it? Can I actually do a gps? That's spatial data, too. It's right here at this store. Or you ask a question, are there hotel stays covered in my policy? Or maybe it's just covered in the place you work. Well, it can automatically go to that document that's yours. Not putting it on the Internet, putting it only where it's secure. What comes after machine learning? And now we have large language models. Well, large language models are kind of like a foundation model that does some things for me. And this is another paper 113 offers authors, I might add, from Stanford. I would say most of this paper is very good. Some of it is a little fluffy, not as important to a tech guy like me anyway. But machine learning, most AI is powered by machine learning. Deep neural networks train on images and things like that, maybe an autonomous car, but foundation models use transfer learning. So if I had a bunch of algorithms and machine learning models I built, I now could start to get those to learn from each other and build them into one model for a given task. So somebody like Oracle, who also does healthcare now, they could start to build foundation models to do all the different tasks and also learn from each other from those different tasks. So what's coming next? Are you leveraging technology? These are some of the robots maybe we grew up with, like in Star wars, and all of a sudden they said, beware these robots like Terminator. The real robots, though, today are, I think, beyond some of the science fiction movies. They're very smart, but also they look very much like a person. Reminds me of mirror image in the twilight zone. And here's a guy who uses his robot to go give his lecture. He doesn't even do his lecture anymore. There's a guy who's a weatherman, and they bought his face to be the weatherman in many different cities. So we've seen generative AI inside of that oracle product, that low code product called Apex. But Oracle's also putting into sensors and robots inside their healthcare world. You could also use virtual assistant with robots. And here's Oracle's virtual assistant product. And you could also leverage database with virtual reality, mixed reality, augmented reality. Again, you have to look at your company. What do they need? And then they call it extended reality. If I add virtual augmented and mixed reality technologies together, just call it extended reality. If you ever hear that they're building this new unified reality, but I look at something like the metaverse and I say, are people going to get lost in there? Is it something where they can't tell? This was a Twilight zone where the guy thought his role in a movie was his actual life. He got lost in the virtual world, so to speak, and he didn't believe he was the person he was, and he started having a nervous breakdown. It's going to be this hard to distinguish which reality really matters. There's a lot of pieces to AI. The key for you is to see which pieces matter. You got to choose. Life is like a coin. You can spend it however you want, but you can only get to spend it once. You have to know where you want to spend it. It's also sentience issues. What about a robot thinks they're alive? This was the Twilight zone where the mannequin thought she was alive, but Sophia robot did an interview with her. She's a citizen of Saudi Arabia. She wants to get a degree, wants to have kids. What's alive? When is sentience really going to become an mean? We're moving from using to wearing to implanting digital in the hive mind. There's also those robots out there, but it's amazing what we can do now. Do you want to build your own past? There's a guy that does videos, and then he dials in the time portal. I forget what it's called. And the flux capacitor takes him to the right video, and he looks back and he's back in the metaverse at some event that he went to a while ago. So you just got to set the time circuits. Time circuits activated. Also, if you build this, people want magical. Don't make it manic or toxic, whatever you do. And watch out for all the security issues. You're going to see some great security talks at this conference as well. Make sure you pay attention to those. Oracle, though, has built in security for 50 years roughly, and right now they're in the latest version 23 c. They're going to have a database SQL firewall that blocks unauthorized SQL and SQL injection attacks automatically. If I look at the hype cycle, 2018, it was all about tech kind of building this digital twin or smart robot or quantum computers were also coming. Brain computer interface. This new reality started showing its face. But now it's, see, machine learning is already up the hype cycle, and down here is about 5% of the people are using it. This is ideas people are talking about. But notice what's coming in 2020. Generative AI, things like chat, GPT. Why are things going so fast? Because if I look at four bit, it's two to the fourth, two times two times two times 216 in memory that I can access. Well, I go to 16, but all of a sudden I was at 64k. Where are we jumping now? We're jumping from 32 to 60, 418 with 18 zeros, roughly exabytes, and we're about to jump to 128. Then we're going to jump to quantum computers that are going to make it even faster to do it. And these are some quantum computers to show you how much faster, Google said the program they had built 47 years, something that used to take 47 years, now takes 6 seconds, 241 times faster than just in 2019 2021 hype cycle. What's coming? Generative AI. Quantum machine learning. They're putting quantum into machine learning. But as I said earlier, we're starting to get to artificial general intelligence in some areas. A computer that is as smart as a human across the board? Well, they're smart in a lot of areas, but they're starting to get where they're even more so. And what happens when we get to artificial super intelligence and we start really finding something that is smarter than the entire world? I used to watch Star Trek, and I thought this was so advanced, it just looked so advanced. And I remember that quote, don't get too attached, Star Trek. We've done everything that Star Trek has come up with in some way. Now. We've actually not only moved to the hive mind, but with Neuralink. Elon Musk is implanting that in the brain, and they're asking for humans to do trials on this. Now. How much further? This guy, his job is, he does tattoos, but think of if he did haircuts, he'd be Edward scissorhands today already does it. So what do we look at? What's the economic potential? Huge for your company. What's the impact of robots? It's huge, but especially the ones that assist you are going to be important how hard it is to learn some of the algorithms and how to apply them to business, not very hard. What does generative AI do? Makes it a little faster yet. What started all this gen AI? Well, something called transformers at Google Brain, that guy went to a company called Cohere, which now does the geni within Oracle with their new vector database. We're moving to building foundation models for the companies we work at. And Black Mirror, I mean, you see a lot of these things already there. I put in parentheses that we already have a lot of those things that are out there. Little dystopian though. Are we moving to this where people get very angry and are frustrated with technology? Yeah. So AI should also help them and assist them. But don't forget, things may come to those who wait, but only the things left by those who hustle. Make sure you hustle to get it. I think Oracle is pretty well positioned for this just because of their database and their security and things like that. A lot of references here. Never thought I'd have black Mirror as a reference, but I do. A little bit about me. How did I get to this point? Machine learning? Well, I went back to school, started learning from MIT about machine learning. They're really quite amazing in my opinion. But if you want a copy of the notes, you could see there's my email. There's an email you can get them at. But I want to thank the people at this conference for giving me the chance to present. But most of all, really at a turning point in history. You have to decide where you want to focus your time. But machine learning and AI, it's not as difficult as it looks. The impact is impressive. So make a difference in the world. God put you here at this particular time for a reason. Think about what that reason is. I want to thank everybody for coming and have a wonderful day.", "words": [], "utterances": null, "confidence": 0.954524501179241, "audio_duration": 3226.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- How do you make a difference in the world? The answer is you leverage technology. We're going to look at some of the ways you can use not just AI, but how to also leverage things like machine learning. We'll also look at where exactly to use AI and machine learning for a given company.\n- We're moving from predictive to prescriptive right now. Oracle has a database called an autonomous database. The company's focus isn't to be a retail innovator, it's to make you the innovator. You can download this talk, but you'll have to use it in the specific parts of your business that matter.\n- What is a decision tree? A lot of different choices of data you already know about a business to make decisions quickly. It also does speech recognition, handwriting recognition, and it's built based on math that was built maybe 70 years ago. You can make a business impact if you'll make a decision to use AI.\n- Using machine learning, you can find out what attributes make a customer a good customer or a bad customer. What about SQL analytics? Can you look at different views, whether it's regional managers or financial managers? Pretty much anything you could ever think you want to do, it's out there somewhere.\n- Oracle has a product called Apex, comes free with the database. They want generative AI to do this for them. Chat GPT is actually 3.5, came out last year. AI is going to be big because it's going to get us to general intelligence.\n- Oracle is using a product called Cohere to do the large language model, but they're also building and now have a vector database. They added something called retrieval augmented generation to give a better answer and it just becomes much more accurate.\n- Most AI is powered by machine learning. You could also use virtual assistant with robots. And you could also leverage database with virtual reality, mixed reality, augmented reality. The key for you is to see which pieces matter.\n- What does generative AI do? Makes it a little faster yet. What started all this gen AI? Well, something called transformers at Google Brain. But don't forget, things may come to those who wait, but only the things left by those who hustle.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.06, "text": "different things", "timestamps": [{"start": 1198212, "end": 1198734}]}, {"count": 1, "rank": 0.06, "text": "machine learning models", "timestamps": [{"start": 2671772, "end": 2672866}]}, {"count": 1, "rank": 0.06, "text": "AI machine learning specialist", "timestamps": [{"start": 1748756, "end": 1750346}]}, {"count": 32, "rank": 0.05, "text": "machine learning", "timestamps": [{"start": 125032, "end": 125650}, {"start": 135088, "end": 135690}, {"start": 147650, "end": 148880}, {"start": 176284, "end": 177320}, {"start": 258280, "end": 259090}, {"start": 461272, "end": 461842}, {"start": 473468, "end": 474070}, {"start": 484182, "end": 485050}, {"start": 569788, "end": 570710}, {"start": 609576, "end": 610162}, {"start": 658312, "end": 658930}, {"start": 679548, "end": 680520}, {"start": 760072, "end": 760818}, {"start": 973148, "end": 973782}, {"start": 991232, "end": 991802}, {"start": 1206712, "end": 1207362}, {"start": 1376892, "end": 1377638}, {"start": 1627872, "end": 1628538}, {"start": 1673458, "end": 1674534}, {"start": 1700074, "end": 1700750}, {"start": 1706894, "end": 1707522}, {"start": 1749162, "end": 1749790}, {"start": 2631680, "end": 2632506}, {"start": 2655432, "end": 2656082}, {"start": 2657832, "end": 2658820}, {"start": 2671772, "end": 2672390}, {"start": 2942416, "end": 2943178}, {"start": 3012302, "end": 3013202}, {"start": 3014776, "end": 3015874}, {"start": 3173532, "end": 3174262}, {"start": 3179052, "end": 3179574}, {"start": 3207832, "end": 3208530}]}, {"count": 3, "rank": 0.05, "text": "other things", "timestamps": [{"start": 1484992, "end": 1485482}, {"start": 2048788, "end": 2049166}, {"start": 2467672, "end": 2468290}]}, {"count": 3, "rank": 0.05, "text": "auto machine learning", "timestamps": [{"start": 1673036, "end": 1674534}, {"start": 1699796, "end": 1700750}, {"start": 1706632, "end": 1707522}]}, {"count": 2, "rank": 0.05, "text": "different products", "timestamps": [{"start": 1901010, "end": 1901742}, {"start": 2577468, "end": 2578022}]}, {"count": 1, "rank": 0.05, "text": "different customers", "timestamps": [{"start": 1718152, "end": 1718914}]}, {"count": 1, "rank": 0.05, "text": "different people", "timestamps": [{"start": 856372, "end": 857042}]}, {"count": 1, "rank": 0.05, "text": "machine learning algorithms", "timestamps": [{"start": 147650, "end": 150430}]}, {"count": 1, "rank": 0.05, "text": "Quantum machine learning", "timestamps": [{"start": 3011790, "end": 3013202}]}, {"count": 1, "rank": 0.05, "text": "different business groups", "timestamps": [{"start": 1716632, "end": 1717854}]}, {"count": 1, "rank": 0.05, "text": "physical things", "timestamps": [{"start": 373836, "end": 374582}]}, {"count": 6, "rank": 0.05, "text": "large language models", "timestamps": [{"start": 161496, "end": 163182}, {"start": 269836, "end": 270914}, {"start": 2050164, "end": 2051710}, {"start": 2177372, "end": 2178418}, {"start": 2633328, "end": 2634406}, {"start": 2634864, "end": 2635958}]}, {"count": 1, "rank": 0.05, "text": "vector data", "timestamps": [{"start": 2448506, "end": 2449694}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}