{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/a0fa6a8a-513a-4e17-8f83-a559ae8a2359", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["build", "business", "case", "cases", "conf fourty two", "context", "cpo", "denis skokov", "genai", "generative ai startup", "handson", "impactful", "implementing", "llms", "models", "poc", "proprietary", "results", "unlock", "vs"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "c78b5a73-c651-416a-bf2e-37f8a67f8954", "status": "completed", "error": null, "text": "Welcome everybody to the talk about implementing of GnEi in banking context. I will be speaking from practical and business perspective because currently I am chief product officer of the company which created geneae solution for the bank. We actually had a lot of communication with the banks around leveraging AI in banking environment. Firstly, we'll discuss about context and use case overall. Then we'll go into short description of the product. Then we'll have a deeper dive of technical aspects of product, how was it created? And then we'll discuss the frequent concerns of the banks of launch product within the banking environment. And in the end, we'll speak about the team which is required to create such kind of solution. So let's start. If we are talking about potential market of software for the banks, it is really huge. It is more than $4 billion. It is just a service addressable market, but actually it is much larger. We believe that this market is growing. At this market, we focus on actually two solutions. Our company focuses on two problems. The first problem is that when you try to open account in a bank for your business, this takes a lot of time. Like according to our survey, it is seven days and more than 400 pounds per one customer. Also, we know that there is a huge problem with transaction monitoring and why so. And according to our research, if we look at the onboarding process of business customers for the bank, you can see that some parts of this process is very much automated. It is like verification in registers, identity verifications, et cetera, et cetera. But there is a part which I colored green, which is very difficult to automate. And this part is related to two things. The first thing is back and forth clarification. For example, you ask customer to provide a contract. Customer provided to you. Your manager read the contract and realized that the contract is expired and you need the fresh one. And you write a message, could you please provide the new contract? And this usually takes two days. It is a significant amount of time. And secondly, actually reading of the loan documents take a lot of time. Sometimes contracts provided to the banks could be 50 pages, 100 pages. And you can imagine how much time managers spend on reading such documents. And our product actually resolves this issue and it is not covered by the current players yet. And what we are doing, we launched a system which is talking to customer in chat. It is AI powered chatbot. It collects documents, it extracts data from documents, does all the checks which are required and prepare compliance report. And this compliance report looks like this. You can see that in this report we provide all the discrepancies found in the documents, all the issues, all communications from customer around it. And in the end compliance officer, the person who is making decision about open account just read our report and take decision to open account or do not open account. And it takes for them just like ten minutes but not seven days as it was previously. So this is our use case, this is the product we are offering for the banks and this product, the benefits for the banks is of course cost reduction on burden speeds. Customers are happy and actually many others. And this product is like I will speak a bit more about how was it built from maybe technical perspective if we try to create such product just based on LLM. As you know, LLM will not have a structured discussion on some topic. Even if we make very good prompts, very good structure, the stability and ability to control what is going on will be very low. That's why we decided that we should have a hard coded dialogue scenario. So we should ensure that system will ask customer for example for registration documents for the company contracts, invoices and if customer has some questions or would like to discuss anything around these documents, we'll support it. But it will be very well guided dialogue. And you can see that we have splitted this flow into the small steps. Like for example we tell the task to LLM customers asking us to provide some information about requirements for the invoice and LLM just answer to this particular small question and this is small task we are given to LLM. We are not trying to ask you to collect all the data and secondly we use separate OCR service like the quality is higher and we do not use even llms for this. And we see that stability is very good with it. Thirdly, we do extraction and also it is a separate task to the model using OCR we converted images to text and now we use LLM to extract from this text structured data. We need to make documents analysis and finally we decided that it should be not only LLM and OCR but also we would like to use APIs to enrich additional data for this particular case. So we have integration with registers. For example, we are taking data from there, comparing this within data we extracted from the documents and as the result received very well structured reports. If we're talking about integration perspective here, it is actually a very important concern of the customer. Like when it is a bank, they have very very complicated architecture and with a long history and it is very difficult and takes a lot of time to to integrate seamlessly in this kind of architecture. That's why for the proof of concept. To make this much faster, we created kind of fast integration approach. It looks like this. For example, bank would like to open a business account for the customer and customer usually fulfill forms on the website of this bank and they authorized and we have this and we do not integrate into. We do not integrate API using API here. We just do an iframe integration. So we find some screen and put it there and it is very fast. Second approach is that our service which is actually creating all of this, which is in the cloud. After user talks to potential customer of the bank in iframe chat, which is actually our chat, we created report and we send this report through email. Very straightforward. We can do it of course through API. But as I mentioned that for the banks it can take a lot of time. Rolling out such kind of fast API takes one week and it is much more interesting for the banks to try our product. Moving on, I mentioned that we used to face different concerns to llms and overall usage of GPT in the bank environment. And the first concern is for example that most of people believe that OpenAI use client's data to develop new models. And we prepared special documents which confirmed that corporate API that OpenAI declares that they do not use any client's data in corporate API and is protected by agreements and is protected by all necessary policies. And we show this to the customer and usually this helps. Secondly, many people still believe that chat boxes are not reliable. For example, I have heard such concern. Yes, I like your solution is great, but we like this part when you are checking the documents, making compliance checks. But this chat is like. I personally don't like chats. Chatbots, can you please implement this kind of dynamic form where a customer can fulfill some information and get the response, but not in chat. Also very very interesting concern because people still see that chatbots are not reliable. And this is true actually. And what we can do here, as I mentioned that firstly we made our chart very structured. Also we limited answers to internal database. So if our chatbot answering to customer, it is not using any information from the Internet, it uses information from the data source which is checked and we are sure that there will be no hallucinations around it. Also we are adding where it is possible, we are adding some hard coded logic and quick buttons which can skip chat communication where it is not necessary. So I would not say that we have kind of clear chat. It is mix of chat and hard coded logic. And this helps with banks when we are trying to convince them that this product is good enough. Number three is the quality. Of course, from the beginning people remember that if we are talking about machine learning, when you need to read, when you need to read any new document with a high quality, you need to train model on thousands and thousands samples of such documents. And they do not understand that situation has been changed. And actually you do not need so huge train data to to have a good quality. And we actually support our sales materials with the results of the testing and we suggest them to try their own documents. And after they are trying this, usually this helps. And number four, I also already mentioned it, but maybe elaborate a bit more. That of course banks afraid of hard integration and for proof of concept they would like something small what they can try. And we created this kind of quick integration scheme. And also secondly, we started integrations with the large CRM and compliance case management systems like for example Salesforce and banks which are using Salesforce. When they think about integration and when they understand that this one will be that our product will be part of the Salesforce flow, it is much easier for them to take this decision to get our solution. And now let's move to the team. Of course it could be different team working on such projects, but I would like to mention a few mission critical roles. I think they are necessary for the success of such product. Of course data scientists and when we're talking about generative AI, the role of data scientists have changed. It is already more prompt engineering, already more about data extraction from the text and it shifted. But what is important data scientists from the knowledge perspective, they can structure working on the quality and I think this is critical. They can create a great data set, they can ensure the quality of the data set, they can ensure that the labeling process is set up properly and you can test it properly. This role shifted, but it's still the core in this process. Second role, this is actually the new role and I have not heard about this role before this project, but I think it is kind of role just appeared the previous year. QA engineer with prompt engineering experience. It's a really interesting mix. The people who can test quality of responses of llms on the high volumes, so they can use, they are very experienced in prompt engineering. They have all the tools which are required and they can write actually these tools for automation of such QA. This is new role really helping a lot to our product to ensure quality of chat. Duck and number three, of course, back end developer who actually currently can do prompt engineering as well, integration with different models, but important that this role should be combined with DevOps or it should be a separate person develops on the team. Because if you need high quality environment for the banks, your infrastructure should be really great and I would personally recommend to have this role in your team. So to wrap up about my talk, it is a huge use case for ginia in the banks and it is a great potential of implementation. The main pain for the banks actually working with a large volume of different documents and different processes. It's not only compliance process, could be lending process, credit process and due diligence legal process. So there are a lot of them. Our company created chatbot which collects and verifies documents for the banks and we have experience in implementing it. Most of the banks do not fully understand the opportunities and we see that banks actually risk averse organizations and we hear a lot of concerns and you should be prepared to argue and to provide support that the risks are not so high. And as a hint to overcome the concerns that prepare maybe responses to frequently asked questions. And second one to have instant proof of concept so you can prove that your solution works. Well, that's it from my side. Thank you very much and have a nice day. Goodbye.", "words": [], "utterances": null, "confidence": 0.916487755668671, "audio_duration": 1115.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Welcome everybody to the talk about implementing of GnEi in banking context. I will be speaking from practical and business perspective because I am chief product officer of the company which created geneae solution for the bank. And in the end, we'll speak about the team which is required to create such kind of solution.\n- The potential market of software for the banks is more than $4 billion. We launched a system which is talking to customer in chat. It is AI powered chatbot. It collects documents, it extracts data from documents, does all the checks which are required and prepare compliance report. Benefits for banks is of course cost reduction on burden speeds.\n- Most people believe that OpenAI use client's data to develop new models. Many people still believe that chat boxes are not reliable. It is mix of chat and hard coded logic. We started integrations with the large CRM and compliance case management systems.\n- A few mission critical roles are necessary for the success of such product. Data scientists, QA engineer with prompt engineering experience and back end developer. If you need high quality environment for the banks, your infrastructure should be really great.\n- It is a huge use case for ginia in the banks and it is a great potential of implementation. The main pain for the banks is working with a large volume of different documents and different processes. Most of the banks do not fully understand the opportunities.", "auto_highlights_result": {"status": "success", "results": [{"count": 8, "rank": 0.07, "text": "bank", "timestamps": [{"start": 34602, "end": 35174}, {"start": 117140, "end": 117684}, {"start": 144512, "end": 145040}, {"start": 482868, "end": 483068}, {"start": 512820, "end": 513524}, {"start": 523724, "end": 523948}, {"start": 561122, "end": 561694}, {"start": 607112, "end": 607376}]}, {"count": 1, "rank": 0.06, "text": "different documents", "timestamps": [{"start": 1046972, "end": 1047852}]}, {"count": 14, "rank": 0.06, "text": "product", "timestamps": [{"start": 30474, "end": 30746}, {"start": 55194, "end": 55814}, {"start": 59424, "end": 60004}, {"start": 70632, "end": 71056}, {"start": 211858, "end": 212194}, {"start": 284452, "end": 284932}, {"start": 290324, "end": 290764}, {"start": 301476, "end": 301900}, {"start": 313348, "end": 313660}, {"start": 592736, "end": 593324}, {"start": 759112, "end": 759424}, {"start": 863844, "end": 864092}, {"start": 888314, "end": 888586}, {"start": 992546, "end": 992850}]}, {"count": 1, "rank": 0.06, "text": "LLM customers", "timestamps": [{"start": 382054, "end": 384126}]}, {"count": 4, "rank": 0.06, "text": "concern", "timestamps": [{"start": 480324, "end": 480612}, {"start": 609664, "end": 609960}, {"start": 665216, "end": 665712}, {"start": 694924, "end": 695268}]}, {"count": 1, "rank": 0.06, "text": "business customers", "timestamps": [{"start": 143232, "end": 144144}]}, {"count": 8, "rank": 0.06, "text": "kind", "timestamps": [{"start": 78064, "end": 78216}, {"start": 500372, "end": 500540}, {"start": 507692, "end": 507860}, {"start": 581176, "end": 581360}, {"start": 683744, "end": 683920}, {"start": 748232, "end": 748440}, {"start": 837002, "end": 837210}, {"start": 952010, "end": 952274}]}, {"count": 1, "rank": 0.06, "text": "special documents", "timestamps": [{"start": 625616, "end": 627304}]}, {"count": 1, "rank": 0.06, "text": "compliance process", "timestamps": [{"start": 1049836, "end": 1050804}]}, {"count": 1, "rank": 0.06, "text": "potential customer", "timestamps": [{"start": 559554, "end": 560746}]}, {"count": 1, "rank": 0.06, "text": "documents analysis", "timestamps": [{"start": 437124, "end": 438704}]}, {"count": 1, "rank": 0.06, "text": "registration documents", "timestamps": [{"start": 350334, "end": 351534}]}, {"count": 1, "rank": 0.05, "text": "different processes", "timestamps": [{"start": 1048100, "end": 1049108}]}, {"count": 3, "rank": 0.05, "text": "data scientists", "timestamps": [{"start": 889330, "end": 890494}, {"start": 896258, "end": 897010}, {"start": 911076, "end": 912052}]}, {"count": 1, "rank": 0.05, "text": "important data scientists", "timestamps": [{"start": 910644, "end": 912052}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}