{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/a671deca-8069-46c1-aca1-3b6dc93f9871", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["break", "can", "carbon", "conffourtytwo", "consumption", "directorschoolofcomputerscienceit", "dranubhajain", "emissions", "firms", "iisuniversity", "iot", "iots", "practices", "safer", "smarter", "sustainability", "technologists", "terms", "towards", "transforming"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "12f4ff39-9758-424b-9085-87ce5caa3502", "status": "completed", "error": null, "text": "Are living in can era of technological marvels wherein new industrial revolution is triggered by new advances in science and technology. We talk about different technologies like artificial intelligence, machine learning, nanotechnology, cloud and virtualization, et cetera. But while developing any new product we tend to forget the amount of energy it is producing as well as the amount of energy it is consuming. This is harming our environment gradually. Have you ever thought how new products that are being developed impact the environment? Hello, I'm Dr. Anubha Jain. I come from Pink City of India, Jaipur. I am working as a director of School of Computer Science and it at is deemed to be university Jaipur. In my talk I'll be talking about the role of technology in developing sustainable environment for us and our coming generations to lead a safe as well as a smart life. I start with this funny video of Charlie Chaplin wherein there is a mechanical device feeding charlie. This was a technological marvel of its time, but science and technology has come a long way since then. We are heading towards a world of communication and connectivity as well predicted by a futurist. Everything will be connected to everything. We are witnessing a world wherein devices are talking to other devices. Individuals are connected and communicating to devices at higher scales which were unknown previously. And central to this concept of communication is connectivity. Things around us are connected together in a mesh of smart devices which communicate with each other over the Internet seamlessly, thus forming Internet of things. This is transforming the way we live and we work. And as we can see from this graph generated by Statista, the number of IoT connected devices worldwide has been increasing. In fact, from 2020 to 2030 it is expected that these devices will triple down from 9.7 billion to 29.4 billion devices. And most of this share of devices are from consumer segment like smartphones and your autonomous vehicles, it infrastructures, asset tracking, monitoring and asset growth. In fact, National Intelligence Council of us has identified six civil disruptive technologies that are going to rule the world and Internet of Things is assumed to be one of them. By 2025, IoT will be residing in each and every device that you use, maybe food, package, furniture, paper, document or anything else. Now, what is fueling this IoT revolution? As we all know, the electronics are getting more compact yet more powerful and widely available. At the same time, the backbone of your Internet is getting stronger. The Internet infrastructure has advanced from three g to five g. Thus the protocol has also improved and the adoption of IPV six has increased the number of available unique identifiers that we have. So each device may get a unique address and still addresses may remain vacant. So there will be a time where more connective devices than people will be available to us. Now. The enabling technologists for IoTs, RFID sensors in actuators, smart technologies technologists for tracking the data as well as processing and drawing decisions from this data. Along with societal and technological challenges, there are environmental challenges being faced by IoT. So the growth of IoT does not come for free. It has a major impact on environment. Let's look at IoT how as the number of connected devices are increasing, the energy being consumed by these devices is again increasing and the usage of batteries is increasing. Also, electronic appliances production has raised as we need more devices to safer to people. All this have resulted in increased e waste and landfills plus greenhouse gas emission. This all has led to something called global warming. Thus the concern of environment and sustainability is at break in case of IoT. Thus, the solution for all this is should we do away with technology? No, we should use technology for a better tomorrow. In order to build a safe smart world, which is sustainability, it is of utmost importance that we go green. Thus we have to become green in using these connected IoT devices also. So the green IoT is a scenario where we optimize Internet usage to save energy by judiciously using available resources, by using renewable sources of energy and building energy efficient procedures. Now this greening in IoT can be done by greening can IoT or greening by IoT. While greening of IoT focuses on manufacturing energy efficient IoT hardware as well as building greener software. While greening by IoT involves IoT as an enabler to create a sustainable environment. So let's look at it into detail that how greening of IoT and greening by IoT can build sustainability solutions. Now, first we look at IoT as a game changer. IoT has just transforming the entire world by making all the devices smart, maybe in the sphere of industrial automation, homes, transport, healthcare, agriculture or any other industry. So let's look at some important use cases where IoT has been used to build sustainable solutions. So the first and foremost use case that we see is the safer management that we can do at different levels. Maybe household offices at sea level or wastewater management. Smart utility meters can be applied for real time power usage monitoring that collect, store and send data to smartphones to manage energy and water consumption at households and at office and industry level. At sea level, aquaculture can be done wherein IoT systems track animal health and environmental factors that impact them to adjust the conditions for happier and healthier fish. It will help in decreasing time to market as well as reduce the waste by doing predictive analysis that will help farmers for faster harvest and looking upon what and how much fish will eat based on different temperature levels, health timing, et cetera. Also, it will comply with environmental and food safety regulations. The next important use case is smart homes or smarter offices wherein smart lighting, demand driven heating and cooling for improved comfort in homes as well as offices can help in saving energy consumption as well as energy start certified thermostats can be used which can learn what temperature users prefer to build a schedule around that setting to make buildings more sustainable. During pandemic, the overall energy consumption of New York City reduced approximately by 15% by using this smart lighting technique. Then IoT plays a pivotal role in smart healthcare by building smart telemedicine services and predictive health care monitoring for betterment of society. It was seen during pandemic that senior citizens started using more of telemedicine services and IoT devices helped along with big data and analytics for quicker diagnosis of health issues and also decrease the expenses of hospitals in terms of system cost and for patients in terms of actual visit to hospital. Smart city is another example of IoT making the life sustainable by smart parking, structural health, noise, urban maps, smart detection, traffic congestion management, safer management, etc. IoT can also help in maintaining biodiversity of wildlife as well as marine organisms by making use of technologies like drone technology, acoustic monitoring. In fact, the connected collars which have been used by smart breeding management systems allow farmers to increase production while minimizing cost and the use of resources. It allows the breeder to get information about animals conditions and behavior of their body temperature, ovulation, gestation period, et cetera, which can be helped to maintain better health of animals and they can locate their livestocks using connected sensors. Another use case is in smarter waste management which can help in optimized routing of the garbage and cleaning of garbage can and properly dumping of them at the manufacturing plant using IoT devices. Then we have something known as Internet of energy. IoT can be employed for improving energy efficiency, increasing the share of renewable energy and reducing environmental impacts of energy. Using IoT devices the energy industry is creating something known as Internet of energy to manage energy generation and different energy resources. Big data analytics provide grid operators energy producers with real time energy consumption trends, allowing them to forecast where and when energy demand of energy consumption will peak. Direct adjustments in the energy supply can be done as needed. These are the allied technologies which can be used with IoT for making the world greener. These technologies, along with mathematical algorithms are making IoT more intuitive and user friendly. Energy and facility management software based on AI are being devised as part of green IoT movement and it is adopting nanotechnology to design smaller nanoscale devices for improved functionality, energy efficiency and accuracy while reducing the size. This is the green IoT lifecycle. So for any IoT product to become green, it must go through a closed process, including green design to green production to green deployment as well as disposal of the product should be in a greener way such that it can be recycled. Green design involves designing cooling equipment, servers, computers and energy efficient components. So the sustainability design is the first initiating point where in greenness should enter in the lifecycle. It will be carried forward in different phases of the lifecycle in producing computers, electronic components and other associated subsystems and it will be monitored to keep these electronic items power usage to a minimum and developing recyclable electronic equipments so that whenever they are no longer in use, they can be recycled accordingly. Then we look at green in IoT. So how IoT procedures can be made green. They can be made green by developing hardware efficient devices. Efficient software coding can be done. They can be habitual based, awareness based, policy based as well as recycling based. So building hardware which is efficient the design of integrated circuits is crucial for energy conservation. Green IoT enhances IoT network architecture by integrating sensors and processing powers on a single chip to minimize total infrastructure energy consumption. Also, the processors based with energy efficiency can be split into two cores, low computing task and high computing task and then scheduling framework can be used to assign tasks to reduce energy consumption. In case of software, the software should be built in such a way they are energy efficient, carbon efficient as well as they are energy efficient carbon efficient and they should be able to work to optimize the hardware. We should build our habits in such a way that we all start thinking of saving energy in our day to day lives. Building such habits will build a very small effect in saving upon energy, but when looked upon IoT worldwide, it is definitely going to make an impact and we should also work on creating awareness about how we can go green, how we can save energy by building campaigns or maybe by giving notification and alerts through phones, through software applications so that people get a checkpoint on how they are saving upon energy. And industry is still building green policies in order to build standards which are sustainable for companies to practice. Now, the enabling technologies that we saw earlier in case of Internet of things like RFID, wireless, sensor networks, et cetera, they also need to go green by making use of recyclable material and smart algorithms in order to become more sustainable. So the RFID, WSN or M two M, they all need to become more sustainable by making use of more and more smarter algorithms, energy harvesting mechanisms and different scheduling practices. Even the data centers and the cloud computing should become greener by making use of virtualization techniques and nanodata centers that are more energy efficient than conventional data centers. Now we were talking about greenness and software. So we should build applications that are hardware efficient, carbon efficient, energy efficient, which should at the same time spread carbon awareness and optimize each step of software development lifecycle. This can be done using green coding, low code development and automated software quality monitoring. All these depend upon the factors like choice of language design, encoding options, AIO models and different software development techniques. As they all contribute to developing greener software. The choice of language again plays a very crucial role. Whenever we use software, we think that software do not contribute to carbon emission, but they do. They do not do it directly, but as they control the operations of the hard way. Thus, they are indirectly contributing in carbon emission. And in fact, a research was done on different 27 different programming languages and it was study how much electricity they consumed for ten different problems. So a software was built for solving ten different problems using 27 languages and it was studied how many much electricity was consumed and the speed and memory usage of each language. And it was found out that still c comes out as one of the best language in terms of energy efficiency. AI models also contribute in carbon emission as they are creating and sharing reproducible code. And it is also helping in developing generative AI models which can be converted together, integrated together to build greener coding solutions. Now, in order to get a reliable software, it is mass that that software is well tested, but in the lens of carbon emission, the test cases that we execute, they also emit carbon in the environment for each of the test case being executed, as it requires cpus to be working at extra times in order to run the test cases and generate reports. So we need to build a clean testing environment in order to save our environment. Maybe we can use cloud virtualization techniques for greener testing process. We can build smart test selection processes. Also, we should shift early the testing process so that in order we get the bugs early, it will reduce the cost of running the test cases. Companies are now building their own green business model where there is a transformative shift upon circular economy as compared to the linear economy which was followed earlier and asset upcycling. They are also making use of AI and ML driven energy analysis to build faster applications which are more sustainable and which can draw decisions in keeping energy efficiency in mind. Now let's look at the principles that should be followed in order to build greener solutions and become more and ecologically friendly. Turn off facilities that are IoT needed so sleep scheduling can be employed in order to make the sensors go off to sleep when not needed. There are two types of sensors, active sensors and passive sensors. So these sensors can be activated or they can be put on to sleep accordingly. Send data that is needed predictive data delivery definitely helps in predicting which data is required, and faster data delivery can be achieved without consuming more energy. And IoT also helps in minimizing the length of data path by employing different smarter routing schemes. There should be a trade off between processing for communication. We should start using more greener communication technologies and machine to machine communications. We should bank upon more renewable green power sources like solar energy, wind, thermal, et cetera, as well as we should raise awareness on lowering our energy usage by putting checkpoints, notifications, smart metering on the devices that we are using. So now let's look at what is the future of IoT. As we can see, in future, IoT will be integrating with artificial intelligence to build more intuitive and more smarter solutions. In fact, IoT devices can be thought of as digital nervous system, while AI IoT applications function as the brain of a system. AI has ingrained into our daily lives nowadays and even very small devices like glasses are now having artificial intelligence to build smarter vision into this. Other future applications are green social network as a service unmanned aerial vehicles, which can be used for machine to machine communications in drones, which can help in energy efficient solutions by having lower flight time, gathering data by lesser delay. Other applications are green connectivity data and context aware applications as well as nanodevices. Green social network as a service can enhance the system's energy efficiency, service provisioning sensor networks, and cloud based wireless sensor network management. Now, these are the few points which we can delve for future research for making IoT more greener, more sustainability by building energy harvesting techniques and low power chipsets. More radio optimization techniques such as modulation, optimization or cooperative communication can be applied to reduce the power consumption of the nodes. Energy efficiency routing techniques like cluster architectures or multipath routing can provide efficient solutions. Leading opinion makers think that the future pattern of development will be largely influenced by renewable sources of energy. Some attach topmost priority to knowledge as a source and innovation as a force. With this, we come to an end of my presentation, which I usually end by saying this quotation that we should go green. As there is no planet b, we all should put in our own bit, which will definitely be small, but when looked at a larger scale, cumulatively, we all can definitely make an impact by cautiously checking our everyday practices, our everyday digital transactions, which all are emitting some amount of carbon and depleting our layer of Earth. So let's all join hands in order to make this planet greener and safer for our future generations to come. Thank you. I'm available for any questions. Thank you for the patient listening.", "words": [], "utterances": null, "confidence": 0.932719925549916, "audio_duration": 1664.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- While developing any new product we tend to forget the amount of energy it is producing. This is harming our environment gradually. In my talk I'll be talking about the role of technology in developing sustainable environment.\n- From 2020 to 2030 it is expected that these devices will triple down from 9.7 billion to 29.4 billion devices. By 2025, IoT will be residing in each and every device that you use. In order to build a safe smart world, which is sustainability, it is of utmost importance that we go green.\n- We should build applications that are hardware efficient, carbon efficient, energy efficient. This can be done using green coding, low code development and automated software quality monitoring. All these depend upon the factors like choice of language design, encoding options, AIO models and different software development techniques.\n- In future, IoT will be integrating with artificial intelligence to build more intuitive and more smarter solutions. Leading opinion makers think that the future pattern of development will be largely influenced by renewable sources of energy. These are the few points which we can delve for future research for making IoT more greener.\n- With this, we come to an end of my presentation, which I usually end by saying this quotation that we should go green. As there is no planet b, we all should put in our own bit, which will definitely be small. Let's all join hands to make this planet greener and safer for our future generations to come.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.08, "text": "energy efficient solutions", "timestamps": [{"start": 1508580, "end": 1511722}]}, {"count": 6, "rank": 0.08, "text": "energy consumption", "timestamps": [{"start": 579356, "end": 580870}, {"start": 598566, "end": 599526}, {"start": 775064, "end": 776082}, {"start": 781452, "end": 782402}, {"start": 943206, "end": 944678}, {"start": 959930, "end": 961470}]}, {"count": 2, "rank": 0.08, "text": "more energy", "timestamps": [{"start": 1102612, "end": 1103390}, {"start": 1402154, "end": 1403200}]}, {"count": 7, "rank": 0.08, "text": "energy efficiency", "timestamps": [{"start": 747750, "end": 749142}, {"start": 821854, "end": 822942}, {"start": 947696, "end": 949078}, {"start": 1216856, "end": 1218450}, {"start": 1345606, "end": 1346886}, {"start": 1531602, "end": 1533106}, {"start": 1571406, "end": 1572590}]}, {"count": 1, "rank": 0.08, "text": "energy efficient components", "timestamps": [{"start": 854416, "end": 856690}]}, {"count": 1, "rank": 0.08, "text": "different energy resources", "timestamps": [{"start": 766168, "end": 768130}]}, {"count": 1, "rank": 0.07, "text": "renewable energy", "timestamps": [{"start": 750852, "end": 751982}]}, {"count": 1, "rank": 0.07, "text": "energy generation", "timestamps": [{"start": 764344, "end": 765454}]}, {"count": 1, "rank": 0.07, "text": "energy harvesting techniques", "timestamps": [{"start": 1555012, "end": 1557258}]}, {"count": 1, "rank": 0.07, "text": "energy demand", "timestamps": [{"start": 780476, "end": 781154}]}, {"count": 1, "rank": 0.07, "text": "manufacturing energy efficient IoT hardware", "timestamps": [{"start": 429756, "end": 433410}]}, {"count": 1, "rank": 0.07, "text": "energy start", "timestamps": [{"start": 582748, "end": 583750}]}, {"count": 1, "rank": 0.07, "text": "energy conservation", "timestamps": [{"start": 929436, "end": 930870}]}, {"count": 1, "rank": 0.07, "text": "real time energy consumption trends", "timestamps": [{"start": 774184, "end": 776978}]}, {"count": 1, "rank": 0.07, "text": "total infrastructure energy consumption", "timestamps": [{"start": 941590, "end": 944678}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}