{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/63dd7386-0462-42a9-a682-bba7637c5c46", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["advances", "but", "can", "change", "clear", "cold", "comeback", "conf fourty two", "data scientist", "globant", "jesus saldana gonzalez", "machine learning out of job", "thats", "uncertain"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "6d8af79b-4254-4a1d-8d39-bf9fbb30aaaf", "status": "completed", "error": null, "text": "Hi everybody. My name is Jesus and I'm currently working at Globant. We're a digitally native company thats helps organizations revenge themselves and unleash their potential. We are the place where innovation, design and engineering means scale. Right now I work in the data and AE studio to develop incredible stuff with data and mature learning. But I'm talking too much about myself. Let's talk. But a much more interesting topic. Artificial intelligence. Artificial intelligence is all the rage. That's a fact. And sure, this concept may sometimes be hijacked by marketing teams to give a modern look to a product. However, the reality is that we are living a revolution in terms of this technology. And it is not by chance that I use the word revolution, because in general, we are talking about a new industrial revolution. But what does it mean? An industrial revolution is defined as a process of profound economic, social, cultural and technological transformations. To better understand this concept, we can go back to the first industrial revolution. This revolution was caused by several reasons. The growth of population due to a long period of peace and improved farming techniques. New technologies such as the steam engine that allowed mechanization, dispensation of the international market with the appearance of the steamship, and finally the emergence of workshop and factories where people began to work much more productively. But perhaps this all seems too far away, right? After all, the stimages engine was invented in the late seventy? S sixty s. But let's slow down. Don't all these points unfamiliar to you? For example, thanks to industrialization, the world's population grew from 1 billion to 2 billion people between the centuries. Today we are almost 8 billion people in the world. If that's not growing, just let me know. Also, I guess that you have heard that the smartphone in your pocket is much more powerful than all the technology in the NASA when the man landed on the moon. Right? Now imagine applying machine learning to all this technology. Incredible. And who has never ordered something through Amazon or even an express? It just works. No need to explain it. Finally, the way we work is also changing. I don't even have to see my colleges anymore and we can keep building amazing things together. However, I miss coffee breaks and after works, don't you? After all this, it is clear that we're immersed in a new industrial revolution driven by artificial intelligence. The development of new and powerful machine learning algorithms, especially these learning ones, has helped this technology to become part of society. And we didn't realize chatbots or recommendation systems are just a few examples of how machine learning is becoming an everyday thing. But why is this happening if you stop a moment and think about it. Worker productivity has increased incredible thanks to technological advances and specialization. But even today, we still perform repetitive, mechanical and tedious tasks. In that sense, machine learning offers a new level of depth. Thanks to machine learning, machines can perform those repetitive jobs for us quickly, efficiently, and tastily, far increasing productivity. But what is our role in all of this? Because it's clear that people get stopped to insert inside those tasks, leaving this space to computers. But this does not mean that jobs will be destroyed. Instead, they will be displaced. We won't be replaced by a machine. We will just leave that position to start performing new tasks that best match our skills. Sound interesting, right? So let's see what those skills are. And when algorithm will we never be able to replace us first? Curiosity. We are naturally curious. Children learn to ask questions without anyone teaching them. A machine learning algorithm, on the other hand, only knows how to do one thing, maybe a handful of them, and it does it very well, better than anyone else. But it is not capable of performing any other task efficiently. And that is why we are so important. Machines are great at giving answers, but it is us, the people, who will ask them the right questions. Creativity is also a very human skill, because human needs to communicate and express what we think and feel. Also, we're able to ask questions and use the tools that we have to solve those problems. Machine learning is just one more tool, and it can be the solution to a very specific problem. But not all of them. We choose how and when to use it. Finally, humans are curious and creative because inside us there are feelings that move us to investigate and express ourselves. And those feelings can only be understood by another human. Perhaps a computer vision application may be able to distinguish what emotion you are feeling through your facial expression, right? But no matter how sophisticated the system is, every time you call to your bank to make a transaction or to the hospital to make an appointment, you expect to hear that person's voice on the other end. And if not, you will say, whoa, that's a robot again. And you're not alone. It happens to everyone. Only people understand other people and are able to communicate trust. Lisa Messenger, CEO of Collective Hub, once said that everything in business comes down to humanizing things. And she's right. The world is for people, and only we can adapt it to our desires. Maybe a machine learning algorithm will be able to detect a need, but only a person will know how to satisfy it. For these reasons, it's a good idea to let the machines do 13 tasks. Because while the tickets or the boring part, which they do so well. We can use our time and effort for those skills that make us unique and. Okay, thats sounds good, right? But it's still a long way off, isn't it? Sorry, but let me tell you that. Not so much. Today we have very sophisticated machine learning tools capable of doing incredible things. Let me present you a couple of them. Let's start with code generators. If you're watching this talk, you've probably heard of GitHub copilot. If not, stay tuned because you're going to love it. GitHub Copilot is a tool capable of generating code for an input. Still not clear. Imagine implementing a method or a data structure through a simple comment in your code. Just write how you want it to work and that's it. It's a bit dicing, right? It almost seems that it could replace a programmer. But don't start looking for another job yet. A code generator is just a tool and needs a programming to work. It's like a hammer needs an arm to hit. Can you remember that only one person understand another? Imagine that customer who doesn't even know what he wants trying to explain it to a computer. Impossible. Programmers. Our job is safe from this point of view. The birth of these kind of tools is amazing for us. As long as we master them, we will save an incredible amount of time. We will be able to implement complex applications in a much more agile way. And not only that, people with little experience will be able to approach more easily and study more complex concepts without having to spend so much time implementing them simultaneously. This is benefiting programmers with deep knowledge and facilitating the interest of new students in this field. Machine learning, but of job, not just for programmers. Have you ever used Photoshop or after effects? If you have, I'm sure you agree with me that editing an image or a video is not can easy task, not to mention audio. However, I know a couple of artificial intelligence who don't think so. For example, deleting elements in a video, including the watermark, or stabilizing the image, or even adding more frames, are just one sum of the things that algorithms trying to understand the optical flow of a video can do. On the other hand, images work in a very similar way. They can even be put into motions into machine learning. Once again, artificial intelligence make it possible for an audience, without solving editing skills, to be able to generate content of increasing high quality. And in turn, it makes it possible for professionals to perform this task faster and easier. And not only that, it also offers new possibilities such as restoring all photographs and making them look like they were taken by a modern camera or a mobile phone. Or even isolating an instrument in a zone that you can study. The notes thats display this open up the possibilities for the birth of new businesses thats we will soon see as a commonplace. However, there is something even more impressive. Thanks to machine learning, in addition to modifying multimedia files, it is also possible to generate them. And that's incredible. Let me show you. One of my favorite examples is Dali. An artificial intelligence capable of generating images just through description. For example, an astronaut playing basketball with cats in a space in a minimal style. And here it is. Or if you prefer, teddy bears, working on aa research on the moon in the 80s. Granted, it's incredible. That's simply awesome. But wait a minute. These images does not exist. They are part of the imagination of an artificial intelligence. Does thats mean that they are creative? On this topic, there is much debate. Especially because if so, that will mean that machines come to possess one of the qualities thats we have said that are part of us, of the humans. But in any case, the key here is that the algorithm needs an input to work. It needs a creative person behind it, a person who thinks those crazy images. And the only thing thats it does is to generate a series of images based on others that it already knows. This kind of technology will revolutionate the world of design, but designers will not disappear. After all, anyone is capable of asking for a bowl of soup. That is a portal to another dimension, right? But only someone who knows basket style can make the algorithm generate this picture. So, as we have seen, the future is for us to start working side by side with artificial intelligence, eventually making it one of our everyday tools. And that's simply exciting. That's incredible, isn't it? So all this brings us to a new concept, the augmented intelligence. Augmented intelligence is nothing more than the use of artificial intelligence to augment your own capabilities. Okay, wait, let's stop a moment. They may sound a bit like science fiction, right? But let me give you an example. Remember when you used to add with your fingers, for example, one plus two, three. Oh, that's perfect. That was a safe method with a very little margin of error, but it was also tremendously slow and efficient. Remember now, the first time that you use a calculator, it took you longer to type in all the numbers than to find the result of preparation. The use of artificial intelligence will be exactly the same. Right. Now, when we think about machine learning, we imagine an expert mathematician typing like those codes right. And there is such a profile, and it's very, very necessary. However, those algorithms will eventually be packed, polished, and make available to anyone who wants to use them. And you won't even need to know all thats complicated mathematics behind it for you. It will be as simple as learning how to use a new tool, just like when you learn how to use a calculator. And that's the key. Artificial intelligence will become so commonplace that almost anyone will use it in their job. The challenge will be to understand how these machine learning algorithms think and how we must communicate with them to get the results that we are looking for. And thats skill, along with the other three d web that we have discussed, will distinguish us as the professional of the futures. But this is a topic for another talk. Thank you for joining. Thank you for being here. And I hope that it was great for.", "words": [], "utterances": null, "confidence": 0.930688583172151, "audio_duration": 847.0, "webhook_status_code": null, "webhook_auth": false, "summary": "-  Globant is a digitally native company that helps organizations unleash their potential. Right now I work in the data and AE studio to develop incredible stuff with data and mature learning. But I'm talking too much about myself. Let's talk about a much more interesting topic. Artificial intelligence.\n- We're immersed in a new industrial revolution driven by artificial intelligence. Thanks to machine learning, machines can perform repetitive jobs for us quickly, efficiently, and tastily. But this does not mean that jobs will be displaced. We will just leave that position to start performing new tasks that best match our skills.\n- GitHub Copilot is a tool capable of generating code for an input. Thanks to machine learning, in addition to modifying multimedia files, it is also possible to generate them. This kind of technology will revolutionate the world of design, but designers will not disappear.\n- Augmented intelligence is the use of artificial intelligence to augment your own capabilities. Artificial intelligence will become so commonplace that almost anyone will use it in their job. The challenge will be to understand how these machine learning algorithms think.", "auto_highlights_result": {"status": "success", "results": [{"count": 14, "rank": 0.07, "text": "machine learning", "timestamps": [{"start": 157082, "end": 157710}, {"start": 190726, "end": 191322}, {"start": 203748, "end": 204350}, {"start": 226460, "end": 227142}, {"start": 229788, "end": 230486}, {"start": 280028, "end": 280582}, {"start": 319750, "end": 320578}, {"start": 389084, "end": 389642}, {"start": 424046, "end": 424690}, {"start": 519910, "end": 521006}, {"start": 561732, "end": 562720}, {"start": 606548, "end": 607198}, {"start": 780572, "end": 781190}, {"start": 821796, "end": 822638}]}, {"count": 1, "rank": 0.06, "text": "new tasks", "timestamps": [{"start": 260378, "end": 261178}]}, {"count": 11, "rank": 0.06, "text": "Artificial intelligence", "timestamps": [{"start": 52138, "end": 53770}, {"start": 53930, "end": 55114}, {"start": 186988, "end": 188358}, {"start": 536412, "end": 537394}, {"start": 564392, "end": 565710}, {"start": 622408, "end": 623454}, {"start": 652788, "end": 654190}, {"start": 716552, "end": 717854}, {"start": 737228, "end": 738434}, {"start": 775512, "end": 776730}, {"start": 810932, "end": 812362}]}, {"count": 1, "rank": 0.06, "text": "New technologies", "timestamps": [{"start": 100694, "end": 101722}]}, {"count": 1, "rank": 0.05, "text": "new possibilities", "timestamps": [{"start": 582562, "end": 583538}]}, {"count": 1, "rank": 0.05, "text": "new and powerful machine learning algorithms", "timestamps": [{"start": 189728, "end": 192070}]}, {"count": 1, "rank": 0.05, "text": "new students", "timestamps": [{"start": 517176, "end": 518194}]}, {"count": 1, "rank": 0.05, "text": "new businesses", "timestamps": [{"start": 598288, "end": 599238}]}, {"count": 1, "rank": 0.05, "text": "other people", "timestamps": [{"start": 370424, "end": 371090}]}, {"count": 2, "rank": 0.05, "text": "learning algorithms", "timestamps": [{"start": 191078, "end": 192070}, {"start": 822282, "end": 823418}]}, {"count": 2, "rank": 0.05, "text": "Augmented intelligence", "timestamps": [{"start": 732572, "end": 734130}, {"start": 734290, "end": 735394}]}, {"count": 1, "rank": 0.05, "text": "incredible things", "timestamps": [{"start": 426444, "end": 427910}]}, {"count": 1, "rank": 0.05, "text": "very sophisticated machine learning tools", "timestamps": [{"start": 423112, "end": 425274}]}, {"count": 1, "rank": 0.05, "text": "working side", "timestamps": [{"start": 714792, "end": 715394}]}, {"count": 1, "rank": 0.04, "text": "mature learning", "timestamps": [{"start": 45372, "end": 46406}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}