{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/769f073b-91e6-4282-9e5a-279638f13bda", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["advancements", "archit srivastava", "architectures", "areas", "based", "be", "beginning", "being", "build", "can", "cater", "chain", "commercialization", "commercially", "computers", "computing", "concepts", "condensed", "conf fourty two", "dependencies", "india", "latin", "looks", "materials", "means", "o solutions", "principium", "problem", "problems", "senior technical consultant data engineering", "started", "statements", "sustainably", "try", "type", "utilised", "years"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "b228c2a7-03bc-4327-b4e4-b137ff34f173", "status": "completed", "error": null, "text": "Welcome to my talk principium diving into the quantum hardware ecosystem and today we are going to look into the quantum hardware picture that is there and what quantum hardware means, what are the different global scenarios that we are looking into and what the current and the future of indian quantum ecosystem looks like and what are the different use cases that we will be going through. So moving forward with the topic and the talk today. So before we dive deep, I'll just give a brief intro. About me so my name is architect Shavastava and I have been fortunate enough to found ATM along with my colleague, which is a quantum hardware community focused on improving and spreading knowledge about what the quantum hardware is. And I have also in my college days founded Circuit Quantum Research. In my college which was RV College of Engineering and in quantum Computing India, I, along with few of my colleagues, we were fortunate enough to found the quantum hardware learning circles that were there over there. I also worked on various use cases and various topics and it is a very good platform where we can learn a lot of things. In my final year of college, I was the quantum computing intern at Bose one QSI Private Limited. Currently the company is one of the leading firms in quantum simulations in CFT field. I am also a quantum evangelist at Inaugurus where I am working on the GKQCTP project and how it can help India in the coming years. And currently I am working as a senior technical consultant at zero nine Solutions, Bangalore, Karnataka. And personally I'm more interested in solving use cases of quantum computing where we can look into how to integrate quantum computing in the areas of astronomy astrophysics if we look at the motivation of the topic. So there is a lack of knowledge about quantum hardware ecosystem and the need for growth in the domain. And we need to increase and spread awareness about various topics related to quantum computing hardware. And there is an immediate need for people to indulge in the development of quantum hardware to realize effective quantum computing solutions in future. Because without effective quantum hardware solutions, we cannot essentially look at having optimized quantum software solutions also. So looking at today's contents, what we have is first we'll look into the introduction of quantum hardware, then we'll have a global picture, then how the indian landscape looks, and we'll also look at the different use cases that are there. So a brief, not so brief introduction about what the quantum hardware is. So when we talk about quantum hardware, people think that this is a quantum computer and this is the only hardware, but this actually is not the only picture that we have. So this is a relatively bigger picture if we see here, this is what the scale looks like. So we have the qubit signal amplifier here, the input microwave lines, the superconducting coil lines, also the cryogenic insulators, quantum amplifiers. This is the mixing chamber that we have here and various other components like cryogenic shields and everything. And we have various temperature gradation happening also. So as we move down the dilution refrigerator, the temperature decreases. And at the bottom of the contraption we have the qubit sitting where the temperature is nearly ten millikelvin. So I don't think it will be fair enough if I call this as the complete picture that we have right now. If you look at the bigger picture more. So this is what a quantum computer mostly looks like. So this was the thing that we think is a quantum computer. But actually this whole picture is what the quantum computer comprises of. So we have the qubit at the lowest end. We have amplifiers, we have microwave electronics, we have the software solutions also. And various, various things that we can have, we have here. So there are different readouts, there is computation going on. And a lot of things happen when we send signal and we receive signal and how the circuits are connected. It is not just the dilution refrigerator or the picture that we generally see of a quantum computer, which can be called as a quantum computer. But according to me, this is what the whole picture of a quantum computer looks like. What is under the hood of a quantum computer, you have. First we have the user interfaces. As we saw in the previous diagram. There are quantum algorithms and applications, logic level compilation, circuit optimizations happening, quantum error corrections, hardware optimizations, and various stuffs happening. Along with quantum firmware, which is called as the hardware error mitigation, we have various things on that level and the physical qubit hardware that we have. Finally, a generic quantum classical interface. How it looks like is the quantum classical interface involves several key elements required for quantum computing, control and readout subsystems. So these systems are distributed between the room temperatures at 100 milli kelvin. And so as we saw that the temperature decreases as we go down. And we also have a readout transceiver equipped with an integrated field programmable array or FPGA. And there are various D two cs ADC's, which allows a simultaneous readout of multiple qubits. We also have a cryogenic CMos brown chip that addresses the input output bottleneck that is there. And we also have various qubit test platforms that are there and qubit planes, readout multiplexings. We have various applications, quantum algorithms error corrections happening here, along with qubit control and the classical computer. And we have controlled readouts along with the routing and I O management and readout multiplexing is also happening. And at the bottom, we have the quantum chip that is there. So if we look at the circuit diagram also. So it looks something like this that we have read out resonators, read out transceivers, read out control. We have a DAC. And as we move down, the temperature starts dropping. And this is a picture what is happening on a very granular level that is there. So if we move forward with the talk, what we have here is how the quantum computer looks. So if we look specifically at the dilution refrigerator. So, we have various parts like quantum amplifiers, cryogenic shields, quantum signal amplifiers, input microwave lines, and in a general or a very bird's eye view picture, what we have here is the. The things that are happening in various quantum computing fields are the quantum computing theory that happens on the quantum complexity theory and the quantum algorithms. In the quantum programming, we have this layer. And in the quantum computing architecture, we have the system organizations and Quantum Microsoft architectures. We have the QVC and FT implementations, classical control interconnections, topologies and floor plannings, technology building blocks, which are the qubit interconnect technologies, qubit storage and gate technologies. So there are various qubit architectures that we can look. And this, personally, are my three favorite illustrations, beautifully drawn by my colleague Abhir Vaishnav. So, superconducting qubit, trapdance and photonic, these are very common architectures. And there are various architectures that we may look into. So if we look into the superconducting qubit, that's that we have here. So this is what a superconducting qubit looks like. And we have resonators. We have. So, in this picture, we currently have five qubits and qubit one, qubit two. So these are various qubits. And there are resonators in between for. And there are. There are lines for input and output that we can have. And this is a picture of the condor chip that IBM announced, and it has 1021 qubits that are there. And on a very bird's eye view scale, this is what the qubit architecture looks like. If you talk about the iron trap qubit architecture, we use laser beams to control ions. To address the two arbitrary ions in the string of trapped ions. It can be done with beams, the red ones that we have here. And this method can entangle two arbitrary qubits on the string of ions that are there. The basic principle that goes are the entanglement and superposition of the qubit. So, this is how we realize an ion trap qubit. So if we look into another simplified model of a compact ion trap quantum computer demonstrator. So, this actually is a simplified scale model of the quantum computing demonstrator, housed into an 18 inch racks, which are there. And the modules in the red correspond to the optical systems that we have. And in the green, what we have is for the communications and the readout. The blue is the electronics and amplifier is yellow is the fiber routing and switching. And the purple is for miscellaneous of the core module. So what we see here is basically a concept of a compact antwrap computer demonstrator. And this is from the. From a paper named as the compact ion trap quantum computing demonstrator. And it is a very good paper to get an idea about the concept moving forward. We also have the photonic qubit that we have. So, in photon. Photonic quantum computing architecture, photons are basically used as the basic blocks, building blocks of a quantum computer. And, uh, photons are basically, uh, entangled and, uh, sent into superposition. And the, uh, readout results, um, are then, um, checked and, um, maintained. And various quantum computing solutions are also realized using a photonic qubit. So. And the photonic qubits are also relatively easier to realize than the class, than the classical, uh, superconducting architecture, which is very popular around. So, if we move towards the global picture, how the global picture is looking for the. For the quantum hardware. So, the current global quantum computing market is approximately valued as at $500 million, which was in 2021. It is expected to reach nearly $1.7 billion by 2026. And the major investments are happening from the tech giants like IBM, Google, and Microsoft, and significant government fundings and private sectors. Investments are happening worldwide, along with rapidly growing interest from sectors like finance, healthcare and logistics. And these are not the only sectors that are attracting quantum computing investments that can happen. So, if you look at the picture of what the quantum computing companies look like, uh, these are, uh, only the 102 companies that are shaping the quantum computing landscape. And it actually is, um, like just 102. And it is a very, uh, dynamic and, uh, continuing, constantly developing area there. We are having a lot more companies popping up on a daily basis. Uh, so we can have a very, um, uh, like, bird's eye view of what different companies are working on different technologies. So we have superconducting photonics across industry and various companies, and we can see very big, big names also over here, and very new players also that currently are working rigorously in the domain. So if we look at how the current global market for the quantum computing is look like, so quantum hardware specifically is marketed, is valued at 300 million and it is projected to grow at 1.3 billion by 2027. And there is an increasing competition from startups and event trends. And if we see the quantum computing global market to increase on a daily basis, and there are a lot of investments happening and a lot of innovations happening regularly, and if we look, what will be the long term benefits, we ask is the enhanced computational power which we get from these quantum computers are driven to innovation and economic growth of any country that follows it. It accelerates advancements in AI, cryptography and material science. It attracts high tech investments, talents in boosting GDP, thus increasing the employability in any country, and strengthens national security through advanced encryption and defense capabilities. Because quantum computing in a very generic sense is very vast. And quantum cryptography, as mentioned above, is one of the key areas where a lot of development is happening globally, and it will increase the security landscape drastically that we can have, and it promotes leadership in the global tech landscape also, and along with various international collaboration. So it is not only if a country is developing the quantum computer or the quantum hardware ecosystem, but it happens based on how things are looking and how intercontinental or intercountry relationships work. And it increases the level of technology that we have. And any country that is investing in also increases the chances of better inflow of technologies amongst them. And if now we look at how the future looks like. So the expected market size of quantum computing is 2.5 billion by 2030. There is a continued exponential growth in the R and D investments, increased partnership between academia, industry and government, and rapid improvements in qubit scalability and stability, broadening application areas like healthcare, finance and climate modeling. And the quantum computing, like very various fields that we have in major mega science projects along the globe, is a intersection between academia, industry and government. And quantum computing for any nation cannot be realized without the interaction and involvement of all these three together. So it is a very holistic space where all the three come together and develop the whole country together. And looking more at India. So how the indian landscape looks currently is the India is coming out as a key player in the strategic investments for quantum computing, and national quantum missions and technologies and initiative that government is promoting is actually helping the ecosystem to grow a lot. And a lot of startups are coming on a very regular basis, and resource institutions and academia collaborations is increasing along with industry and the startup ecosystem that is existing in India. And there is a focus more on quantum cryptography, simulations and AI applications of India because it serves as the need for the r for the development of various other technologies in India at various scales and for other future technologies for the quantum computing field. Government is supporting various R and D projects, R and D initiatives, assigning budgets and fundings and development of skills in quantum technologies. We also have so, uh, these are very like one of the places where and institutions, communities, college groups which are promoting quantum computing at various levels and both professionally in academia, in industry, and I'm really sorry if I miss out on a lot of new upcoming initiatives or companies, and these are very few of them which I could have a grasp of and I'm really fortunate enough to have been part of a few of them from this. So quantum Computing India boson QSI Akum circuit in a gris kino Labs UPI AI is C IIT Madras TIFR and these are various quantum computing communities, companies, college societies, initiatives and colleges universities which are day in and day out working together to bring up the quantum computing and hardware ecosystem in India. If we look at the National Quantum Mission which the Government of India has initiated, so it is intended to invest approximately 8000 crores of indian rupees over five years, which is focused on fostering research and development and deployment of quantum technologies focus on quantum computing, communications and sensing applications, which will help in development of skilled manpower and established quantum labs and test beds, which will help position India as a global hub for quantum technologies and innovation. And if you look for future of India, so because of the heavy investment of government of India and by the help of national quantum Mission, we are going to have an increased ecosystem of quantum computing in future. And we currently also see a lot of quantum computing initiatives and companies coming up on a daily basis and they are fostering creating jobs in various areas. Strategic partnerships with academic institutions and international quantum research centers are also in place and are happening on a daily basis and they are increasing the academia industry interactions that happen. And there are a lot of emerging startups which are focusing on quantum hardware development and it is expected to that the quantum computing market share of India will increase in the future in the Asia Pacific region and also globally. And India is anticipated to be one of the biggest contributors in the quantum technology globally by 2030 and focus on sectors like cybersecurity, health, finance is underway and various projects are happening in India which are focusing on this like cuno Labs and various other communities and companies working on it and it aim, India aims to establish it as a significant player in the quantum computing landscape that is there. So if we move look at the various use cases that quantum computing can address. So what we have with us is a varied variety and an infinite amount of possibilities that can happen. So we have protein folding, quantum chemistry, design optimizations, supply chain inventory optimization, disease risk predictions, finance modeling and portfolio optimization, and various other. So these all areas where quantum computing will be implemented based on the quantum hardware that we, that we will be, we will be having, will help in addressing various scenarios and use cases in our daily lives in the longer term, say 50 years or 100 years, and achieve innumerable possibilities that we cannot even think of as of now. And giving a brief about a very interesting topic. So this was my talk that I gave at CoN 42 last year, and its name was inignoitis. And I tried to touch very slightly on how quantum computing can be used in the area of astrophysics. And this I presented as my personal interest about how it can be related to a very, very different field and how it can help in the development of that. So please check this talk out and if interested, just reach, reach out to me on LinkedIn. And I hope that this talk gave you some information about how the quantum hardware ecosystem looks like and how what quantum hardware actually is. And I wish you a great day. Thank you.", "words": [], "utterances": null, "confidence": 0.924802301948049, "audio_duration": 1446.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Architect Shavastava: Today we are going to look into the quantum hardware picture that is there and what quantum hardware means. What the current and the future of indian quantum ecosystem looks like and what are the different use cases. There is a lack of knowledge about quantum hardware ecosystem and the need for growth in the domain.\n- The whole picture is what the quantum computer comprises of. It is not just the dilution refrigerator or the picture that we generally see of a quantum computer. There are quantum algorithms and applications, logic level compilation, circuit optimizations, hardware optimizations, and various stuffs happening.\n- The current global quantum computing market is approximately valued as at $500 million, which was in 2021. It is expected to reach nearly $1.7 billion by 2026. India is coming out as a key player in the strategic investments for quantum computing.\n- I tried to touch very slightly on how quantum computing can be used in the area of astrophysics. If interested, just reach, reach out to me on LinkedIn. And I hope that this talk gave you some information about how the quantum hardware ecosystem looks like.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.1, "text": "various quantum computing communities", "timestamps": [{"start": 1179060, "end": 1182276}]}, {"count": 1, "rank": 0.1, "text": "various quantum computing solutions", "timestamps": [{"start": 722864, "end": 725712}]}, {"count": 1, "rank": 0.1, "text": "various quantum computing fields", "timestamps": [{"start": 501474, "end": 502826}]}, {"count": 1, "rank": 0.1, "text": "quantum computing hardware", "timestamps": [{"start": 169368, "end": 170884}]}, {"count": 38, "rank": 0.1, "text": "quantum computing", "timestamps": [{"start": 86860, "end": 87564}, {"start": 109460, "end": 110180}, {"start": 144438, "end": 145278}, {"start": 149342, "end": 150150}, {"start": 169368, "end": 170088}, {"start": 176152, "end": 176816}, {"start": 380424, "end": 381512}, {"start": 501866, "end": 502546}, {"start": 503090, "end": 504170}, {"start": 514058, "end": 514754}, {"start": 652104, "end": 653112}, {"start": 687934, "end": 688750}, {"start": 702606, "end": 703454}, {"start": 723336, "end": 724524}, {"start": 754306, "end": 755050}, {"start": 786576, "end": 787344}, {"start": 793160, "end": 794720}, {"start": 801398, "end": 802134}, {"start": 848374, "end": 849126}, {"start": 870802, "end": 871490}, {"start": 917856, "end": 918888}, {"start": 988232, "end": 988960}, {"start": 1009604, "end": 1010784}, {"start": 1029032, "end": 1030152}, {"start": 1065644, "end": 1066404}, {"start": 1107930, "end": 1108650}, {"start": 1137672, "end": 1138480}, {"start": 1167072, "end": 1167848}, {"start": 1180604, "end": 1181460}, {"start": 1195332, "end": 1196060}, {"start": 1216018, "end": 1216730}, {"start": 1249560, "end": 1250792}, {"start": 1254872, "end": 1256164}, {"start": 1289570, "end": 1290250}, {"start": 1325258, "end": 1325970}, {"start": 1330826, "end": 1331610}, {"start": 1354786, "end": 1355974}, {"start": 1397662, "end": 1398718}]}, {"count": 1, "rank": 0.1, "text": "quantum computing investments", "timestamps": [{"start": 786576, "end": 787856}]}, {"count": 1, "rank": 0.1, "text": "quantum computing initiatives", "timestamps": [{"start": 1254872, "end": 1257512}]}, {"count": 19, "rank": 0.09, "text": "quantum hardware", "timestamps": [{"start": 26670, "end": 27326}, {"start": 31220, "end": 32424}, {"start": 34836, "end": 35940}, {"start": 69118, "end": 69726}, {"start": 73950, "end": 75518}, {"start": 94172, "end": 94876}, {"start": 158942, "end": 159502}, {"start": 174392, "end": 175128}, {"start": 179784, "end": 180456}, {"start": 195604, "end": 196516}, {"start": 207780, "end": 208516}, {"start": 210892, "end": 211500}, {"start": 749970, "end": 751134}, {"start": 851194, "end": 852194}, {"start": 947950, "end": 949074}, {"start": 1284188, "end": 1284820}, {"start": 1359130, "end": 1360234}, {"start": 1434960, "end": 1435984}, {"start": 1439240, "end": 1440000}]}, {"count": 1, "rank": 0.09, "text": "effective quantum computing solutions", "timestamps": [{"start": 175752, "end": 177152}]}, {"count": 2, "rank": 0.09, "text": "quantum Computing India", "timestamps": [{"start": 86860, "end": 88184}, {"start": 1167072, "end": 1168484}]}, {"count": 1, "rank": 0.08, "text": "effective quantum hardware solutions", "timestamps": [{"start": 179208, "end": 180880}]}, {"count": 1, "rank": 0.08, "text": "quantum simulations", "timestamps": [{"start": 115370, "end": 116562}]}, {"count": 3, "rank": 0.08, "text": "quantum algorithms", "timestamps": [{"start": 349208, "end": 349904}, {"start": 430570, "end": 431290}, {"start": 506770, "end": 507934}]}, {"count": 1, "rank": 0.08, "text": "quantum chemistry", "timestamps": [{"start": 1342346, "end": 1343258}]}, {"count": 1, "rank": 0.08, "text": "quantum software solutions", "timestamps": [{"start": 184888, "end": 186048}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}