{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/49a70d14-af80-4730-ba04-80433eb402e0", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["accenture", "alberto garcia garcia", "become", "biggest", "can", "career", "clear", "come", "coming", "companies", "computing", "conf fourty two", "problems", "qmarket", "quantum computing iberia lead", "undecided"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "04ffea3a-5a8f-4d6b-9b77-0ac720f637fa", "status": "completed", "error": null, "text": "Hello everyone, I am Alberto Garcia Garcia and I am going to talk. And this talk is going to be about my quantum career. Well, I'm from Joca in Spain, but I'm based now in Madrid at Accenture. And well, I studied physics in university in Madrid because it was my favorite subject at the school, at the high school. Then I realized that I really liked quantum mechanics. And it's when I did my last year of my Erasmus change in tomb, where I specialize on quantum information. Then I started working in accenture at Madrid, where I'm based now. And I also did quantum chemistry, theoretical and computational chemistry master. And I also developed some quantum computing courses while I was learning myself. Now I'm leading the quantum computing team here in Spain at Accenture, developing real proof of concept, real use cases for the industry. But let's take a look deeper into that, because this is just a quick introduction. What about me? Well, as I said, if we see in the left side of the corner, this is a timeline that I will explain, more or less my trajectory. I started studying physics in university akobutanza, Madrid, in 2012. And in 2015, more or less, I decided to do my last year of my degree of my bachelor's, my bachelor on an Erasmus exchange. And that's why I decided to go to Munich, because I think the place could give me a lot of opportunities. And this is what it was. In third year of my degree, I realized that I really love quantum mechanics. I did the subject of quantum mechanics. Quantum physics, sorry. And I realized I really like it. That's why when I go to my last year of my Erasmus exchange in Munich, I decided to do as much subjects as possible around quantum mechanics. Honestly, it was really grateful because I could decide any subject I wanted. So I really focused on quantum mechanics. Moreover, I saw that there was the opportunity to work in the Max Planck Institute. So I decided to work there. Unfortunately, there wasn't open the position I wanted in the quantum computing department. I spoke with them and I did some work, but not much. But where I did work is in the nuclear physics department. And by that time I knew that quantum mechanics was my favorite subject. But I really liked as well nuclear physics. So that's why I was working. I worked in the nuclear physics department, where I worked to understand and analyze the polition of particles around the Alice. The Alice is a large. I don't collider. Remember the last word. Sorry. But this is a project of CERN, where I received all the data that was between the collision of two protons and then I needed to identify what kind of atoms were formed from this collision. I really enjoyed that work. And Tomb Munich, because I studied in tomb and then Max Planck Institute is nearby, so I also work, as I said, in the Max Planck Institute. Tomb also gave me another opportunity and is to really decided my degree thesis. Sorry. And I had the opportunity to work on quantum cryptography. In fact, my bachelor thesis, my degree thesis was around quantum information and quantum cryptography. Basically having deep research on that since the beginning and finally explaining the BB 84 protocol for quantum key distribution. Then when I finished at Munich, my studies, I came back to Madrid and I started working in accenture. Why? Because all the people surrounded me. I knew that I wanted to do academia, but due to my personal situation, I needed to start working. So that's why all the people around me told me that consulting films has very interesting, because they give you a lot of different possibilities to work on, not only just one of specified job. And that's why I decided to start working in Accenture. At Accenture. The first year, the first two years, because I have been in Accenture since six years ago, I started in the consulting finance department. I liked the work was doing, but coming from physics, I realized that I needed more. I wanted to do really interesting problems and really interesting use cases. And that's why I started on March 2017 at Accenture. And on September 2017, I was super lucky and super fortunate because a managing director, Ulysses Arant at Accenture, decided to start working on quantum computing. So I was super lucky because I contacted him and he accepted me. And then we found it with another partner, Jaime. With another mate for me, Jaime, we founded the quantum computing department in Iberia. Iberia Tax center is the region that is gathering Portugal, Spain and Israel. Then since September 2017, I was still in the consulting finance department doing finance projects. But then since September 2017, till now, I've been working on quantum computing. But since 2017, September till more or less February 2018, I was in the consulting finance department. But from 2018 till 2021, I was in the applied intelligence department. That is the data scientist, that engineering and business intelligence department. So what happened that these three years, more or less, when I started one year and then the following three years, I was doing quantum computing on my behalf, on my free time and sometime inside work. But most of the working hours I was doing data science, data engineering and business intelligent employees in clients. I needed to do both things at the same time, because quantum computing was an emerging technology, but I was belonging to another department. So I was really doing data science, classical data science and business intelligence projects. But as quantum computing, quantum technologies. Quantum mechanics is my passion. That's why I really wanted to work on it. I was doing it as much time as I can, most of the weekends, not all the weekend, because I really love resting to rest as well. And Sundays I need to rest because otherwise I get crazy. But Friday afternoon, evenings and Saturday morning, I usually got used to work on quantum computing. So this is more the time frame where we are right now. And in 2018 as well, I was in the BBBA project. That was the first quantum computing project I work on, and it was very, very interesting. This was done, of course, in his accenture hours, not in my free time, but was very interesting. Moreover, in 2019, I started being a teacher in the quantum Technologies master of the university, Polytechnic of Madrid. University of Polytechnica in Madrid. In fact, I want to say hello to Jane Pratik, that I know that he's also talking about his really amazing work on Gen AI, on life science, and I just want to say hello to him. Super proud and glad that he's speaking now on quantum computing. Okay. And then since 2018, more or less till 2022, I was in the applied intelligence department, but also working on quantum computing all time evangelization of the ecosystem, doing a lot of talks, et cetera. Still developing proof of concept, internal and client proof of concepts. But since 2022, I moved to the global quantum computing department. And yeah, my dream became really, I'm now spending since 2022, 100% of my time working on quantum technologies. So since then, I've been doing more or less the same work, but much more, developing much more internal assets, leading the team here in Iberia, in Spain, Portugal, Israel, in Iberia, and doing the same talks, et cetera, and working with real client projects now, and it's public. I'm working in Atlantic, that is a north regime of Spain, where we are developing proof of concepts around quantum computing, trying to get the limits of the technology and really benchmark how it is feasible. And just to add one more thing, in my career, this is more or less, I did a teacher. I have been also a teacher of other masters, like in the university in university autonoma de Madrid. And one more thing that I need to say is that more or less on 2018, I also did a master on theoretical and computational chemistry, because I'm cross industry. I work in finance, supply chain, life science, et cetera. But I really want to specialize on life science for problems like drug discovery or protein folding. And that's why I did this master because I needed to know more about this. I needed to know more about this area and that's why I wanted to do this, because thanks to this, it gave me a lot of knowledge on how to implement quantum computing for quantum chemistry problems. Then, since last year, our global quantum computing team in Iberia has changed. We are not now only covering quantum computing. My team is now called Next gen computing team and is covering several other technologies, good INX technologies like neuromorphic technology. We are also covering now quantum security that, as you know, is a must and everybody should need to be aware of and really take into consideration for future quantum computer attacks. HPC privacy per saving computing confidential computing space experiments computing space compute we're coming much more technologies. But yeah, just speak about the quantum career. This is more or less a bit of my career where I am now working on or where I work on in the different areas in the university I studied in the university computing Madrid the tomb and I also study my theoretical and quantum chemistry master in university autonomy Madrid in the sense of academia, I work as a teacher University of Polytechnica Madrid. I work in the Max plan and in terms of consortium, I'm in Ametic. Ametic is the spanish industry consortium where we have a working group around quantum technologies, and I am leading the use case working group inside of it. And then I am also actively participating in the quantum industry consortium in Quic. There I am contributing in the use case workgroup, but basically I am actively participating in the work group three. That is called education, because one of the main goals in my life is helping people. I really like helping people and try to get the best of everyone. And that's why I don't want never to be separate of academia, because I think that teaching is very important in life. And that's why I am also concerned that for quantum technologies, talent is going to be a must. And it's very difficult nowadays to find talent around quantum technologies. We will see that later on. But it's very important that everybody upskills their own skills as well as study quantum technologies to understand the technology. Okay, so now I will tell you what I've been doing in accenture quantum computing Iberia lead, because I now explain a bit of my career, but I also would explain what I've been doing exactly around quantum computing. Well, first of all, and I'm sure that you all know that quantum computing is going to be the following continuous technology that will disrupt at all the business. In fact, we did a survey in the New York metropolitan area a few years ago where in this survey we get this number, that is the 97% of the people of the survey thought, and I think they now think that quantum computing is going to be much more disruptive than AI. And this is something to really keep in mind, because disruption is happening now, and everybody needs to be prepared. In fact, one of the key areas is not only the investment that public government is doing, this is hugely all private companies and public companies are doing huge risk, but also how the ecosystem has been growing since I started in 2017 working on quantum computing, that there were only, I don't know, three, four, five companies, maybe ten. But those ten five were the big players, like IBM, Google, et cetera. So now you can see that the ecosystem is quite large, and even that is starting, growing every time. So this is just the very beginning. That's why in Accenture, we really understand that this emerging technology is very, this emerging technology is very disruptive, very different from what we already know. And that's why we need to understand, and we need to ensemble all possibilities, like talent. That is a priority for us. We did, since the very beginning, a lot of internal trainings for our people, because we understand that this technology is not easy. It's a change of mindset. And this needs training strategy. All businesses needs to know how this technology will impact their business, because the adoption of it is not easy, and everybody needs to know it. And the other thing that I would like to highlight is experimentation. Understanding the technology is not only training and reading papers, it's also experimenting with it. We need to grow with the technology. And for this case, you need to really develop quantum algorithms and apply those quantum algorithms to real use cases. That's why usually startups, and it's super good, they have the norm. Startups or companies, they have the norm to approach a bottom up approach. What does it mean that they get a specific quantum algorithm and a specific use case and they apply it, okay, and it's absolutely fine. But where we realize from our success use cases, success stories, is that a top down approach is better. We don't go for the quantum algorithm and then apply this quantum algorithm to the use case. We do the opposite from the use case. We go to business and say, hey, what are your dependencies? What do you need? Then we get the use case, and then we apply the best quantum algorithm that fits to the requirements and to give them business value. Our key differentiator, our differentiator value at Accenture on quantum computing is that we always try to give business value, not just applying quantum. That's why we consider an end to end architecture. Okay. That's why we consider can end to end architecture where we orchestrate different pieces of the different layers to use the best software for dedicated problem as well as the best hardware for dedicated problem. This is just a bit of commercial, where it's all of our services, where we have, since the showcase demo to the business experiment on the middle, a bit right of the slide. The business experiment is the most important one for me because it's when we have the delivery, we implement that. But of course, the long term projects like the strategic next steps like innovation or quantum foundry, to really understand how the technology is going to be impacted in the business, are also very important as well as all the services. But for me, the business experiment, because with this experimentation is where you really learn quantum computing. Iberia lead how quantum computing works and what are the limits of quantum computing. Some of the examples that we did at Accenture, some of the demos we have is currency arbitrage. It is an optimization problem that we applied in BBBA and this is based on what is the best path that we need to go forward to get benefit of changes on arbitrage, on currencies. Another example of the life science industry is the molecular companies. By doing again an optimization problem, we can compare two different molecules and see how similar they are. You another demo that we have, another application that we did is the quantum intelligent power scheduling. It is based that we have different batteries. It's electrical trading. This use case is from the resource, it's from the resource industry. And it's basically that we have different batteries and those batteries can charge and discharge energy. So based on the energy price, that is very volatile. What's the optimal scheduling of the battery charging or discharging to obtain as much benefit as possible while fulfilling the demand. Another demo that we provided by the Airbus challenge is the aircraft loading optimization. How we can get into the airplane, the different boxes, what is the best structure and how many boxes we can go enter the airplane to fit with the constraints of center of mass, maximum number of weight, et cetera. And this is not very related to quantum, but I wanted to highlight this credential. We have this demo that is related to HPC. That is one of the technologies we already saw in the past. We already worked in the past, but this is one of the milestones we had earlier, because here we really fit with a production environment. We are tackling the PFAS molecules. PFAS molecules are very dangerous for life and is degrading for plastics and is one of the main problems of America. Okay. And here the myson is that we use the 1 million core HPC from Intel and we were able to architect all the jobs of the execution to use all the computational power that the 1 million come HPC gave us. And it is good because we were very near to get the minimal energy of the PFAS molecules, not the biggest one, but almost the biggest one. Then finally, what are my suggestions for your quantum career? Quantum computing is true, that is in a very earlier stage, and it's not now giving revenues to the companies. But one thing is sure, everyone is investing a lot of money because they know that it's going to be disruptive. And as all technologies, this is an exponential, and everything in life is an exponential learning. What it means is that we don't want, I mean, businesses shouldn't want to happen to their business. What has happened to some of them. About the Gen AI, the famous JGPT new so businesses should be ready about quantum computing. Business should start now around quantum computing. Even if it is not giving now revenues, they should be ready for it because the exponential learning, the exponential progress on the technology could damage them. The same as Gen AI for those businesses that haven't been prepared has just damaged them this year. So every business needs to be prepared. So, for you, if you are not prepared, I mean, if you don't start learning quantum computing, if you don't start learning quantum technologies, it's true that now it might not be a lot of positions on quantum technologies, and the positions that there are are very difficult to access them because they really require very specific skills. Big companies want someone that knows quantum technologies, but another skills as well. And we understand that it's very difficult to get the quantum job nowadays. But as businesses need to be prepared for when the moment arrives and quantum gives a lot of revenues, you need to be as well prepared for that moment. Because if you don't study quantum computing now, if you don't start studying quantum technology, quantum technologies now, when this moment arrives and you want to start, there will be a lot of people that already learn quantum computing and will be in front of you in this race. That's why my four recommendations for you is, first, start studying quantum technologies now. It's true that it could be difficult, it might be or not, because you could have the chance or not. I have several students, like, for example, Jane Pratik is here explaining this. He's working on quantum computing because he is the master of quantum technologies in UPM, the first edition and now he's working. It's true that there are other students that are not, but if you don't start now studying quantum technologies, you don't know what would happen. Secondly, apply to any open position around quantum that might have. Of course it's true that you need to apply the position you want, but if you don't try, you will never know what happened. Third three, you haven't any other skills, just quantum technology skills. Learn another data scientist skills in case you want to do quantum applications. If you want to do, for example, quantum hardware, do engineering skills. What I'm trying to say is learn other skills about quantum technologies. Don't stop and say I cannot do that. Just learn more so you can improve your cv. And finally, stay in tune for future opportunities because quantum is a must. Everybody's investing and the opportunity will arrive. So stay tuned and be prepared. Thank you very much to all of you. Hope you enjoyed the session and please do not hesitate on asking me for any question. Thank you.", "words": [], "utterances": null, "confidence": 0.943089749287746, "audio_duration": 1445.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Alberto Garcia Garcia is based now in Madrid at Accenture. He studied physics in university and specialized on quantum information. Now he's leading the quantum computing team here in Spain. developing real proof of concept, real use cases for the industry.\n- In third year of his degree, I realized that I really love quantum mechanics. Since September 2017, till now, I've been working on quantum computing. With another mate, we founded the quantum computing department in Iberia.\n- Since 2022, I moved to the global quantum computing department. My dream became really, I'm now spending 100% of my time working on quantum technologies. I really want to specialize on life science for problems like drug discovery or protein folding. For quantum technologies, talent is going to be a must.\n- Quantum computing is going to be the following continuous technology that will disrupt at all the business. All businesses needs to know how this technology will impact their business. Understanding the technology is not only training and reading papers, it's also experimenting with it.", "auto_highlights_result": {"status": "success", "results": [{"count": 34, "rank": 0.08, "text": "quantum computing", "timestamps": [{"start": 71192, "end": 71966}, {"start": 75304, "end": 76114}, {"start": 171624, "end": 172318}, {"start": 342048, "end": 342854}, {"start": 353588, "end": 354426}, {"start": 375128, "end": 376450}, {"start": 404212, "end": 405114}, {"start": 418056, "end": 418766}, {"start": 429996, "end": 430834}, {"start": 456148, "end": 456954}, {"start": 464372, "end": 465198}, {"start": 501844, "end": 503146}, {"start": 514648, "end": 515294}, {"start": 528018, "end": 528706}, {"start": 564552, "end": 565598}, {"start": 624574, "end": 625586}, {"start": 632018, "end": 632786}, {"start": 637218, "end": 638470}, {"start": 777406, "end": 778254}, {"start": 786812, "end": 788098}, {"start": 791872, "end": 792934}, {"start": 816072, "end": 817630}, {"start": 846848, "end": 847734}, {"start": 988604, "end": 989286}, {"start": 1056020, "end": 1056586}, {"start": 1057732, "end": 1058506}, {"start": 1060292, "end": 1061470}, {"start": 1229458, "end": 1230466}, {"start": 1268008, "end": 1269134}, {"start": 1271336, "end": 1272770}, {"start": 1301952, "end": 1302874}, {"start": 1340716, "end": 1341586}, {"start": 1352596, "end": 1353386}, {"start": 1374104, "end": 1374846}]}, {"count": 2, "rank": 0.08, "text": "quantum algorithms", "timestamps": [{"start": 932764, "end": 934050}, {"start": 935052, "end": 935906}]}, {"count": 3, "rank": 0.08, "text": "quantum chemistry", "timestamps": [{"start": 61508, "end": 62830}, {"start": 625788, "end": 626754}, {"start": 693408, "end": 694166}]}, {"count": 1, "rank": 0.08, "text": "quantum chemistry problems", "timestamps": [{"start": 625788, "end": 627400}]}, {"count": 2, "rank": 0.08, "text": "quantum information", "timestamps": [{"start": 52836, "end": 54080}, {"start": 256068, "end": 257102}]}, {"count": 1, "rank": 0.08, "text": "quantum applications", "timestamps": [{"start": 1412820, "end": 1414234}]}, {"count": 1, "rank": 0.07, "text": "study quantum technologies", "timestamps": [{"start": 769368, "end": 770654}]}, {"count": 1, "rank": 0.07, "text": "quantum key distribution", "timestamps": [{"start": 267752, "end": 269490}]}, {"count": 1, "rank": 0.06, "text": "global quantum computing department", "timestamps": [{"start": 527628, "end": 529442}]}, {"count": 3, "rank": 0.06, "text": "quantum computing department", "timestamps": [{"start": 171624, "end": 173010}, {"start": 353588, "end": 354842}, {"start": 528018, "end": 529442}]}, {"count": 1, "rank": 0.06, "text": "good INX technologies", "timestamps": [{"start": 646422, "end": 647382}]}, {"count": 1, "rank": 0.06, "text": "confidential computing space experiments", "timestamps": [{"start": 665306, "end": 668106}]}, {"count": 1, "rank": 0.06, "text": "first quantum computing project", "timestamps": [{"start": 464068, "end": 465490}]}, {"count": 1, "rank": 0.06, "text": "Next gen computing team", "timestamps": [{"start": 641628, "end": 643500}]}, {"count": 1, "rank": 0.06, "text": "several other technologies", "timestamps": [{"start": 645094, "end": 646374}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}