{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/65e7def8-8f15-4c0f-a4b2-15b8d66a41ab", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["amber vanderburg", "building", "buildingequipping", "challenges", "changing", "collaborate", "communication", "conf fourty two", "confronting", "constantly", "expectations", "founder", "from", "frustrations", "products", "provide", "remote teams", "rightfit", "teams", "the pathwayz group", "tools", "ventures"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "31b476bb-1c63-4484-97cd-9f020de370a8", "status": "completed", "error": null, "text": "Hello and welcome to the future of work. I bet you didn't realize that we were going to get here literally overnight. But here we are in a completely new landscape. And as we prepare to emerge, merge into a new set of normal, many are taking this time to evaluate what habits and routines bird that of COVID necessity should be added to our new normal, what should be omitted and what could be changed. And one thing that has taken the world by storm is the emergence of remote teams and remote work. And while there have been some organizations, this has been the norm for many, many organizations. Remote teams were unheard of a few months ago. And as we reemerge into a collective society once again, many organizations are re evaluating the benefit and challenges of remote teams. Which leads me to this. How do we build and lead remote teams? Well, my name is Amber Vanderburg, and I'm the founder of the Pathways group, where we work with teams from all over the world, training in effective leadership, team building and strategic human resources. Now, I've traveled physically with my mask and virtually around the globe, speaking and consulting with organizations that are transforming the way that we do work. First, let's acknowledge that not all remote teams are equal. There are remote teams that are globally remote, meaning that there are teams that consists of remote workers from all over the world. These teams, they can be more diverse. They have a greater breadth of network experience and knowledge, but it also has additional challenges in cultural communication and collaboration, and of course, time zones. And today I lead teams that are globally remote. But in the same regard, there are domestically remote teams in addition to locally remote teams. And these are teams that do work from home, but they are in the same general geographic space. And then there are hybrid remote teams in which employees and team members work sometime at home, and then they also spend time at the office. So it's important to keep in mind what type of remote team player and what type of remote team that you are leading as you're seeking to build and lead your team. And so identifying what type of remote team that you have can really act as a guide for creating your policy, your leadership style and your organizational culture. Now, I've lived and I've worked all over the world in international business, and I believe that leading great teams boils down to four pillars of team management or human resource management. Now, this is not using humans as resources. It's provide resources to humans so that they can be as successful as they can be. And it's providing resources so that your team and the people within your team can reach their goals. And if you are successful in all four of these pillars, then you're doing all right. And while the application and the tools towards success are slightly different in physically close teams rather than remote teams, these pillars and these main ideas really do remain the same. And the first pillar is to build your team. That's right. It's really that simple. Build your team. See, if you're a hiring manager, you are a decision maker in the future of your company because recruitment is literally how organizations build the future. So what factors should you consider whenever building your team? What specifically should you be looking for? Is it personality? Experience? Education? I was working with one hybrid remote team as the HR director, and we had a serious discussion about what our ideal team player looked like. And one of my favorite leadership gurus and authors, Patrick Lynn Sioni, writes that the ideal team player has three major factors that you can look for in your remote teams. The first is to look for a team member that is humble. Now, a humble team member is trainable and open to healthy conversation. They don't have huge egos and they truly are a team player. A humble person is adaptable, which is really important in remote teams. They listen to others and they admit mistakes as learning opportunities. And in a remote team, the likelihood of mistakes due to miscommunication and cultural misunderstandings is massive. And so a humble team member must be able to acknowledge misunderstandings and be proactive in learning about other culturals, communication styles and ways of work. They must be adaptable. It's so important that your team member can adapt and change to new situations. And whenever you're recruiting for a humble team member, ask specifically about their experience when working with different cultures and communication styles. Ask about adapting to new landscapes and dynamics, and ask them about any misunderstandings or miscommunications and how they have or would have handled that situation. Remember, it's really important to recruit a team member that is humble. The next major factor of an ideal team member is someone who is hungry. Now, a hungry team member is always longing to improve and be better. They love to take on new opportunities, they have really good work ethic and they have a drive to grow. Hungry people have an energy and a passion that is unmatched by some companies that have warm bodies of building the seats, right? So we want to have people that are hungry. And whenever you are recruiting a hungry team member, ask about something for which they have worked hard. Ask them how they spend their free time. Ask about their work ethic as a youngster, and these questions will help you to get an idea of the type of hunger that your applicant or potential team member may bring to your organization. Remember, much of remote work is self driven, and in any team, trusting your team members to be good stewards of time and energy and resources is really important, but it is an absolute dire necessity in remote teams. You want to have confidence that your remote workers are hungry and self driven and self motivated. Emerging technology plays a critical role in remote work, and equipping your team members with continuing education and tools to thrive in remote workplaces is really critical. So ask your candidate or potential team member about their experience with continuing education and their openness to new technologies. In particular, assess current technological literacy and also forecast future technological learnings. The world is quickly changing and it is vital that your remote team members be eager to learn and to change to stay relevant in our evolving workforce. You want to seek a team member that is hungry. The final factor that Patrick Lincione tells us to look for in our team members, especially in remote teams, is to find a team member that is smart. Now, a smart team member is both technically smart and also is people smart. So they have a high EQ and a high iq. A smart person is capable of doing the job. And when recruiting for a smart team member, ask about their personality, ask about handling difficult colleagues, ask about their ability and skills to do the specific job, and these questions will help you get an idea of the spartness that your candidate will possess for the job as a player in your organization. Empathy is key in a remote employee and it really requires a specific ability and intentionality to do well. And oftentimes empathy is overlooked as a critical skill, especially in remote teams. A major pain point in many remote teams is a lack of personal connection, and a smart teams member builds connections with others and seeks relationships. A smart team member is well equipped to do the job in ability and skill in IQ, but also has a tremendous high level of EQ and people skills as well. Also, remote players, they have to be adaptable to different cultures and schedules and of course, if you're in a globally remote team, time zones. So ask about flexibility to schedule and if they can be smart in those different relationships. Remember, there are different skill sets that you use in a remote team, such as having to be very good at email and video conferencing and technology, whereas in a physical brick and mortar team, it might be a little bit different skills that you're looking for as well. So there is a difference and so be very specific in knowing what the job is so that you can be very catered in the questions that you are asking to assess the smartness of your potential candidate. So seek a team player that has a high EQ and a high IQ EQ being emotional intelligence. So an ideal team member doesn't possess just one or two, but actually possesses all three of these factors. And if any one of these factors are missing, then the idealness of the candidate begins to wane a little. See, a hungry and a smart player that isn't humble will be very arrogant to the team and not want to train to improve. And a humble and a smart person will do the job, but not have the drive to do anymore. And a hungry and a humble player that isn't smart will work really hard, but not be of maximum use and productivity to the team. So depending on the job, the fact that somebody has a great personality and is personable and dresses for success might not have any influence on getting the job done. The fact that he is a poor communicator through email might actually play a very significant role. And so the questions and the factors that we seek in our remote workers are not exactly the same as our brick and mortar employees. So here's what I want you to do. I want you to look at your interview questions, review the questions that you are asking in that interview process, and intentionally recruit your ideal team member whenever building your team. And that's your first pillar, is to build your team. The next pillar is to value your team. So we're going to value our team. And whether it's in person or remotely, it's actually really critical that we express value to our team members, because people want to feel valued. And one simple way that we can show our value is to provide the right tools and systems for our team. Communication, project management, and HR tools are all really important for equipping our teams to be successful. And if you say that you care about team success and then deny the right tools and investment and resources, it can be really, really frustrations for your employees. So take a moment to look at your toolbox. The tools for remote workers are slightly altered from brick and mortar. Also, logistics are a little bit different. Time zones, mediums of communication, time off communication are all a little bit different, especially in terms of being mindful of emails and phones. Personally, it is my belief that it is worthwhile to try and separate personal and professional phones and emails and mediums of communication in that onboarding process for a couple of different reasons. First, it's a very clear distinction between professional life and personal life, which is a good mind difference for your employees. But second, it makes for a very clear offboarding process if and when your employees and your team members are no longer a part of the organization. And so it makes for a very clean onboarding process on the back end. Another way that we can show value is through communication and through benefits. And for a remote team, it is a little bit different from brick and mortar. I mean, does anyone actually care about teams Friday? Not really, especially not in a remote team. See, compensation takes into account industry and organization and position, no matter the status of work. Now, some have begun a conversation about the physical cost of living and people that live in different places and those different costs of living and how that has an effect on remote workers. This is a conversation that is still ongoing. There is a variety of different opinions that various organizations are looking into. So that might be a factor that you want to include within your conversation whenever you are deciding your communication. And your benefits is the physical cost of living of your remote workers. And then you also can look at your benefits. Now, benefits is a really fun part about leading teams and here's what I want you to do. Very simple, ask your team members what benefits your employees want. So take the time to listen to your employees and ask those questions. Also, there are ways that you can engage your team members and valuing your team by actually valuing your team. Lack of social interaction has proven to be very tough on some remote team members. So send care packages, check in. Be intentional about building a relationship. Find ways to connect with your team members through your Zoom meetings. Beyond just professional gap, some teams are doing this through themed dress up days for their Zoom meetings. They're having happy hours with their team members. They're having game nights. I've hosted a number of different game shows to really engage our team members and to move beyond that personal, professional gab and still have that personal connection. Any way that you do it, be personal to your teams, but find a way to show that value by building a personal connection and a personal relationship with your team members. So we have built our team. We valued our team. Now it's time to train our team. So I always think about Rocky in the first rocky whenever he is training for a championship and he goes up on top of the stairs and he raises his hands as he is training. And so I always think of training as raising my hands. See, I oftentimes think about a famous professional sporting teams. I think of a professional NFL teams. And imagine if you built a solid team. You recruited the best players in the industry, you paid them the highest salary and then you never went to practice, you never trained. The likelihood of you actually winning a championship is very, very small. Recruiting the best players and paying them the most salary will not guarantee success. You have to train in between Sundays so that you can compete on game day. See, the world of work is ever evolving and we must be able to train our employees to stay relevant and to stay competitive and to truly stay engaged. Virtual meetups and continuing education can be really powerful. Also, don't discredit the power of in person meetings, say annually or biannually. Some, if they are domestically remote or locally remote, will do monthly meetings depending on how vast your geographic separation is within your remote teams, find ways to offer confronting education and continuous training within your team. This is where we truly offer the opportunities for our hungry team members, for our driven team members to continuously improve and progress. So continue to stay up with your team and to stay up with the learning opportunities and the growth opportunities within your team and continue the best practices to empower your team members to move forward, both professionally and personally. So first we're going to build our teams. We're going to recruit humble, hungry and smart team members to our remote teams. Next, we're going to show value to our team, which is shown a little bit differently in remote teams than brick and mortar teams. Next, we're going to train our team. And training your team is critical again, both in physical teams, physically close teams or remote teams. And we're going to do that by offering different technologies and offering continuing education opportunities and offering different ways that we can flex our muscles to continue to grow and to continue to improve so that we can stay competitive and we can stay relevant. The last pillar that you can use to lead your remote teams is to retain your team or to keep your team. Hold them close and you might be thinking. Amber Vanderburg my team members get to stay at home in their pajamas. They have a flexible work schedule. Why would they ever leave? I hate to break it to you, but you're not the only team that offers remote work. See, it's so important in this time that we keep retention at the forefront of our conversation, even in, especially in remote teams. See, retention in remote teams probably won't come from an over annoyance from the person down the hall or the person in the cube next to me that is talking loud on the phone and eating chips very loudly every day. It probably won't stem from that, but it might stem from a few other ways. And like in your recruiting process, relationships require a lot of communication see, as we are building our team and valuing our team and training our team, there's one constant that is a thread within all of these pillars and that is building relationships, building quality, intentional relationships and being intentional. And I mean quality communication. See, this is a place for digital communication. One of my favorite authors and leaders, Dr. Mark Rutland, writes that quality communication comes down to the right message, to the right audience in the right way at the right time. So it's important as you are leading your teams, you're asking this quality question, right? Is this the right message? Is this the message I should be delivering? Is this the right audience? Are the right people at the table? Are the wrong people at the table? Right. So we're going to assess are the rightfit people at the table? Next, is, is this the best way to deliver my communication? And this is really important. See, oftentimes there's a lot of attention given to the actual message, but not enough given to the actual method. And the method of your communication is so critical. Generally, whenever I work with teams, we discuss how many emails or how many texts it'll take to solve the challenge, to come up with an answer before it's important for us to pick up the phone or get on a Zoom meeting. Generally with most teams it's about five to seven. So an average of six. So an average of six emails going back and forth. If it's going to take ten emails, if it's going to take 15 emails for us going back and forth to come up with a solution, then email probably isn't the best method of communication for us to use. We should probably go to a different form of communication. And this does a couple of different things. First, it allows you to get answers quicker, which is something that we all would love to do rightfit. So being able to get those answers more efficiently and so that is super important in itself. But even more so on the relationship side. Whenever you are delivering a message and there is a span of time in between each message in the correspondence, there is a span of time for emotions to build and there's a span of time for the words to sink in. Now, this is really, really desired. Whenever you are sending, say, love letters, see, there is a span of time between each letter for the words to sink in, for the emotion to build, but it is not as desired of a products. If we are talking about something that is more technical, maybe something that has an emotion that is not affection, but could be a little bit more tense or more challenging, and having a span of time in between each email can result in some avoidable tension within teams. So it's important to be intentional about the method of communication that you are using. In the same regard, there are some phone calls, stand ups, in person meetings, or zoom meetings. That could be an email, it could be a text, it could be a memo. So generally, whenever I work with teams on deciding the best method of communication, I actually look at the responses and does this require a response? Is it going to be just a couple of responses or is this going to be a long thread of communication and correspondence? And then you can decide your method of communication there the best method of communication from that. And then the last factor is, is this the right time to deliver this message? See, it's important that we be personal and that we be professional. Now, in our professional lives, we have a lot of messages that tell us to be very brief, but let us not conflate our brief communication with clear communication. And the time that you save in fewer words typed could actually result, it could result in more time being spent by the team trying to figure out what you actually meant and then misinterpreting it. So it's really critical in those memos and in those texts and in those emails that we are very clear in our communication. So don't bombard your team with a lot of messages that are conflating that brief communication with clear communication. So we want to be very clear in the communication that we are building also. So that's one way that we can really keep our team is to provide clarity. And that seems very simple. But by providing clarity in our communication, in our leadership, in our job on what I'm actually going to do, that can eliminate so much frustration and tension within our team, people will more than likely want to stay there. Right. We want to stay in a place that has that clarity within our teams. Also create opportunities for growth within your remote teams. Now see, whenever I am joining a remote team, whenever we have people that are joining remote teams, there still is that drive, especially if you are recruiting hungry people, a drive to move up in the ladder. So make sure to offer those continuous opportunities for growth. Yes, in the training, we're growing in our skill and in our talent, but in the retention efforts offer opportunities for growth within the organization and within the company. Now, whenever I work with teams, we actually look for flexibility on a ladder scale. So moving vertically, but also moving horizontally as well. So if someone is not happy in their position, they have a lot of different options that they can go to throughout the organization to really be successful, offer those opportunities for growth and offer some sort of a timeline expectation within your employees, for your employees that are wanting to move within the communication, that are changing to grow within the organization and that are truly wanting to bring success within your team. So going to go through the four pillars one more time and see these pillars are so important. It reminds me of one time I was actually working with a team in India. I was actually a football coach or a soccer coach for Paris Saint Germain or PSG academies in Bengalur, India. And I recall one time I was coaching a very young team and a young lad ran out onto the field. He was about six years old and it was his first day of football. And so he came running out onto the field and he began yelling, pass. And I noticed that he was yelling, pass even whenever the other team had the ball. And he was yelling, pass when he was miles away from the action. And he was yelling, pass even whenever he had the ball. And so he was running with the ball yelling, pass. Pass. And so I asked him, I said, why are you yelling pass? And he said, miss Ember, I do not know what it means. I only know it as a football word. And sometimes I hear organizations, I can hear leaders sound a little bit like my young soccer player friend yelling, build your team. Recruitment, collaborate, compensation, retention, innovation, yelling all of these words because we know that they are really good words that can lead to big goals. But if we're in the wrong position, if we're miles away from the action, or if we even have the ball and we don't know in which direction we're going, then saying these words are not only ineffective, but they're actually detrimental to the overall communication within your team. But if we take the time to build our team very intentionally, by finding team members that are humble and are hungry and are smart, if we take the time to value our teams being very catered to the value and intentional value that we can bring to our remote team members in a creative and personal way, if we take the time to train our team in new best practices and new growth opportunities in talent and in skills, so we can stay competitive and we can stay relevant, and if we are intentional to retain our team and to keep our teams by provide a more efficient and a more effective and a more enjoyable workplace, then we'll be in a position to yell pass to receive the ball, to move forward and to score really big goals. Welcome to the future of work. Let's go score some goals today.", "words": [], "utterances": null, "confidence": 0.94295945328719, "audio_duration": 1997.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Remote teams were unheard of a few months ago. As we reemerge into a collective society, many organizations are re evaluating the benefit and challenges of remote teams. Many are taking this time to evaluate what habits and routines should be added to our new normal.\n- Amber Vanderburg is the founder of the Pathways group, training in effective leadership. She says leading great teams boils down to four pillars of team management. The first pillar is to build your team. The next is to recruit a team member that is humble. The third is to look for someone who is hungry.\n- Communication, project management, and HR tools are all really important for equipping our teams to be successful. The tools for remote workers are slightly altered from brick and mortar. Separate personal and professional phones and emails and mediums of communication in that onboarding process.\n- Another way that we can show value is through communication and through benefits. Ask your team members what benefits your employees want. Lack of social interaction has proven to be very tough on some remote team members. Training your team is critical again, both in physical teams or remote teams.\n- The last pillar that you can use to lead your remote teams is to retain your team or to keep your team. Quality communication comes down to the right message, to theright audience in the right way at the right time. Be intentional about the method of communication that you are using.", "auto_highlights_result": {"status": "success", "results": [{"count": 25, "rank": 0.12, "text": "remote teams", "timestamps": [{"start": 71624, "end": 72686}, {"start": 83778, "end": 84754}, {"start": 98000, "end": 99382}, {"start": 104916, "end": 106490}, {"start": 136300, "end": 137154}, {"start": 139072, "end": 140022}, {"start": 173310, "end": 174530}, {"start": 176898, "end": 177906}, {"start": 188562, "end": 189750}, {"start": 273352, "end": 274462}, {"start": 341372, "end": 342878}, {"start": 363592, "end": 364702}, {"start": 514184, "end": 515566}, {"start": 580172, "end": 581138}, {"start": 640720, "end": 642170}, {"start": 644656, "end": 645638}, {"start": 1204612, "end": 1205790}, {"start": 1253172, "end": 1254350}, {"start": 1261972, "end": 1262862}, {"start": 1276284, "end": 1277282}, {"start": 1302196, "end": 1303002}, {"start": 1339456, "end": 1340934}, {"start": 1342432, "end": 1343542}, {"start": 1727932, "end": 1729106}, {"start": 1736402, "end": 1737358}]}, {"count": 21, "rank": 0.12, "text": "team members", "timestamps": [{"start": 192172, "end": 192902}, {"start": 503732, "end": 504462}, {"start": 530156, "end": 530902}, {"start": 563198, "end": 563922}, {"start": 578508, "end": 579270}, {"start": 840992, "end": 841818}, {"start": 931612, "end": 932440}, {"start": 1017256, "end": 1018002}, {"start": 1030444, "end": 1031366}, {"start": 1043606, "end": 1044554}, {"start": 1055572, "end": 1056254}, {"start": 1068888, "end": 1069458}, {"start": 1076012, "end": 1076646}, {"start": 1095792, "end": 1096620}, {"start": 1219902, "end": 1220722}, {"start": 1221902, "end": 1222594}, {"start": 1238912, "end": 1239546}, {"start": 1251658, "end": 1252414}, {"start": 1312660, "end": 1313374}, {"start": 1938022, "end": 1938618}, {"start": 1951962, "end": 1953070}]}, {"count": 1, "rank": 0.11, "text": "remote team player", "timestamps": [{"start": 202852, "end": 204522}]}, {"count": 1, "rank": 0.11, "text": "many remote teams", "timestamps": [{"start": 644336, "end": 645638}]}, {"count": 1, "rank": 0.11, "text": "hybrid remote teams", "timestamps": [{"start": 187996, "end": 189750}]}, {"count": 1, "rank": 0.11, "text": "leading teams", "timestamps": [{"start": 1012052, "end": 1012938}]}, {"count": 1, "rank": 0.1, "text": "team success", "timestamps": [{"start": 863912, "end": 864770}]}, {"count": 1, "rank": 0.1, "text": "team management", "timestamps": [{"start": 235740, "end": 236642}]}, {"count": 1, "rank": 0.1, "text": "physical teams", "timestamps": [{"start": 1273112, "end": 1274206}]}, {"count": 1, "rank": 0.1, "text": "most teams", "timestamps": [{"start": 1473592, "end": 1474350}]}, {"count": 1, "rank": 0.1, "text": "leading great teams", "timestamps": [{"start": 230844, "end": 232738}]}, {"count": 3, "rank": 0.08, "text": "remote team members", "timestamps": [{"start": 562792, "end": 563922}, {"start": 1043040, "end": 1044554}, {"start": 1951172, "end": 1953070}]}, {"count": 3, "rank": 0.07, "text": "smart team member", "timestamps": [{"start": 586588, "end": 587714}, {"start": 602036, "end": 603450}, {"start": 654852, "end": 655802}]}, {"count": 2, "rank": 0.07, "text": "hungry team member", "timestamps": [{"start": 442528, "end": 443686}, {"start": 471240, "end": 472750}]}, {"count": 3, "rank": 0.07, "text": "humble team member", "timestamps": [{"start": 348608, "end": 349542}, {"start": 380428, "end": 381682}, {"start": 405892, "end": 407242}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}