{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/f19375e5-cc9f-432f-9454-8fef415470ad", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["apis", "be", "because", "behind", "better", "bigger", "bring", "call", "can", "cannot", "civilization", "co", "code", "conf fourty two", "conferences", "convey", "could", "devs", "dinosaurs", "dont", "generations", "grandchildren", "how devs can save future generations", "lets", "manuel carrasco molina", "manuels", "meetings", "older", "programmer", "realized", "senior swiftui dev ethical hacktivist", "slides", "socalled", "software", "stuff mc", "try", "under", "were", "years"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "6303bfd7-05f2-4678-996f-ff2f0eaa7c95", "status": "completed", "error": null, "text": "All right, so we are here to talk about Pachamama, the planet, modern nature and how as a develop or as human bring. You should care about it. I consider myself as a political activist with a h because I'm a developer as well as I will tell you in a second, my name is Manuel Carrasco Molina. On the Internet I go under blip.org is so blip means stays in German. It's my journalist activity following the environmental movements. I like to play around with final cut pro and logic pro and try to do some hopefully good video. I'm a french speaking spanish guy, born in Belgium, which has been living in Germany for the last 18 years. We see. Yeah, I basically love Europe, except for the way they treat refugees at the border. I'm not 24 years old, I wish, but I am a dinosaur in this environment of developers because I've been developer for 24 years, developing for the iPhone since 2008. But I like way more than nature. So this is why I'm pretty critical at Apple when it comes to environmental aspects. Ten years active with the Green party, four years in the city council near a city that I will show you where there is a big coal pit called captain. We moved three years ago, we bought a new house, and so now I am since last year again involved in the city council, but this time also in the regional council. And I hope that my political career will go further on just for the sake of protecting the environment. Considering myself a climate activist and also refugees activist, I do this mix of politics, activism, journalism, free journalism, reporting on the field, being with the real activists, I would say. But I see myself as part of the global solution, being just hopefully a tiny part of it. Eight years without any meat. I wrote a book on APIs called Karma based API on Apple platforms. It's about building privacy into iOS and OS apps. If you take a picture of this QR code and you will make a tweet that you like the book, even though you haven't read it yet. And I will pick the three first ones that are retweeting this thing and all the others. I hope you can help me spread the good message about our privacy is an important thing. I gave talks about privacy also at different conferences. You can find it online. Let's look at the mass, as I call it. This is what we always refer as like the base point. Obviously since were industrialized, we've fixed a couple of problems. We have less poverty than we used to have. It also means that growth comes with a few problems. As you can see by this curve, it goes all the way to the top. And we are right now about 1.2 degrees. This is why every time you hear 1.5 degrees, which is the goal, we have to reach it, actually, because if we dont, we will be in a big mess, especially people in the global south. In this talk, I will play a couple of videos. The next one is from ITV News. Let's go into it and let's face the truth, truth, truth. Scientists say that since 1970, temperatures have risen faster than in any other 50 year period over the past 2000 years. They fear that a target of keeping warming below one dont five degrees will now be breached within 20 years unless there is immediate, rapid and large scale reductions in greenhouse gas emissions. So this is what we have to do together. Immediate, rapid and large scale reductions. So as an industry, as developers, as ceos or whatever, we can be responsible for large scale reddictions. The socalled obviously depends if you are whatever, the CEO of Facebook or if you have just an app which three people have downloaded. But every one of us can do something at this scale, and also every one of us can do something personally. So this is why this talk is also about, not only about you as a developer, but also you as a human being. One of the things that I do since many, many years is I go with my camera, with microphone and whatnot, call the years that are necessary to do, to produce those kind of videos. Some people that I know are going with drones, for example, and we follow the people that are doing basically civil disobedience. Thank. It's happy. That's. Thank you. All right, so the video goes for another, like, in total for 14 minutes. So check it out if you, if you'd like. And basically, they were fighting against the next problem, so to say, which is gas, and generally lng, which is the liquid gas imported from the global source, from parts like Argentina, from Vacamuerta, for example, where basically indigenous people are endangered. Another thing that is more like the current problem, but which is hopefully starting to be fixed and being phased out, is lignite. So it's bronchial, as we call it in German. A big chunk of Germany is filled with those holes, which I explain you a little bit on the right. And this is the biggest polluter in Germany, which is just a couple of kilometers away from where I live. And it produced every year as much co2 as New Zealand. So as you can tell. So I'll show you in this map over there. If you go somewhere over there, it's very tiny. But if you look it up on Apple Mac, for example, this thing is actually where the image on the left is. And this other thing over there, this huge thing, is actually the could pit. It's actually as big as cologne itself. And you might recognize that over there it says Hamburg forest. So it's the forest which has been decimated for the last 40 years. And hopefully, luckily, all the activism together and a little bit of political work and whatnot could stop this madness. So this part you see is still there, but because there are lots of problem with water not being there, where it should be, nobody knows if the trees will actually survive. All right, let's move on a little bit and speak about another way of activism. It's about moving to a plant based food. And I show you another small video, which is called in 20 to 30 years. So it's a video from five years old. So that's why I call it in 25 years, the world would be mostly vegan. So you could technically start today by at least reducing meat. I'm not asking anybody to start today to be young vegan myself. It took me two years after my father was ill from cancer, to start reading about it and understanding the problematics around cancer and what food had to do with it and whatnot. And then after two years of reducing meat, I became a pescatarian, which is basically only eating fish. And then after three months, I became a vegetarian. And for little under three months than three years. Sorry. And then I became a vegan five years ago. Animal agriculture contributes 51% of total global greenhouse gas emissions. It's responsible for 91% of Amazon deforestation, and one to two new acres are cleared every second. One third of all freshwater globally is used by the meat and dairy industry. A vegan can be fed on just one 16th of an acre of land for a year. A meat eater needs 18 times that much land. Waste and pollution from animal farms are an environmental catastrophe. This is why you can call us crazy and you can think like, oh no, I'm not going to stop on meat because this is so tasteful. And whatever. The fact is that at one point or another, it won't be possible anymore to eat as much meat as we do, for obvious ecological reasons. And if you think politics will solve the problem, it can. In some ways, at my level, I'm trying to fix some stuff, but not only in terms of food. I'm also bring to have lets space for cars and more space for bikes, for example. At the more local level, right now in Germany, the greens with the socialists and the liberals are trying to bring Germany on the target of 1.5 degrees. We are trying to phase out coal by 2030 without making nuclear longer because nuclear station power will be phased out next year in Germany. I'm happy to speak about terrium and all those kind of stuff, but I just think this is not the solution. And so in some ways it can. But if you think about the cups, we had 26 of this and I just don't trust it. I don't trust it because as Greta was mentioning, this is a lot of blah blah blah, build back better blah blah blah, green economy, blah blah blah, net zero by 2050, blah blah blah net zero, blah blah blah, climate neutral blah blah blah. Our hopes and dreams drown in their empty words and promises. They've now had 30 years of blah blah blah. And where has that led us? Over 50% of all our co2 emissions have occurred since 1990 and a third since 2005. If this is what they consider to be climate action, then we don't want it. They invite cherry picked young people to meetings like this to pretend that they are listening to us, but they are clearly not listening to us, and they never have. Just look at the numbers, look at the numbers, look at the facts. And most of those world leaders aren't listening to us. So one way to solve the problem is we will solve the problem. It takes some of us to go into politics, which is not always easy, believe me, in the way, I am pretty radical. So I have to do some compromises, which I don't really like a lot, but it takes of us to do some civil disobedience to. Look, if it wasn't for the activists in the Hamba forest since 2012, we wouldn't be speaking about phasing out coal by 2030 in Germany. Actually, up until three years ago, the discussion was still 2045, so we were going to phase out coal in 2045. Let's try to fix this together. And speaking of problems, there is this tiny it problem. It's like kind of the elephant in the room. You can imagine we are generating a lot of co2. There are a lot of things to fix, and can we fix it together? So let's try to fix it together. I give you a few tips. One of it is a search engine. We search all day long, right? We go like, oh, how do I convert a swift ui font to can ui font? Yeah, go for it on Stackervoplo and you'll find out it's a terrible enum thingy and then oh my Ruby version is not found. So my fast lane isn't working anymore. Or am I going to fix it? And how many engineers does it take to save the world? Well I dont know, probably not too many but at the same time a lot. So you get it right. We are constantly looking it up. And when I'm saying searching, looking it up you're probably thinking of a word in your mind. And this is my question to you. Are you still googling? You want to sell sugar water for the rest of your life or do you want to come with me and change the world? Come with me and change the world and stop searching and start planting, right. Stop using Google, use Ecosia. Some of you might know them. Ecosia.org, it's a german company which is being founded by this guy Christian Krell. As this german newspaper was saying, he prefers to plant trees instead of making millions. So what they do is you search the web with Ecosia and by the way they are based on bing, so the algorithm is not too bad. And if by any means you dont find what you find over there, you just click on another link and then you go to google just in case. Google is better, they generate money with ads just like Google does or bring does or whatever everybody does. But the difference is they do it with good ads. So by good I means they will never put you an ad for fossil fuels or for flying from Hamburg to Berlin for example. And they do some money out of it. And once they get the revenues, like the pure revenues, 80% of it, they use it to plant trees with partners. So it means they pay their people, they pay their computers, they pay their servers or whatever. And the money they still have, they use 20% of it to make the company a little bit richer, so to say, so that the company can grow a little bit, but 80% of it, they just plant trees. Tune your code. And if you think, or if you thought that this talk was going to be only about this, then you were obviously wrong. I give a talk about this at least at iOS devs UK, but I think at other conferences as well, which is about optimizing your code. This is very specific in this case to basically Xcode and iOS, which is the tool in which you guys watching this video are commonly using. One thing you can do over there is you can use the gadgets and see basically what's the load like. You see you're using 30% of location, so it means what are you doing all the time with location and Whatnot? Yeah that's one thing. The other thing is related to that. If you go in your iPhone, in settings battery, for example, this is basically were users go if the battery is draining. Right. So you really dont want your app to be in this list because it's kind of like the losers list at the same time. It also means that if you are over there, it means that your app is well used by the user. Right. So to give you an example on those two screens, the top app over there, which is Tiger show, is from the first channel in Germany from IRD. So I use it a lot. But what's interesting is that it's kind of weird that it has been draining 27% of my battery. What's even more weird is if I go to the next screen is you will see that it has actually been only used 18 minutes in total. So it's really not a lot. So I wonder what was wrong over there. Right? And so you have to have a look at this. And actually I hope that not only you as a developer, but you as a user, look at over there or in macOS you have the same thing. Look over there on the top bar, what kind of app is using your better and just report to developer, say to the developer what's wrong? And so yeah, that's one of the things you can do. The other thing you can do is run 100% renewable energy, whether it's your app infrastructure or your company or whatever. The best case is to have your own pvs photovoltaic like solar panels. That's what Ecosia do by the way, they run all their business renewable and they generate actually more than 100%. They generate I think 200% or something like that, or 250 whatever. And if it's not possible to have your own pvs, then run from 100% renewable energy provider, right? If you have to go from the grid. But please don't pick a mixed company. And by mixed company I mean like for example RWE in Germany, this big bad company which has been digging holes. Sure they have green products, right? But yeah, that's not the idea behind it, right? Sure you can probably order your vegan food from Amazon, but that's also not the idea behind it. Right? And so speaking about apple, apple goes were carbon neutral. They go on their website, if you have a company you should do something. But my point here is carbon neutral is great, apple, but it's not enough. It's just not enough. You should be 200% renewable and they should say, hey, we're carbon negative. And actually apple just for you. I made you a badge that you can put in your website. Let's try to fix this together altogether. Right? Right. Another thing, go vegan again. But I'm not specifically saying that to yourself. But I'm also more your company. You don't have to become yourself vegan from a day to the other. But what if as a company you would say during lunch like Ecosia, you wouldn't have any of those products. If you offer lunch, it's actually pretty easy and it's actually better for the environment because fruits belong to startup anyways, right? So if you just have fruits and add lots of fruits, people eat fruits so they will eat less of the other stuff during the day. So that would be one thing in your company. You could also go plastic and packaging free. Why not? In case you order pizza for example. That's just one of the example. There is this website called order Green, I think it's only in German but you get the idea. And they basically made this reusable packaging. If you want to have a vegan pizza, a lot of pizzeria they dont have it. Just take the vegetarian pizza and ask them to not put any cheese. Offer breakfast at your company would be also a way to go kind of packaging free. Because if you have like cereals in ten kilo packages we buy at home, for example, a lot of our stuff, whether it's pasta or cereals in big ten kilo packages. We're a big family of six people. So we try to generate less plastic and use, please use ceramic cups, not plastic cups. And stop grabbing a coffee with something you have to throw away. If you want to grab your coffee in the morning, then have your own cup, even if it's a plastic cup. Obviously it can be. But the one you reuse all the time, right? And finally go out to eat with the company because when you go out at lunch there is a big chance that you are actually producing less crash, right? Because call of those companies, like all of those restaurants for example, they just wash their dishes, right? Also we need more home office, it's less cost, right? But it's also less traffic, it's less co2. So less people taking their cars or whatever. The downside is that each one is taking their own decision, for example in electricity wise. So even if your company has a green provider, you cannot be sure that the people that are working for you at home have their own green electricity. Write them an email and say hey, we are happy to be 100% renewable at the company. But would you want to help us do the same thing at home. Maybe you can even strike a deal with some electricity company. I don't know. If you're a big company enough, you can have a rebate. The upside is that it's also way better work life and family balance. I've been working myself remotely since many, many years. And really, I don't know why I would want to go back to regularly, at least to the office. My current company, to give you an example in terms of the cost, has an office, or we are about to change the office and the new office will have room for 35 people. The thing is, until we move over there, we will be 70 people, right? So you're getting it so it years that we will have a system where you have to kind of say, register when you want to go to the office. If you absolutely have to go to the office. Are you walking or are you biking? Right. Call. Right? You're not neither. But you're taking the train, right? You are taking the train. But worst case, you have an EV, right? Like an electrical vehicle, like battery powered. And my car is 100% based on renewable energies at home. I'm really happy to speak about evs. I've been driving an EV since three years. Way better is to use the train and way better is to use the bike. Or if you can walk, it's even better. Try to reduce or quit flying. It's been three years. I'm fine with it. I haven't been flying anymore. I'm sure at one point in the future I will have to fly again for whatever reason, but I'm trying not to. Even when I was, for example, going to iOS devs UK, which is in Wales, which was a long trip with the train, basically the whole day I took the train. And it was interesting. You see a lot of years and you can work also longer. Online conferences are great. And otherwise, like I was telling you, just use the train and please stop going for a company weekend in Mallorca if you are a german company or whatever. And generally please stop going because it's cheap. Don't go into this thing like, oh, it's cheap. So I'm going for two days trip in Majorca and over there I'm going to do some nature mountain biking. It's ridiculous. Make an app that does good for the world, not just the next useless app. Be that CEO, the one that cares about the world. If you can start a company like sonomotors, for example, they are working on a solar powered car which will hopefully see the light of the day in 2023. Right now prototypes are there and they started their company with the idea of not selling a car to every single person, but sharing the car with other people. For example, it's weird to start a company, a car company to have lets car, but that's one of the goals they will most probably achieve. And it's a mess out there so there are many problems to fix. Keep it small and so you generate less co2. Use the inspectors like the network's inspector seeing to see which part is that you will probably discover that there is like a four megabyte pictures over there which could be actually six hundred k. Do you really need that 100 megabyte video on the front page? Probably not. And also please don't do autoplay. It's not only bad for the environment, it's also bad in terms of user experience because I don't want to go on a website having a video played on my face. The iPhone, since the iPhone X has been using an OLED screen, we still don't have older on the iPads and still no OLEDs on the Macs. That's too bad. So really you might notice, but a dark pixel on an older screen is actually not turned on. So it's sparing energy. Turn off your tv, use a power switch. Automatic updates is the thing that I will show you now, which is that if you look over there, what you can see over there on the top, I turned off the automatic app updates and apps for whatever reason. I have music over there and books as well. So it means that every time that I will download a music on one device, it would download on the other one. I'm not sure how old the screenshot is, but definitely when I install an app on a device, it won't install on another device because this is not what I want. And also the updates. I know it's kind of weird, but one of the thing that I like about doing the updates myself, besides the fact that I don't want to have to update some of the apps every two weeks, there are a lot of apps out there like Facebook for example, which are basically working in this sprint update thing. Like every two weeks they will release a new app and so I don't necessarily need it. But the other thing is, I realize a lot of time, oh, this app, I haven't been using it forever, so I'm just going to delete it. Stop. Now I really, really have to stop. And this is why I'm really happy I'm saying Shukran here, which is thank you in Arabic. You can find me over there at Seth MC on Twitter. I'm on Instagram as well with Seth MCM, and this is my email if you want to get in touch with me. And now I am really, really more than happy to speak with some of you in the Q and A's.", "words": [], "utterances": null, "confidence": 0.95398780315516, "audio_duration": 1482.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Manuel Carrasco Molina is a developer and a political activist. Has been active with the Green party and in the city council. Has written a book about building privacy into iOS and OS apps. Hopes to spread the good message about our privacy.\n- The video goes for another, like, in total for 14 minutes. They were fighting against the next problem, which is gas. Hamburg is the biggest polluter in Germany. The forest has been decimated for the last 40 years. Hopefully, luckily, all the activism together and a little bit of political work could stop this madness.\n- In 25 years, the world would be mostly vegan. Animal agriculture contributes 51% of total global greenhouse gas emissions. One third of all freshwater globally is used by the meat and dairy industry. If you think politics will solve the problem, it can.\n- Stop using Google, use Ecosia. org, a german company which is being founded by this guy Christian Krell. Once they get the revenues, like the pure revenues, they use it to plant trees with partners. Tune your code. This is very specific in this case to basically Xcode and iOS.\n- You should be 200% renewable and they should say, hey, we're carbon negative. Another thing, go vegan again. Offer breakfast at your company would be also a way to go kind of packaging free. The downside is that each one is taking their own decision, for example in electricity wise.\n- Try to reduce or quit flying. Make an app that does good for the world, not just the next useless app. Turn off your tv, use a power switch. Stop automatic updates. Keep it small and so you generate less co2.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.06, "text": "next year", "timestamps": [{"start": 562228, "end": 562606}]}, {"count": 26, "rank": 0.05, "text": "years", "timestamps": [{"start": 58778, "end": 59118}, {"start": 65028, "end": 65214}, {"start": 71880, "end": 72210}, {"start": 80248, "end": 80454}, {"start": 81948, "end": 82134}, {"start": 88172, "end": 88374}, {"start": 122312, "end": 122658}, {"start": 198576, "end": 199178}, {"start": 205940, "end": 206558}, {"start": 252612, "end": 252814}, {"start": 257684, "end": 257914}, {"start": 404756, "end": 404974}, {"start": 441372, "end": 441622}, {"start": 442608, "end": 442794}, {"start": 445168, "end": 445354}, {"start": 456132, "end": 456622}, {"start": 468808, "end": 469090}, {"start": 480092, "end": 480294}, {"start": 481788, "end": 481974}, {"start": 599440, "end": 599722}, {"start": 657476, "end": 657694}, {"start": 1186076, "end": 1186342}, {"start": 1208948, "end": 1209374}, {"start": 1241628, "end": 1241882}, {"start": 1250768, "end": 1251242}, {"start": 1271110, "end": 1271522}]}, {"count": 1, "rank": 0.05, "text": "last year", "timestamps": [{"start": 91212, "end": 91666}]}, {"count": 2, "rank": 0.05, "text": "mixed company", "timestamps": [{"start": 962884, "end": 963362}, {"start": 963768, "end": 964660}]}, {"count": 1, "rank": 0.05, "text": "other people", "timestamps": [{"start": 1331612, "end": 1332054}]}, {"count": 1, "rank": 0.04, "text": "young people", "timestamps": [{"start": 614298, "end": 615006}]}, {"count": 3, "rank": 0.04, "text": "things", "timestamps": [{"start": 251424, "end": 251546}, {"start": 679064, "end": 679186}, {"start": 925700, "end": 925778}]}, {"count": 18, "rank": 0.04, "text": "example", "timestamps": [{"start": 264068, "end": 264638}, {"start": 336268, "end": 336886}, {"start": 380652, "end": 381240}, {"start": 541488, "end": 541818}, {"start": 778988, "end": 779414}, {"start": 855028, "end": 855550}, {"start": 873768, "end": 874338}, {"start": 965928, "end": 966114}, {"start": 1058004, "end": 1058222}, {"start": 1059188, "end": 1059662}, {"start": 1088940, "end": 1089162}, {"start": 1132748, "end": 1132934}, {"start": 1147728, "end": 1147962}, {"start": 1193968, "end": 1194250}, {"start": 1261108, "end": 1261342}, {"start": 1311044, "end": 1311600}, {"start": 1332268, "end": 1332838}, {"start": 1439868, "end": 1440440}]}, {"count": 1, "rank": 0.04, "text": "more home office", "timestamps": [{"start": 1136652, "end": 1137638}]}, {"count": 12, "rank": 0.04, "text": "app", "timestamps": [{"start": 236732, "end": 236934}, {"start": 861988, "end": 862126}, {"start": 870632, "end": 870786}, {"start": 876152, "end": 876354}, {"start": 918168, "end": 918306}, {"start": 930892, "end": 931190}, {"start": 1300448, "end": 1300634}, {"start": 1305946, "end": 1306654}, {"start": 1403174, "end": 1403526}, {"start": 1418968, "end": 1419202}, {"start": 1446272, "end": 1446810}, {"start": 1453652, "end": 1454190}]}, {"count": 1, "rank": 0.04, "text": "total global greenhouse gas emissions", "timestamps": [{"start": 485596, "end": 488222}]}, {"count": 9, "rank": 0.04, "text": "Germany", "timestamps": [{"start": 57668, "end": 57946}, {"start": 355988, "end": 356634}, {"start": 364068, "end": 364666}, {"start": 545344, "end": 545734}, {"start": 548848, "end": 549366}, {"start": 562724, "end": 563210}, {"start": 655044, "end": 655626}, {"start": 880668, "end": 881026}, {"start": 966984, "end": 967246}]}, {"count": 2, "rank": 0.04, "text": "lots", "timestamps": [{"start": 420872, "end": 421038}, {"start": 1044464, "end": 1044806}]}, {"count": 1, "rank": 0.04, "text": "many problems", "timestamps": [{"start": 1342768, "end": 1343210}]}, {"count": 1, "rank": 0.04, "text": "renewable energies", "timestamps": [{"start": 1235788, "end": 1236674}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}