{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/7fc0e9ee-f8df-4759-a81e-237155559436", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["advances", "conf fourty two", "cuttingedge", "experiencing", "from", "growth and gtm advisor", "llms", "models", "progress", "revolutionizing", "sectors", "strategies", "transformed", "unleashing", "venkata sai chaitanya gatreddi"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "f0217bcf-4de8-4ac2-affd-11856e00d1ee", "status": "completed", "error": null, "text": "Hey there. Hi. So, let's get started. So, my name is Chetanya, and based out of London. Today I'm gonna discuss the way, how we leverage relentless marketing. We're gonna discuss different aspects, how do we measure conversion rates, leverage data to do certain actions. Uh, we're gonna understand the whole scenario. Many might have had talks about people talking about building an LLM or maybe fine tuning them. Yeah, but those are concepts which are around. But leveraging LLM in marketing is something which I haven't thought of before, according tweaked with AI and stuff like that, and probably wanted to learn more and then figured out there are ways where I can improve my marketing conversions or bring in more revenue, understand more data by using certain tools like Big ML or maybe Amazon party. We're gonna discuss all of this, but let me deep dive into this now. So today's agenda, we want to talk about introduction, a brief history, introduction to web elements, the layers of generative AI optimizing metrics. How do we, how marketing change with AI, building your own LLM with Amazon party rock, and maybe other tools like that. So let's know each other a bit. Yeah, think. Had a good understanding of AI and things, and I was working with the company called Writesonic. I don't know if you guys have heard of it, but it's one of the fastest growing AI tech companies joining the company, the initial first few employees. It's. I didn't have any reference on how to grow the product. Right. Since AI is a new industry, we couldn't really understand a lot of things. But, yeah, be made of me. I was able to grow the company at a good scale, generating our $9 million in about a year. Previously to that, it was mostly leading growth marketing and product marketing functions in various tech companies, mostly cybersecurity, deep tech AI. Yeah, that's pretty much partly, yeah. Let's deep down now. So what's an LLM? Right. I think the different definitions and different forms of LLM. But to keep it simple, let's imagine LLM as a bunch of data, bunch of unorganized, unscattered data, where it's sitting in a maybe, let's say something like a Google Drive. Right. So how do we leverage this data is by building a problem set. It's building a solution and optimizing the solution. So that's how I look at defining an LLM. And there are different, like, fine tuning, optimizing. We can do 100 different things. The core depends on how, what data you have, how do you acquire the data and what are the other forms of data? Yeah, probably database. Now we can look at it, right. I think this is a key in building in code LLm or the best LLM. Now let's look at the layers of generative AI and then like to understand the technology stack and. Yeah, bits and buttons of it. So when you look at the layers of generative AI, you see applications fine tuning, foundation models and infrastructure applications. Right. So a drive sonic. We had our own llm, which is open sourced llm. We found shown that we released in a product called as botsonic with an open API and people were able to use it. So that's an application level use of LLM and how we could use buildings on top of an application or an API using different tools and techniques. Then let's look at fine tuning. Let's suppose we have a data of next, which was not really accurate. Maybe you're getting, trying to give some input to it and output is not what we are expecting. In the instance like that, you try to fine tune things and you trying to optimize things and you try to get more relevant outputs. Next, let's go to the foundation models. The market for the foundation models is really huge. A lot of companies who are working on fine tuning, pre training, optimizing these models. So I would see adopting decision models would change before and after a few years. Think right now we're at the pace where we're able to see more foundation models with rapid data sets. The last comes the infrastructure, like for running this use, application, using OpenAI or whatever, hugging phase and all of that. We need large infrastructure. You heard about Nvidia, Nvidia going into this direction. And probably all of this needs a heavy lifting, probably a good retro lifting. That's what I would do. Let's go back and look at the technology step. You see the technology at the current state, I mean, not at the current state. Technology is always evolving, right? And you see what you see today and you don't see after a week or couple of months. So, which means that we need to adapt according to it. Consider the amount of data and the amount of things which we need to think through when you're building a last language model. So now doubling that every 3.45 to ten months is, yeah, pretty much a hard job. I've read reports where the cost of carbon emissions and therefore the central conditions we need to maintain the temperature in the data centers. We need to make sure that there are no halls with extensive emulsion of different, different emissions and keeping at the right things in the right place is an important place in an important place. Now let's get into the actual customizing market efforts through LMSFO visual engagement. So when we look at, when we looked at how do we leverage AI in our marketing efforts, right? So we're working with a company called as mixed panel, which was pretty much has a more sophisticated technology and they were able to pull out data and where I could search certain things on how I wanted to see measure things between. Usually at this point, before the eye, we're able to go to Google Analytics or pretty much other tools like that, select a date and look at a conversion rate. Right? But now we're able to ask tools, hey, what was my conversion rate between this and this? What, what was my conversion rate of an ad campaign? So to get more inaccurate, accurate data with different forms of data, similarly, we're able to measure things like conversion rate or analysis and customer segmentation. Let's get a bit detail here. So let's say conversion rate, improving the conversion rate is where we use data to understand what's working in. It's not working. Then we measure this in form of ROI. Could be a payback period. Like I spending to $100. How much time will I need to keep running my campaigns to get hundred dollars back? And how much profitability, when does my profitability start? Takes three months. So that's what we do. And then customer segmentation from the customer segmentation using AI, we were able to personalize segments of marketing, personalized marketing strategies. I was able to personalize certain campaigns where I know that, hey, this guy is from us, this guy is from India, some other person is from UK. And we're able to have different messaging for all the different people, so on and so forth. Yeah. And that was one of the key changing things of personalization where we could do so many things in terms of personalizing with gifs, images. Yeah, I think the world keeps going on there. Use cases. So let's talk about the use cases for marketing. So one thing we previously discussed, like searching for data, you have one or two branch numbers, probably for me as personal, I hate Excel. Yeah. Can manage with Google sheets and all of that, but probably not a big fan of Excel. Then there are situations where I had to struggle, use other tools and pretty much it's a hard job for me, but with AI, I was able to crunch numbers, create formulas, create calculations, lot of things. So the tools like sheets, AI, which makes this job pretty easy. So kudos to the makers. Then let's talk about sales intelligence right here, you probably seen tools like Gong, which were adaptable in terms of understanding what does it sell. So, to give an instance, right, you could tell a number, talk to a customer saying that, hey, I saw that you signed up on my website and I wanted to understand more about what you're looking for. Then Gong will understand his reactions and analyze and understand those, and gives you word cloud and gives you the sentiment where you're doing better in your pitch, where you're doing bad and compares with your other teammates calls. And that's probably what are we looking at and how things are changing. Last one would be data analytics, where from asking your customers what you're doing and start saying why they do it. So you can see that, hey, conversion rate improved of x, which means that this change, which I made a week back, is coming today. So use that for a similar way. I mean, these are not the two or three use cases. There are different use cases. It depends on how we look at it and how we probably look at building it into our workflows and systems. So let's. Now let's. So there's a tool called as bigml, where you can load your own data and analyze things, and there are different sources. It's a mix of a machine learning model. You can also look at building your own alum and analyzing and building multiple distribution. Right. So I have different data which have already uploaded in the past. So that's while we do, we train some data and. And also let's look at this one. So if we go back, oops, yeah, this one. So how all of these details where I can take some different parameters, like add name, campaign name, placement optimization into the consideration. Now, multiple things. All the things which you see in an ad group. Right. Now I also see this one, CPa. I'm just putting weight as three, create fusion, some issue with that model. But let's get into this. This is like, based on reviews, we're able to see the importance of a review or 54 instances. It shows me an error rate of 4.815 and unexpected error. Now, this is one. Let's go to models. And you have associations, topic models determine this, but let's do this. So this is another data set where I wanted to figure out the branching grouping of different keywords in those ad campaigns, where top terms, you can see the commercial terms like this, and you can also see the probability, rent and topic probabilities. Now let's go to domain. Let me try again. Yes, got it. So now I have this amount of likes which generated repeat followers. I can see the instances of impressions and then how the overall campaign is looking at it. Let's go back and then now we see it instances like video views, ad name which are probably secured data set for me. So we'll just see number of pair like cpms are less than this is an average different different averages. So this gives me clear understanding of how my campaigns are going. Probably third base and we could able to predict lot of things using this data. So let's play around that. Also see video is at 50% three videos less than 50% at two Ctrl expected azure traffic instances CpC cpl yeah, that's what it is. So considering the time, we won't be deep diving into all of these links, but I would be sharing these links with you personally where you can play around and tweet things. Maybe figure out a better way to do Dhanmi. So let's wrap it up with challenges in this whole LLM navigation. One I see is adaptation of is hard. Getting a buy in where we say someone is using one wants to get an open source. One will conclude on points where hey, is it safe? Is it, are we leaking up any data? Are we getting a third party data or what are we training it for? Navigating the privacy regulations in the customer trust is key, so we need to educate people about how privacy could be maintained. It's a narrow game, but still the best to figure it out. If you have any questions, drop down your questions in the comments and you can also connect with me or LinkedIn. That's all. Thank you, bye.", "words": [], "utterances": null, "confidence": 0.880448638718793, "audio_duration": 1205.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Chetanya: Today I'm gonna discuss the way, how we leverage relentless marketing. How do we measure conversion rates, leverage data to do certain actions. We're gonna discuss all of this, but let me deep dive into this now.\n- How marketing change with AI, building your own LLM with Amazon party rock. I was able to grow the company at a good scale, generating our $9 million in about a year. Previously to that, it was mostly leading growth marketing and product marketing functions.\n- When you look at the layers of generative AI, you see applications fine tuning, foundation models and infrastructure applications. Technology is always evolving, and we need to adapt according to it. I would see adopting decision models would change before and after a few years.\n- LMSFO visual engagement uses AI to personalize market efforts. Measures things like conversion rate or analysis and customer segmentation. Uses data to understand what's working and what's not working. Then we measure this in form of ROI.\n- With AI, I was able to crunch numbers, create formulas, create calculations. Tools like sheets, AI, which makes this job pretty easy. There are different use cases. It depends on how we look at it and how we probably look at building it into our workflows.\n- Getting a buy in where we say someone is using one wants to get an open source. Navigating the privacy regulations in the customer trust is key. If you have any questions, drop them in the comments.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.08, "text": "different data", "timestamps": [{"start": 828544, "end": 829136}]}, {"count": 1, "rank": 0.07, "text": "different tools", "timestamps": [{"start": 332324, "end": 333260}]}, {"count": 1, "rank": 0.07, "text": "more data", "timestamps": [{"start": 92658, "end": 93474}]}, {"count": 2, "rank": 0.06, "text": "different forms", "timestamps": [{"start": 213732, "end": 214580}, {"start": 559900, "end": 560824}]}, {"count": 1, "rank": 0.06, "text": "different use cases", "timestamps": [{"start": 790730, "end": 791682}]}, {"count": 1, "rank": 0.06, "text": "different keywords", "timestamps": [{"start": 988694, "end": 990274}]}, {"count": 1, "rank": 0.06, "text": "certain things", "timestamps": [{"start": 527998, "end": 528886}]}, {"count": 1, "rank": 0.06, "text": "different sources", "timestamps": [{"start": 815632, "end": 816368}]}, {"count": 1, "rank": 0.06, "text": "different aspects", "timestamps": [{"start": 41262, "end": 42994}]}, {"count": 1, "rank": 0.06, "text": "leverage data", "timestamps": [{"start": 48054, "end": 48990}]}, {"count": 1, "rank": 0.06, "text": "more foundation models", "timestamps": [{"start": 395610, "end": 397994}]}, {"count": 1, "rank": 0.06, "text": "different messaging", "timestamps": [{"start": 633876, "end": 635144}]}, {"count": 1, "rank": 0.06, "text": "secured data", "timestamps": [{"start": 1069896, "end": 1071312}]}, {"count": 1, "rank": 0.06, "text": "data analytics", "timestamps": [{"start": 762356, "end": 763584}]}, {"count": 1, "rank": 0.05, "text": "deep tech AI", "timestamps": [{"start": 196744, "end": 198560}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}