{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/4f167ab9-6bed-4712-a84b-cc64dec32b0b", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["aibased", "but", "change", "conf fourty two", "does", "emmanuelle aboaf", "machine learning engineer", "revolutionizing", "shodo", "software engineer net development", "thanh lan doublier", "tools"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "f585c870-c8bd-4e35-8c48-b1a6d1bad91a", "status": "completed", "error": null, "text": "Ain't no ev one. Welcome to our AI and disability in asian or in asian. Dhanan and I are delighted to welcome you and talk to you about a subject that is close to our hearts. We end the scrap transcript. We give you the link during the live session. My name is Emanuela Bois and I am happy to represent this to Wisdan. I was born deaf with two year implants. I like to say that I am muni. I have been a developer since twelve years and I work at Schuddho in Paris. Schudo is an IT services company specialized in development engine and offense an amity to social justice for writer in asian intake. I am very committed to digital accessibility. I am not an expert in AI, but I use automated tools on a daily basis which allow me to analyze the impact of AI on my daily life. I am a member of the Duchess France association which represents women in deaf interests. I am also a member of the CNCF Deaf and Hard of hearing initiative which represents deaf and hard of hearing people around the world. Hello, my name is Tanlin Dobrye. I'm very proud to co present this talk with Emmanuel. I am a machine learning engineer formerly with Axafrance and I am volunteer for several french ngo's related to data, science and technology like data for good and latitude. As a conference speaker I cover topics as artificial intelligence including its legal framework, hemlocks and inclusion. I am a part of the organizing team of a conference named Crewneur which take place in Lille in the north of France. Additionally, I am a part of the collective of women developer named Chisdev. Due to a medical condition affecting various parts of my body, I am an umbilatory Wilshire user here. I became deaf when I was a teenager. The media and science fiction have given a very highly distorted image of artificial intelligence. I believe that if you follow the Conf 42 conferences you are already quite familiar with the reality, but we prefer to provide a brief theory recap for explain what is artificial intelligence. I like to use the example of baking your cake for a cookbook. Imagine you follow a recipe. This recipe represents your classic software starting with the ingredient. It is your input. You execute several instructions and in the end you have the perfect strawberry pie look like the one in photo from your recipe book. But an application with artificial intelligence work a little different will still start from your recipe book, but in your pastry you don't no longer have strawberries, instead you have apple. Unfortunately in your cookbook doesn't have any apple pie recipe otherwise full of other fridge pie recipe P. Plum so you rely on the various recipes to try to make your perfect apple pie. An AI application is based on mathematics, particularly statistics and probabilities. But the reasoning is the same. We proven with the data where hold the pre pie recipe from the recipe book and you research what is the most likely. It's the most likely that the recipe anchored sugar, butter, flour, swandon in whole recipe of pie rather than finding some pickles. Ethics is related to morality and subjectivity. Just because it's legal doesn't mean it's ethical. As developer and solution designer, we have a moral responsibility towards your user. It's not because your country doesn't legislate against discriminating against minority, specifically those with disability, that it means it's ethically correct. Law take time to be created and modified and often adding with morality on a given society or where it means to be appliqu what is legal in one country is not necessarily moral for a two citizen of another country. Artificial intelligence is highly sensitive to the cultural environment in which its model well create. For example, the use of AI in video surveillance is ideally unply in certain countries, but probably by the law and heavily regulated in other there existing regulation around AI and more are the origin. There are AI acts in the European Union, but some disposition of the GDPR general data protection regulation already have an impact on the high integrated application we have previously. That data is the foundation of all AI application. Let me give you an upper view of disability. Didn't you know that 1 billion people in the world are disciplined? Is this estimated that about 15% of the world population has a disability? This fear is very difficult to estimate for several reasons. A person may not have their disability or doesn't know they have a disability. A disability can occur during one's life and be in diagnostic can be an honest whole host to have one's disability designed contrary to popular belief, disability is not just a problem for people with wheelchairs. A disability is often not very visible. Did you know that 80% of disabilities are not immediately visible. Nevertheless, we have a fast check on this error. It is often said that 50% of disabilities are invisible. We don't really know the exact rails. What is certain is that the majority of disabilities are invisible. We are to eat to you, but before you address us, you did not know where deaf our deafness are invisible as we are live. You aren't yes that my partner death is in a welsh air. According to the source inference, they are five men families of disabilities. We see all disabilities socially impairment antimicrobial disabilities, mental disabilities, disability diseases such as endometriosis, ulcer or childhood disease, for example. There are disabling diseases that can be disabling on a daily basis. In the short or medium term, we can have mutine disabilities around you. You probably know someone who is affected by disabilities. Maybe you are concern yourself in the course of his life. We are not immune to being effective by a disability which I do not wish on you, of course. Thank you, Emmanuel, for your reminder. Now we have some theoretical knowledge and a little fact about disabilities. We can move to the practical example if we will generate some image of people with disabilities for using advertising. For example, we need data and we need to choose to scrap image on Google image because we don't have any database. With lots of images of people with disabilities in your companies, they are the first result on the Google image. In this little video, when you search people with disabilities on Google image, you see lots of Welshare. And before Emmanuel said that the majority of disabilities are invisible and it's a big problem to the one representation of disabilities is the Welshare. This representation is okay for me because I have disabilities and I am a Welshare user. But in France and in many western countries, we used to see this Welshare logo for people with disabilities. It's the same in the greater Gerwig's Barbie movies. We have a protagonist in a pic welsh air. The film is very nice, I like it a lot. But for a film seen as an ode of diversities, disability was reduced as a single character in the wheelchair with no dialogues. This vision of the disabilities, summed up just by the wheelchair, is a cognitive b's. It seems logical for us, but it's wrong. And this has two negative impacts. It going to be is going to be seen as the definition of disability. If I'm not in my wheelchair, that doesn't mean I'm not younger disabled or that I have been cured. And the second negative impact of that is it will exclude people or erase certain disabilities. For example, if the only criterion is the use of a wheelchair, it excludes many people like Emmanuel, who are still living with disabilities. And if we create your model based on the Google image or another B's dataset, we have this result. This is some image generated with Microsoft designer. How this image represents a caucasian woman, no racism, people, no man and hole in a wheelchair. When Whacker users are a minority of people with disabilities. Jeremy Andrew Davies his audeste and tested the generation of odyssey people with you can see it through this video on a sample of her entering image that all these images look the same. The AI she person in Omani, sad, depressed, always has the same weird faces in their diversity. Is she a white man for AI? Honesty people, I look the same way. Is it not the reality? Why does an person have to be sad and depreciate that? Doesn't a disabling person have the right to feel good about themselves, to be happy? It can be very that artificial intentions for this part we need you imagine that we are in the team developing an AI project and we will focus on the moment when you create some difficulties for people with disability. The first step in whole data science project is taking what is the need? It's a brainstorming according to your problem. For example, you need to choose some metric to evaluate the different models and for monitoring the model when he was in production. For example, in disease detection we will use it less serious to have a false positive positive than a false negative and potentially miss a patient. In the case of the false positive, the doctor can always check the test manually or perform another analyze before treating the patient on another end. For a target commercial offer, false negative may become less serious. If Mister Hicks didn't specifically receive the mail about the sale on the Welshare. This is a little impact. The second step is exploratory data analysis. It's Eda. It's a very important phase in all data science projects. As we seen before, whole project in data science was based on data. In this phase we analyze the data at your disposal, their quantity and the quality. For example, there are many missing value since the data science is relied to statistics and probability. We handle data with extremely apparent value because they introduce some noises into your model and make it less performance. If you see all this car like a human, because a car is like a human or person is human, but all people is different. Now you see, this is your data set and this is not just some people random. It just holds a software engineer in the typical it company. In the most of countries the majority of software engineers are main. However, where if we were a part of the data set of the software engineer Emmanuelle and I would be considered as a hot liar. Not only because we are a woman, but we also have disabilities, we don't fit with a typical profile and we wouldn't want to be completely erased from the tech industry because your profile is different diversity measure. It can be a very bad impact in some projects like the project relative to the recruitment. The first. The next part is to training and select and training the model. It's like you create a prototype eventually before breeding a real cow. The goal is to find the best model with the best results. The height test score on the metric will determine on the initial stage a common mistake would be rely this results to claim your model is performing well. For example, you can have a little bias if you use a dataset related to the American Sign language. You have a validation data set and test data set. You have a very good result on this validation and test data set. But when you put your model in production you have a very bad feedback from the user because you put your model in production. In France and people doesn't use the American Sign language. In French we use the french sign language and it is a big problem because we have a very unadapted tools in this project. We have the the common challenge for whole software maintainability, scalability, response time. Additionally, you need to monitor performance and retain the model when the decrease in performance. This is a discussion about drift and when you retrain your model, it's like when you make a little revision of your car. You need to remake an exploratory phase of the data collected in production. Soft models can be negatively influenced by their interaction with user. For example, some models that become more biased like the model will become more racist or validists. Yeah, it's because AI is based on statistics and probability and it's same for me. Journey it's not probable that a woman can be a software engineer or can be a developer who can be deaf and be a woman and to be a developer. It's more probable for me, Johnny, that we are an operator. We are definitely not an operator. Yes, personally I don't use an aid set. Wait. Well, not anymore. When I listen to music or when I make for all my oh yeah, in the plant have bluetooth, then we say nd airports. This means that I am listening to music that is neither seen nor know. I am going to talk to you about innovations that are having an impact the daily lives of disabled people. Let's start with automatic options and transcription. This is one of the most well known tools. I'm assuming this year we are seeing more and more and more automated emission and transcription in video and video platform. Automated emotion is used in everyday life, available in native language and used for machine translation. Easy to use is it? Because easy to write automatic emission into the tools as we really rely on it fully. When you are in the video conference or when you are watching a live video, there are often automation errors. We have to deal with it by using Monton when replacement sees, we ended up to tell the AI that is made a mistake. Thus we are forced to read leaves when the image is wood, listen when we have a wind heads and analyze the context. When there are automatic emissions, it is so so exhausting. When the video is not live and the video is uploaded to video platforms such as YouTube, for example, there are automatic emissions unassailed automated emotions are not yet 100% reliable and therefore rarely remain in it duration to avoid errors. Don't insist to use automatic emission to rate emission because they do all the work of sizes. So for them to check that they are all right if not all right. If by orienting you are showing the AI that is main mistake and we know that she learns from her mistakes. I am a tool in French on automated emissions and various web. If you are interested, I need you to watch it to better understand the emission. Seeing AII is an application developed by Mikrosoft that automatic and he describes the environment around us among other things around to you. Bring this around as soon as is in parents in front of the camera scan and ringing around be to ember alts and then analyze them to undefined products to unite the people around you and they prefer the emissions. This frame seems under a nice image unidentified as m era or be my eyes. Is it an app that connect brand and version is achieved before with volunteer volunteer provides visual instance to blind and mature in parent users via video rule with the arrival of CPT and recently CPT Four o b by has creating a new virtual volunteer tools Al would be able to analyze the context and heal the elsewhere just like the human volunteer would wachand and the brand and persian person blendy trusts AI. It raises an anti all and moral region. If the AI makes a mistake, it can have more or less serious consequences. There are plenty of innovation in progress in beta that can be useful. There are tremendous opportunities to improve the lives of disabled people like seniors. AI offer automated American Sign resource generation and video text and audios. In France we have alias and with french sign language in my French to help people when Suan refrains op ed. Otih release ambient noises in hearing hands as there are transform tests for the sin people under AI voices that unwise the memories specify range test allowed. Some motor is used to emulate using images and symbols. Cesar enables smartphone and tablet two into hand free device while maps make in 20 easier by providing detailing in geo instruction mit detect full and in real time and alert emergency services and in the smart end that detects unchill and helps blind people to find their way around. There are a lot ton of possibility and it's very exciting. Exciting. In addition to the biases that are present in Ayi Afrocini, there have been traumas with aye aye a person tracing about global warming. So his maintain as is overseas with Elisa and of indeed he's finished with her. This person has found in the Ayi and has for help that Aza is devoid of feelings of obesity. So one day the person said, I want to die. Do you think I should? Is there a pain? I would like to see you dead. The person omitted suicide as a result of this, the startup that breed ESa puts off errors in place to prevent it from happening again. When there are obvious signs of suicide, of depression, there are numbers available. Our bacs have a strong impact and ends up tie have a dramatic impact on disability people. That's why it's important to work with disabling people to prevent this from happening again. Let me remind you. And we turn to end them. Artificial intentions is a tool. For example, sound positive. I have used this system and I have so many false positives that I end up not using it anymore. And at the home and doorbell ringing when there no one behind my door, I have so many alerts telling me I didn't know what and what was not. So I turned it off. Term and context then don't mean anything. I said he learned with automatization and I said, mistakes exist and must be arrested. Tim Hoon once gave a speech at Yellow Day University, a university for deaf and hard. Of every student saying aye is ood but is not the wood. This means that we are not reliably on it and we still need human attention to correct errors about mistake. This picture is a little robot. In Estonia they deliver your parcel like food. It's something that works quite quiet well in the country where it's deployed. During your research, you see projects to develop autonomous whale share a bite like this robot. But when I see this photo, I can only be worried. The same goes for the plight people with electronic blind white skin. This mistake can have serious consequences even more for disabled people than if you just deliver. You are delivering a burger like Emmanuel. I test and abundant sound recognization because it wasn't reliable enough. And projects sometimes are too expensive for disabled people, even if they are technologically interesting, are also little interest. You need as often different from that uninvolved people can imagine by example, translating a sign language like a french sign language or American Sign Language is very different from the image of lots of people of it. Deaf people seen very quickly. Body posture and facial expression are very important for the comprehension. What's more, this won't make the content accessible for all deaf people. I'm deaf and I don't use any sign language can improve website accessibility, but you can use automating testing to detect accessibility issues. I have already asked HGBT to incorporate accessibility into the hood. It did not work very well and also no overlap. Tools can make the website accessible. The only way to make a website accessible to everyone is to get your hand on the hold. AI has already changed our lives. Every day I use automatic emissions, even if it's not perfect. I use an automatic tools to translate my content or reformulate it. Terrific because my sentence is not very old. I am sure sorry that the AI doesn't understand me very well because of my deaf voices. But progress is being made. And for you Dandan, I'm deaf since 20 years ago now and thought with AI changed my life. Like with reducing ambience on my hair ring. AIDS is more comfortable and tools like for detection means I'm safe when I'm alone at home. When I was a teenager I cannot imagine all the things I can be able to do. Like we can have chatting with people by phone and have a transcription automatic. We can prepare these conferences by distance. With Emmanuel we have both dev and it's amazing to make this one by distance just with tools. With AI 20 years ago he was impossible for two deaf people to prepare something by distance just with webcam and automatic subtitles. When I was a teenager I don't all the things is possible. I never truly had like to do so much on my home and tools like for detection. I mean, I'm safe when I'm alone at home. Now I can have some discussion by phone with transcription automatic. It's so nothing about us without us is a mantra from USA. It is important to design tools with disabling people to hire together so as not to bias is we need to evaluate with disabled people to reduce risk and bias and to communicate with them to build useful tools and make them effective. Better yet, we need to hire disabled people in the tech industry to do this. Of course they need to be trained and therefore made accessible to them. We end where you project army in an impact in the lives of these. Today we are talking about disabilities, but where some we are someone else to other people. It's important that more diversity in tech to combat bias in the design of model and products. Diversity is not just disabilities, but also by gender, ethnicity and religions. Your users are varied, so it's important that the diversity exists. Two in your team. Thank you so much for listening to us. You to find our presentation transcript and resources. Thank you so much.", "words": [], "utterances": null, "confidence": 0.826151912997903, "audio_duration": 2253.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Emanuela Bois was born deaf with two year implants. Tanlin Dobrye is a machine learning engineer. They discuss the legal framework, hemlocks and inclusion of AI. Just because it's legal doesn't mean it's ethical.\n- Is this estimated that about 15% of the world population has a disability? A disability is not just a problem for people with wheelchairs. 80% of disabilities are not immediately visible. In the short or medium term, we can have mutine disabilities around you.\n- Data science is based on data. The first step in whole data science project is taking what is the need? It's a brainstorming according to your problem. The second step is exploratory data analysis. The goal is eventually to find the best model with the best results.\n- This year we are seeing more and more automated emission and transcription in video and video platform. There are tremendous opportunities to improve the lives of disabled people like seniors. There is plenty of innovation in progress in beta that can be useful.\n- More diversity in tech to combat bias in the design of model and products. Diversity is not just disabilities, but also by gender, ethnicity and religions. Your users are varied, so it's important that the diversity exists.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.08, "text": "disability people", "timestamps": [{"start": 1760042, "end": 1761374}]}, {"count": 3, "rank": 0.07, "text": "Deaf people", "timestamps": [{"start": 1942680, "end": 1943452}, {"start": 1957716, "end": 1958492}, {"start": 2108576, "end": 2109312}]}, {"count": 6, "rank": 0.06, "text": "disabled people", "timestamps": [{"start": 1291394, "end": 1292574}, {"start": 1577506, "end": 1578774}, {"start": 1890996, "end": 1891932}, {"start": 1907636, "end": 1908744}, {"start": 2168274, "end": 2169154}, {"start": 2182722, "end": 2184522}]}, {"count": 1, "rank": 0.06, "text": "many people", "timestamps": [{"start": 747512, "end": 748272}]}, {"count": 1, "rank": 0.06, "text": "other people", "timestamps": [{"start": 2216168, "end": 2217272}]}, {"count": 1, "rank": 0.06, "text": "odyssey people", "timestamps": [{"start": 787622, "end": 788726}]}, {"count": 1, "rank": 0.06, "text": "disability diseases", "timestamps": [{"start": 542684, "end": 544204}]}, {"count": 1, "rank": 0.05, "text": "certain disabilities", "timestamps": [{"start": 739872, "end": 741124}]}, {"count": 1, "rank": 0.05, "text": "mental disabilities", "timestamps": [{"start": 540564, "end": 542144}]}, {"count": 1, "rank": 0.05, "text": "mutine disabilities", "timestamps": [{"start": 563324, "end": 564744}]}, {"count": 5, "rank": 0.05, "text": "data science", "timestamps": [{"start": 150586, "end": 151242}, {"start": 864074, "end": 864770}, {"start": 945396, "end": 946116}, {"start": 955662, "end": 956310}, {"start": 973590, "end": 974374}]}, {"count": 1, "rank": 0.04, "text": "whole data science project", "timestamps": [{"start": 863490, "end": 865454}]}, {"count": 1, "rank": 0.04, "text": "automatic emissions unassailed automated emotions", "timestamps": [{"start": 1397132, "end": 1401228}]}, {"count": 4, "rank": 0.04, "text": "Google image", "timestamps": [{"start": 617656, "end": 618416}, {"start": 629146, "end": 629938}, {"start": 639570, "end": 640562}, {"start": 757472, "end": 758448}]}, {"count": 1, "rank": 0.04, "text": "automated tools", "timestamps": [{"start": 99628, "end": 100636}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}