{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/26f57bfc-3e5b-4685-90c2-11ef59fd5f8c", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["accepting", "blockchain", "can", "centric", "companies", "conf fourty two", "confidence", "cryptocurrencies", "cryptocurrency", "ecommerce", "filipe castro", "founder special projects director", "from", "incorporating", "insights", "organisations", "risks", "these", "trends", "utrust", "web"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "8c796ab5-701d-450c-a3a2-8e069b589407", "status": "completed", "error": null, "text": "Hi, my name is Philippe and I'm here to share our vision and how businesses can start in cryptocurrency with confidence. Today at UTrust, well soon to be named XMoney, our mission is to democratize access to new digital money, making it easy for any business to access and accept. We want to make digital assets accessible and universal, so that any user can pay in any merchant with less intermediaries and more freedom. But before talking about our solution and how we help companies capture this market, it's important to understand some of the technology foundations of digital assets, blockchain in particular, not the technical elements per se, but the new concept it enables. Blockchain technology has brought about the paradigm shift by allowing direct transfer of value in the public network. Not a message, a request or an extension, or an external representation, but true direct transfer of value between two parties without intermediaries. This is taken to the transfer of physical cash, but in a digital verse. If you consider transfer of value in a digital space without blockchain technology, for example, your typical home banking, these are mere representations of value. With blockchain, it is possible for users to have direct custody of their own assets in a similar way to physical assets like cash or gold, as long as of course, they have access to private keys. Hence the popular expression not your keys, not your crypto. While digital assets are based upon blockchain technology layer, there are different types of assets with varying degrees of openness, different use cases, value and properties that can be less or more decentralized. Think of bitcoin versus ethereum with a volatile or fixed value USDC USDT as examples of stablecoins that can be issued by anyone from a single individual, a group, to institutions or governments. Digital asset is thus a broad category, despite similar underlying technology. Not all digital assets are the same, even in specific cases. In payments, for example, there are differences. Just think of for example the difference between paying with an american dollar or venezuelan peso, for example. The different accepting and issuer risks affect the market price of one versus the other in FX markets and others, and these same applies in the case of stablecoins. For the use case of payments, cryptocurrency or digital assets have been through narrative evolution, which has been showcased in the terminology and target uses or use cases. This evolution translated into a higher degree of maturity and adoption to specialized use cases. For example, today there are stable coins with a one to one pegged to the US dollar. Well, not all the times, but that's a topic for another discussion and presentation. Maybe in the future. And this evolution in the narrative in the usability use cases of cryptocurrency is also cumulative. Bitcoin has evolved from pure payment narrative, to a speculative investment, to an inflation edge asset, to a store of value. In the future, we will no longer have CDBCs, central bank digital currencies or national currencies issued by central banks which hybrid elements from different aspects of these technology. They might have more or centralized or decentralized elements. There will certainly be a hybrid of different elements using blockchain technology as a foundation. And of course customers of the future will be digital natives. It's not already this is a young segment of a very young, connected and demanding users, hyperconnected, holding cryptocurrency and part of a connected metaverse. This is a prime audience for any business to capture and retain, especially when it comes to payments. For businesses crypto adoption, this is a really relevant topic. Adding cryptocurrency as a means of payment will no longer be optional, but the status quo. Almost 32% of SMEs in the US accept cryptocurrency and this number is trending. The decision in adding payments in crypto has translated into increase of transactional volume of more than 100% with a return on investment of more than 300% in some. This is an audience that any business should be paying attention, close attention to because these are different, the way they interact and how they consume information, how they're influenced and how they pay. Most brands have either started or are already catering to this trend, introducing crypto gamification metaverse elements to position themselves as appealing and leaders in their respective markets. And this is exactly where we come in. UTrust is the gateway to this market. For years our solution has been allowing merchants across all verticals to accepting crypto payments, making it accessible to tap into this new rising market. It is a payment gateway, allowing any business to accept crypto as means of payment, be it at a checkout or through invoicing. Simple and without any risk of volatility. A trusted intermediary that settles in fiat in the merchant's bank account. We provide low transactional fees at 1% end to end, no chargeback risks, a drastic reduction of fraud and fast transactional settlement versus legacy solutions. We make the checkout integration super simple. These plug and play experience with support for the most widely used market plugins, as well as an API for custom integrations with no blockchain technical expertise required for the merchant. We also make the payment experience seamless to the consumer and support any wallet in the market. It's an blockchain experience open to all, with no ecosystem lock in. We solve all the hurdles of crypto payments for merchants without any risk of volatility. The merchant always receives a steady value as a regulated and compliant institution, employing state of the art blockchain screening technology for AML. That's antimoney laundering to protect users and merchants in the ecosystem from malicious actors, making the whole experience reliable and secure with no hidden costs or fees, no annual subscription nor commitment. Merchants only pay 1% of any transacted volume, providing flexibility and choice. Our solution is extremely competitive given the base layer we operate upon blockchain. By reducing these amount of intermediaries in a transaction, we obtain a lower degree of complexity. Less intermediaries translate into more simplicity and lower costs. With less costs, more of the value can be captured and passed to the client. This is a market of users that already uses crypto for payments, but obfuscated under more intermediary layers. Many users already pay with crypto using their linked cards, paying extra fees for the conversion. At the same time, the merchant pays a higher percentage to receive the transaction because of the underlying rails. These also allows for new business models. For example, how is it possible to transform a fee into an additional revenue? Like instead of a merchant paying a processing fee, this can be truly offset to zero, perhaps even becoming a net positive. Well, is this entirely new? At its core, no. This model already exists, and it's currently used by legacy payment processors such as PayPal. And it's not optional. All you have to do is read their terms of service. How do they do it then? Well, during the transit time of the funds, from the moment the client pays until the merchant actually receives the money in their bank, these funds in transit can be used and reinvested to generate additional revenue. The difference? With us, they retain all the funds to themselves. We won't retain that extra money and pass it to the merchant, offsetting their costs a more fair and transparent way to take on a core model. And of course, this is entirely optional. But it's something that the current model and the foundation of blockchain technology allow us to pass on and to provide that extra mile to merchants. And this universe of merchants keeps growing, especially in the sectors of ecommerce, real estate, fashion, luxury items and digital goods. Many of our clients want to establish themselves as pioneers in their sector, and we are prepared to help them take the maximum advantage of this new segment, be it in co marketing initiatives, ecosystem reach out or through our network of partners. Because payments in crypto have unique challenges when compared with traditional gateways. Our approach helps to maximize impact in reach. At UTrUst, we see our merchants as partners in these whole ecosystem journey, so don't get left behind. As a merchant, this is these time to adopt and join the ecosystem. Although the perception may be it's early, this is the perfect moment for you to position yourself as a market leader. In a similar way to the adoption of the Internet, this is a critical moment for the mass adoption of digital assets. Looking at the past, we see that companies that persevere are the ones that keep adapting, the ones that align with the trends of the future before they become tomorrow's status quo. So we invite you, web invite your business to start accepting the money of the future by visiting our website and onboard today. Thank you all.", "words": [], "utterances": null, "confidence": 0.940433143613503, "audio_duration": 634.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- UTrust's mission is to democratize access to new digital money, making it easy for any business to access and accept. With blockchain technology, it is possible for users to have direct custody of their own assets. Philippe explains how businesses can start in cryptocurrency with confidence.\n- While digital assets are based upon blockchain technology, there are different types of assets with varying degrees of openness, different use cases, value and properties. Almost 32% of SMEs in the US accept cryptocurrency and this number is trending. UTrust is the gateway to this market.", "auto_highlights_result": {"status": "success", "results": [{"count": 6, "rank": 0.07, "text": "digital assets", "timestamps": [{"start": 40272, "end": 41062}, {"start": 58388, "end": 59354}, {"start": 114136, "end": 114766}, {"start": 149216, "end": 150150}, {"start": 177756, "end": 178786}, {"start": 611828, "end": 612842}]}, {"count": 2, "rank": 0.07, "text": "crypto payments", "timestamps": [{"start": 335698, "end": 336930}, {"start": 401988, "end": 402778}]}, {"count": 1, "rank": 0.07, "text": "new digital money", "timestamps": [{"start": 33596, "end": 34774}]}, {"count": 1, "rank": 0.06, "text": "central bank digital currencies", "timestamps": [{"start": 225102, "end": 226594}]}, {"count": 1, "rank": 0.06, "text": "new business models", "timestamps": [{"start": 479708, "end": 481250}]}, {"count": 1, "rank": 0.06, "text": "legacy payment processors", "timestamps": [{"start": 504052, "end": 505546}]}, {"count": 1, "rank": 0.06, "text": "crypto gamification metaverse elements", "timestamps": [{"start": 317598, "end": 320302}]}, {"count": 1, "rank": 0.06, "text": "blockchain technology layer", "timestamps": [{"start": 115502, "end": 117182}]}, {"count": 8, "rank": 0.06, "text": "merchants", "timestamps": [{"start": 332882, "end": 333410}, {"start": 355684, "end": 356138}, {"start": 402948, "end": 403402}, {"start": 418376, "end": 418814}, {"start": 430882, "end": 431394}, {"start": 551572, "end": 552330}, {"start": 553748, "end": 554122}, {"start": 589808, "end": 590134}]}, {"count": 1, "rank": 0.06, "text": "digital goods", "timestamps": [{"start": 561028, "end": 562074}]}, {"count": 1, "rank": 0.06, "text": "digital natives", "timestamps": [{"start": 251700, "end": 253146}]}, {"count": 1, "rank": 0.06, "text": "different use cases", "timestamps": [{"start": 121806, "end": 123006}]}, {"count": 1, "rank": 0.06, "text": "pure payment narrative", "timestamps": [{"start": 214312, "end": 215406}]}, {"count": 1, "rank": 0.05, "text": "physical assets", "timestamps": [{"start": 102996, "end": 103786}]}, {"count": 9, "rank": 0.05, "text": "value", "timestamps": [{"start": 71064, "end": 71282}, {"start": 79308, "end": 79494}, {"start": 88060, "end": 88330}, {"start": 95712, "end": 96300}, {"start": 123118, "end": 123538}, {"start": 131858, "end": 132342}, {"start": 221208, "end": 221730}, {"start": 408026, "end": 408734}, {"start": 454644, "end": 454862}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}