{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/b8085cbb-4b42-4d79-a93c-aecaee304959", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["aiml", "aswin kumar", "blueprint", "business", "combines", "conf fourty two", "configuration", "considers", "developed", "devsecops", "infosys limited", "inhouse", "itsm", "monitoring", "principles", "program", "senior director", "sre", "takes"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "3c529f2a-0f77-4898-87eb-657810becfa8", "status": "completed", "error": null, "text": "Setting up intelligent observability business architecture approach today in the agenda we'll be talking on trends and shifts in observability, the need of multilayered observability and the proposed business architecture approach. What are recent trends and shifts we see in the intelligent observability area? One the maturity in the SRE space. What we see is that the SRE function, the various processes and the engineering teams working together. It's becoming more and more on the ground and mature. Next when we see the systems health. Now there are more correlation available with the business metrics. Business metrics as in the sales, the manufacturing metrics and the customer experience associated with the sales. All that correlations the business applications SRE happening with systems health and so that we can correlate how the business is functioning. Generative aiops now this is a trend where the generative AI OpS means it is generating more and more insights using AI ML and plethora of data sets available through operations, data alerts from systems, hardware and others. This generative AI Ops has lot of promise because it will use large language models. It will bring up thorough insights and can correlate through deep learning techniques. Also enterprise architecture. Now enterprise architecture is really responding on taking on observability tooling. We see that the tooling is getting tied with the business processes. It is coming together with how the architecture of either a cloud environment or business application is planned. Observability is key in the design stage and that's how enterprise architects are working, making in the design principles. And when we develop it, when we put it into production, it brings the real insights based on the observability setup. Done. Moving on. Now you can see in this figure there is lot of application space and there SRE various channels, whether online cloud SaaS applications, partner applications, the B two B applications on payments and supplies and logistics. And then there is an integration happening with the systems of records. Now this systems of record is sitting in the data layer. Now data has like data on customers, data on transactions, data on systems, data on third party suppliers. Now what is happening is these all are giving multiple transactions and thanks to the cloud environments, it's getting into hyperscaling. What is required is afresh with this architecture approach is needed where we can establish the multilayer observability. Multilayer observability. It can tie in through the front end applications, it can talk through the various integrations on cloud, on social and other things, and it can establish really a good observability where it will provide the end to end visibility on the transactions on the type of business functions that need to be successful. Now what is this business architecture approach? I would like to share with you business architecture approach where you can see there are three levels to it. One is the dev and QA production environments where we have various engineering teams working. Whether we have DevOps teams, we have QA teams, SRE teams. Then the second level is on the events, the events level which is this all is generating lot of events. Where events are on application logs, traces events, SRE on networks, events on threats, external internal events, on incidents, happen, problems. We have storage data, we have other user experience data. All this is becoming a lot of events to be captured and correlated properly. Now there are tools available which can do this and right from the open telemetry and other things. But the key here is also that how do we establish the end to end business observability now end to end business observability, what it means it has broadly end user experience. It has application performance, it has infrastructure monitoring, it has security monitoring, it has ITSm process performance, it has cloud monitoring. Now what is happening here is there SRE business processes running when we say procure to pay or similar on business process. Then there are various applications tied on it. But these applications do not have end to end business observability. What is required here is approach where we can correlate the end user experience with performance, with monitoring together and securities and even the process performance and find out the process optimization opportunities. We can find out from various cloud logs. We can find out based on the type of optimization needed in the cloud environments. So when we bring it together, it becomes really end to end observability. And that observability is required for the various target departments and organizations and teams. And some of that we have listed here, there is the head of DevOps, there are ITSM teams, SRE teams, the network operations teams, the cloud monitoring team and many more. Now what is unique here. Now what is unique here is that two factors are there. One, we do a Persona based observability, that is a custom Persona based where it can takes the end to end business observability and then it can also have automated self feelings. Now once this architecture is set up, then it gives you lot of patterns, lot of insights which can be used to plan automation, whether you can do partial automation, self healing, but really a planning can be done. Now this planning can be used while on the systems, or there can be a process which the SRE engineers can run on it when there is a normal anomaly or event happens. Now this all is giving rise to a good architecture which can be used while setup of the overall platforms and the benefits of using this is there will be easy usage of AIML on this because the data will be collected across logs, traces metrics across together and when an incident happens, whether it's a security incident or a performance problem on application or something happened on the cloud environments, there can be a deep correlation available and we also want to encourage that there SRE business process automations also where we can use the business processes to find out various points where the value stream can be improved and then the real KPIs and metrics can be tied in and the type of slas which are to be met for the given applications can be met appropriately and various collaborations of other teams can happen and there can be a shared impact and prioritization view that what is happening less optimal or what is wrong in the systems and which business process is getting impacted. This is what I wanted to present to you today. Thanks for joining in.", "words": [], "utterances": null, "confidence": 0.934103321364454, "audio_duration": 517.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Setting up intelligent observability business architecture approach today in the agenda. Trends and shifts in observability, the need of multilayered observability and the proposed business Architecture approach. What are recent trends and shifts we see in the intelligent observable area?\n- There is an integration happening with the systems of records. Data has like data on customers, transactions, data on systems. All are giving multiple transactions and thanks to the cloud environments, it's getting into hyperscaling. What is required is afresh with this architecture approach.\n- Business architecture approach where we can correlate the end user experience with performance. When we bring it together, it becomes really end to end observability. Once this architecture is set up, then it gives you lot of patterns, lot of insights which can be used to plan automation.", "auto_highlights_result": {"status": "success", "results": [{"count": 4, "rank": 0.1, "text": "business observability", "timestamps": [{"start": 305316, "end": 306618}, {"start": 307668, "end": 308714}, {"start": 339232, "end": 340342}, {"start": 404532, "end": 405610}]}, {"count": 1, "rank": 0.1, "text": "business application", "timestamps": [{"start": 137180, "end": 138006}]}, {"count": 1, "rank": 0.1, "text": "SRE business processes", "timestamps": [{"start": 327132, "end": 328434}]}, {"count": 1, "rank": 0.1, "text": "intelligent observability business architecture approach", "timestamps": [{"start": 23892, "end": 27730}]}, {"count": 3, "rank": 0.1, "text": "business process", "timestamps": [{"start": 332348, "end": 333030}, {"start": 472696, "end": 473410}, {"start": 509716, "end": 510430}]}, {"count": 4, "rank": 0.1, "text": "business architecture approach", "timestamps": [{"start": 25850, "end": 27730}, {"start": 37746, "end": 39586}, {"start": 238272, "end": 240010}, {"start": 244430, "end": 245942}]}, {"count": 1, "rank": 0.09, "text": "SRE business process automations", "timestamps": [{"start": 472408, "end": 474110}]}, {"count": 2, "rank": 0.09, "text": "Business metrics", "timestamps": [{"start": 65688, "end": 66494}, {"start": 66542, "end": 67326}]}, {"count": 1, "rank": 0.09, "text": "business functions", "timestamps": [{"start": 234780, "end": 235666}]}, {"count": 1, "rank": 0.08, "text": "various applications", "timestamps": [{"start": 334156, "end": 335234}]}, {"count": 2, "rank": 0.08, "text": "SRE teams", "timestamps": [{"start": 261306, "end": 262614}, {"start": 385426, "end": 386354}]}, {"count": 1, "rank": 0.08, "text": "various engineering teams", "timestamps": [{"start": 256356, "end": 257754}]}, {"count": 1, "rank": 0.07, "text": "application performance", "timestamps": [{"start": 314456, "end": 315662}]}, {"count": 1, "rank": 0.07, "text": "various cloud logs", "timestamps": [{"start": 356996, "end": 358314}]}, {"count": 1, "rank": 0.07, "text": "application logs", "timestamps": [{"start": 272120, "end": 273182}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}