{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/1c1a5ea5-f096-4d14-8c45-8a869a117a48", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["agnes", "agnes muthoni", "andela", "be", "best", "brilliance", "bringing", "can", "career", "comes", "conf fourty two", "connects", "developing", "director of talent partnerships", "does", "establishing", "explains", "future of work andela", "marketplace", "muthoni", "organizations", "partnerships", "process", "reshaping", "roles", "skills", "technologists", "thats", "trusted", "unlock", "worlds"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "11db8922-f485-4424-8bbb-feb457b35a7c", "status": "completed", "error": null, "text": "What if you could work with some of the world's most innovative companies, all from the comfort of a remote workplace? Andela has matched thousands of technologists across the globe to their next career adventure. We're empowering new talent worldwide, from Sao Paulo to Egypt and Lagos to Warsaw. Now the future of work is yours to create. Anytime, anywhere. The world is at your fingertips. This is Andela, everyone. It's wonderful to be participating in this conference in 2022. My name is Agnes Muthoni, and I head up partnerships here at Andela. Let me first start off by describing Andela's model and the journey we've embarked on to bring the future of work to life. Andela is a global talent marketplace that helps companies build remote engineering teams faster. We help companies like GitHub, Goldman Sachs and Cloudfair connect with vetted remote engineers across different markets. This enables our clients to scale their engineering teams quickly and build amazing products. What's important to note is that this has been a journey. The way the world works is changing, and Andela's vision of the future of work from when we were founded is now a more obvious reality. We've always seen this global remote workforce and have been working towards it since we launched our very first remote regions in Egypt and Ghana. Now the rest of the world is seeing the impact of Andela for both companies and engineers across the world. At Andela, we believed in this idea of leveling the playing field for clients to hire brilliant and amazing talent regardless of location, and similarly give talent the option to choose exciting and challenging opportunities with global companies. And the world is now ready for this. And we are seeing more companies embrace this growing global trend and the work Andela has done to bring the future of work to life. Now, let me talk about our talent network. When we started out this mission to connect brilliance with opportunity by finding great talent in emerging markets, then expanding into other regions. Our focus is centered on helping our clients find experienced software engineers who can deliver against our clients product roadmap. And the way we do this is through sourcing for talent, screening them, onboarding the talent onto our talent network, matching them against specific client requirements, and placing them on partner engagements once they have met the specific criteria and requirements from the client. Over time, we've built market expertise in bringing great talent through screening and assessments and screening over hundreds of thousands of applications using our data driven process. As a result, and through our expansion efforts, we now have engineers who have joined our network, coming in from more than 90 countries, six continents, with 175,000 technologists in our community and a successful placement rate of 96%. Now if you're listening to me and you are a software engineer, you may have a question. And one of the questions that you may have is why join Andela? Well, let me tell you why. We've spent time clearly listening and understanding our clients'needs and working hard to meet those needs. Our advantage as a talent network are the long term opportunities available, the global talent community where engineers can connect with other brilliant engineers across the globe. We also offer career coaching, educational advancement and flexibility. Remote first is changing the way we work and opening up opportunities for developers in emerging markets to enter the global talent marketplace. This phenomena of being able to work from anywhere has become a more obvious reality that has been cultivated forward over the last couple of years. In our recent developer report, what we did find is that more thats 80% of developing are keen and are excited about the idea of wanting to work remote. Now let me share a couple of benefits. So the first benefit is it gives more people more flexibility with where they choose to work and live, thus enabling developers to have more work life harmony. The second benefit as a software engineer or experienced talent, you get to connect with global opportunities and it opens up borderless opportunities, creating new and exciting opportunities on the global stage. In a most recent survey, what we did find is that 74% of all Andela engineers had a quality of life improvement. 65% of them said that they're better able to save and 81% cited with longer than one year of tenure did cite an increase in take home pay. Diversity and inclusion was cited as a key priority by many corporate leaders and through our expansion plans we help companies build and grow more diverse. Thats as we continue to advance our mission forward of connects brilliance with opportunity the Andela Learning community has been able to support thousands of engineers go through learning journeys that help them grow in their careers. The learning community offers access to in demand technology courses through education partners like Google, Microsoft, Facebook and Salesforce, as well as it connects engineers with job boards and opportunities for them to be able to grow in their career. As a company, we have been working towards the future of work and now I'm just excited that the world is ready for it. Thank you.", "words": [], "utterances": null, "confidence": 0.943738378378379, "audio_duration": 452.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Andela has matched thousands of technologists across the globe to their next career adventure. Now the future of work is yours to create. Anytime, anywhere. The world is at your fingertips.\n- Andela is a global talent marketplace that helps companies build remote engineering teams faster. We help companies like GitHub, Goldman Sachs and Cloudfair connect with vetted remote engineers across different markets. Andela's vision of the future of work from when we were founded is now a more obvious reality.\n- Andela's focus is centered on helping clients find experienced software engineers. With 175,000 technologists in our community and a successful placement rate of 96%. Remote first is changing the way we work and opening up opportunities for developers in emerging markets to enter global talent marketplace.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.08, "text": "global opportunities", "timestamps": [{"start": 360436, "end": 361710}]}, {"count": 1, "rank": 0.08, "text": "vetted remote engineers", "timestamps": [{"start": 107732, "end": 109962}]}, {"count": 2, "rank": 0.08, "text": "great talent", "timestamps": [{"start": 189782, "end": 190630}, {"start": 231362, "end": 232322}]}, {"count": 1, "rank": 0.08, "text": "experienced talent", "timestamps": [{"start": 358050, "end": 359274}]}, {"count": 1, "rank": 0.08, "text": "new talent", "timestamps": [{"start": 14282, "end": 14922}]}, {"count": 1, "rank": 0.07, "text": "experienced software engineers", "timestamps": [{"start": 199040, "end": 200906}]}, {"count": 1, "rank": 0.07, "text": "global companies", "timestamps": [{"start": 166312, "end": 167300}]}, {"count": 1, "rank": 0.07, "text": "other brilliant engineers", "timestamps": [{"start": 297312, "end": 298742}]}, {"count": 1, "rank": 0.07, "text": "more companies", "timestamps": [{"start": 170456, "end": 171330}]}, {"count": 2, "rank": 0.07, "text": "opportunity", "timestamps": [{"start": 187676, "end": 188300}, {"start": 411812, "end": 412400}]}, {"count": 1, "rank": 0.07, "text": "more work life harmony", "timestamps": [{"start": 351396, "end": 353514}]}, {"count": 1, "rank": 0.07, "text": "borderless opportunities", "timestamps": [{"start": 363592, "end": 364958}]}, {"count": 1, "rank": 0.06, "text": "specific client requirements", "timestamps": [{"start": 217704, "end": 219902}]}, {"count": 1, "rank": 0.06, "text": "remote engineering teams", "timestamps": [{"start": 99360, "end": 101082}]}, {"count": 1, "rank": 0.06, "text": "more flexibility", "timestamps": [{"start": 345520, "end": 346438}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}