{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/40087d91-034b-4929-926e-ab408d8ea3d1", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["andor", "be", "bother", "broader", "can", "career", "case", "coming", "community", "company", "conf fourty two", "developer advocate", "has", "herehttpswwwslidesharenetlaurenhaywardschaefehowtoraiseyourprofileworksheet", "lauren", "lauren hayward schaefer", "meritocracy", "mongodb", "months", "profile", "raise your profile", "recognized", "steps", "stories", "taken", "typically", "unfortunately", "weeks", "worksheet", "youll"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "339a33e4-300f-4d82-b38c-931b83182457", "status": "completed", "error": null, "text": "Hey, everybody, I want to kick things off with a story. So last summer, I was bugging my boss, Joe, for promotion. So I asked him straight up, Joe, what do I need to do to get promoted? And he said, lauren, you're doing great work, but you've got to raise your profile internally at the company. People need to know who you are and what you're doing. And I thought, I hate networking like I know my teammates, but getting to know people outside of my immediate team is really hard. I'm a remote employee. I can just bump into people in the hallway and strike up a conversation. Can't I just put my head down, focus on my work? So I called up my mentor taken, and I said, ken, I need a plan to raise my profile. And Ken made several suggestions. I did not like his suggestions because they pushed me out of my comfort zone. And I said, ken, I like my comfort zone, but Ken said, do it anyway. So I did. And this made my boss, Joe, happy because it has easy to make a case for my promotion. And he said, lauren, you're promoted. Which made me do a little happy dance inside my head. So this idea of raising my profile has been a theme throughout my entire career. Early in my career as a software engineer, my managers would talk to me about expanding my scope Andor demonstrating influence both inside and outside the company. Maybe you've heard similar things about scope or influence or reputation. Or maybe you're doing your job really well and you're like scratching youll head trying to figure out why you're not getting promoted. Doing youll job well will probably not be enough to get promoted. And for doors to start opening for you, you're going to have to put in the work to raise your profile. So what do I mean by profile? I'm talking about what people know or remember about you. Your profile consists of things like who you are, what youll can do, and what you're known for. Let's take a moment and think about your profile. So I'm going to walk you through the pieces of my profile as an example and give you time to jot down some notes about your profile. So I've actually made a worksheet that you can choose to use if you'd like. The link for the worksheet is in the description below, so you can print it out and fill it in throughout this session. Or if you don't have access to a printer, you just don't like printing anything. You can just open up a text editor on your computer and type up your notes there. So let's walk through my profile as an example. So who am I at least who am I at work? Well, I'm a staff developer advocate at MongoDB. Internally at my company, people also need to know what team I'm on and what part of the organization I'm in. So I'm on the Devrel team under Rita Rodriguez. So take a moment and jot down some notes about the basics of who you are. Feel free to case the recording while you do so. All right, next, let's talk about what I can do. So these could be technical skills or soft skills. So I enjoy building web apps using Javascript and node js. I love helping people model data in MongoDB and talking about schema design patterns and schema design anti patterns as well as building CI CD pipelines. I also can speak at conferences. So take a moment and think about what you can do. What skills do you have? What skills do you want to acquire? I encourage you to pause the recording and write down some notes. All right, finally, what am I known for? So I'm known for creating easy to understand and engaging articles and videos. So specifically, I'm known for my node Quickstart stories, my anti pattern series, and my realm CI CD series. I'm also known for my dedication to excellence and being detail oriented. I'm a remote work advocate and I've given several talks on the topic. And finally, I'm also known for creating silly TikToks about life as a developer. So take a moment last time for a while and write down what you're known for internally at your company as well, has externally in the broader tech community. Also consider if there are things you're not currently known for but youll like to be. All right, so pause the recording, write down your ideas. So now you have an idea of what you want your profile or your personal brand to be. So some of you are probably sitting here thinking, but why do I have to do this? Right? Isn't technology a meritocracy? Can't my work just speak for itself? So I'm going to cover four reasons why you should raise your profile, and then I'll talk about how you're going to actually do that. So first, why for a lot of software engineering roles, raise your profile is part of the promotion requirements. I looked at many publicly available promotion requirements for software engineers, and companies have different names for promotion requirements. Some companies will call them things like career frameworks or career ladders or title matrixes. These are the documents that tell you what you have to do to get promoted. So I saw a common theme across these documents and let's take a look at three of them. Patreon levels, their engineers from IC one all the way up to IC six. IC standing for individual contributor. Their career levels document has a category specifically for influence. So here are some of the items included in the influence category. So at IC three, you're starting to broader impact. IC four routinely has initiative to domain level impact, IC five routinely has engineering wide impact and IC six routinely has.org to industry level impact. So as you move up the engineering levels, your influence is expected to increase both inside and outside the company. Let's take a look at medium. The medium engineering growth rubric has a section on evangelism. They list different levels of evangelism. So first represents medium well externally Andor influences individuals positively. Next participates more centrally in small events and takes simple actions that positively influence groups of people. Works hard to positively influence large groups of people on their views of medium establishes medium as a great innovative company and workplace to the whole industry. Andor introduces medium in a positive light to a wider audience outside the industry. So this evangelism section focuses primarily on external influence. All right, I've got one more example for you. Khan Academy. So Khan Academy's engineering career development document has an emphasis specifically on evangelism and public artifacts. I love their explanation, so I'm just going to read it to you. Being open in sharing our work is at the heart of our development philosophy. We work on exciting stuff, the type of stuff that energizes passionate, smart people and makes them want to help in any way possible. The more you blog about our work, share our progress and connect with the development community, the more likely we are to attract top talent and become an exemplary dev team. This type of stuff increases youll market value, thus justifying our paying you more money. And when you do them as a representative of Khan Academy, they reflect well on us establishing our reputation as being the kind of place where the elite celebrity developers work, which in turn attracts more great developers. Their career development document goes on to give specific examples of the types of evangelism and artifacts they want their engineers to create. So some companies focus more on internal influence while others focus more on external influence. But it's a fairly common theme to see in the higher ranks of software engineers and developers. You have to show that you are influencing others and that you have a growing reputation a lot of the time. It's also part of the implicit promotion requirements. Now every company is different, but most of the time, your manager will not be able to give you a promotion on their own. At the lower levels, your boss's boss and maybe your boss's peers need to approve the promotion. As you get into the higher levels, leaders across your organization and your company are going to need to agree. The management team and executives need to know who you are and the work that you do in order to approve the promotion. Number three, raising your profile opens doors. Those doors could be things like a new role at your company, or a job at another company, or a leadership opportunity, or an invitation to speak at a conference, or a chance to build connections with other industry leaders. As you build your profile, doors will begin opening for you. And finally, it attracts people to your company. As Khan Academy stated in their career development doc, engineers want to work with other amazing engineers. When you raise your profile, other awesome engineers will want to work with you. If your company has referral bonuses right? This is a nice monetary perk. But also this means you'll get to work with other awesome people. So as you're thinking about raising your profile, you want to think about both internally Andor externally. So internally, you want to think about working your way outward from your immediate team, to your management team, to your department, to the people throughout your company, all the way up to the executive team. When you think about externally raising your profile, you might start with former colleagues or classmates. You might get connected with other developer, advocate your local area at meetups or hackathons, and you might work to reach the global developer community either in person or online. It's up to you if you want to focus internally or externally. Often external efforts will also create internal visibility has well, which is a nice bonus. All right, so now that you know why you should raise your profile, let's talk about ten ways you can actually make that happen. Number one, become the go to person for a particular language like Python or a technology like kubernetes, or a common challenge that your customers face, be that go to person for your team or your entire company. Dropbox specifically calls out domain expertise in their career framework, so they say you are the authority at Dropbox on a particular domain. This could be a platform, for example windows or iOS, a particular field of computer science, or a product category. As you grow along the arc of being an engineer, you get deeper and deeper into a space or expand to having more breadth. Impact often comes through consulting quickly, unblocking thorny issues in a domain and finding creative, generalizable approaches to nonobvious problems in a domain. So identify what you're good at either go deeper or develop a wide breadth and become the go to person for that. Number two, contribute to open source projects. This is a great way for other developers to see your work, and being a contributor or a maintainer can give you a lot of visibility. If, like me, you don't enjoy coding in your off hours, see if there's a way you can code in the open at work. Your company may also see the value in contributing to open source projects or developing in the open. You may also want to create a readme for your GitHub profile page to let people know a little bit about you. So Joe Carlson has a really nice 62nd tutorial on how you can easily do this with just a markdown file. So I've included a link here in the slides so you can watch that later. Number three, report the news for youll team. Now, there are several different ways that you can do this. If someone on your team needs to be a representative as part of the larger cross functional team, volunteer to be that person. You'll bring status updates, but you can also become known as the person who identifies or solves problems. As the larger team works together, you can also become known as the expert on your part of the project. If someone needs to report status to the executives, this is a great way to get to know them. They'll see your face on a regular basis. Now, if you're not a fan of extra meetings, you can do something like volunteer to curate an internal or external newsletter that profile updates about your piece of the product or the product has a whole now, I do want to caveat this a little bit. I want to warn you, reporting the news can become seen as an administrative role that has less value. So make sure that you tailor the role in a way that gives you a lot of visibility and profile a lot of value to others. All right, if you want to be seen has an expert something write about it. Even if there are other people out there who know more about the topic than you do, if you're writing about it, people will assume you know what you're talking about. You can write about things you already know or things you are learning. Writing about topics you don't already know is a great way to reinforce your learning. Now, there are a variety of places where you can write. Your company may have an engineering blog. You can create your own personal blog. There are sites like Dev two and medium that allow you to write without spinning up your own blog. All right, number five, give tech talks. These can be small lunch and learns at your company or huge international conferences or anywhere in between. Just like writing, people are going to assume you're an expert. If you're talking about a topic, I guarantee that you have something you can talk about. Whether you're a seasoned expert or you're brand new to coding, you have a story that you can tell. Many people have a fear of public speaking. It's normal. Don't let that fear stop you. Start in small venues where you feel comfortable and then take baby steps to other venues. I was interviewed recently about how I got started speaking at tech conferences and I shared tips for others, so I will drop a link in the description below. If you're interested in speaking about MongoDB at a conference, check out the MongoDB speakers program. You can apply to work with a speaking coach and get funding to attend the conference. There is a link to the MongoDB speakers program in that article that is on the screen. Number six regularly post on social media. Maybe you love it, or maybe you hate it, but it's hard to deny that social media is a great way to raise your profile. You can create short, bite sized content on platforms like Twitter, LinkedIn, Instagram and TikTok, or you can create longer, more in depth content on Twitch, YouTube, or podcast. Posting to all those platforms might seem a bit daunting, but you can likely reuse or recycle the same content. I joined TikTok right after the pandemic began and I started creating short, silly TikToks about life as a developer. They do okay on TikTok, but I hesitantly started reposting the TikToks on LinkedIn and they do surprisingly well there. I think of LinkedIn as this know professional platform, but people seem to really enjoy the silliness when it appears there. What I've noticed is that I interact with a lot of the developer community on LinkedIn who I've never met in person, but I also interact with a lot of my fellow MongoDB employees on LinkedIn who again, I may never talk to on a regular basis. Posting on LinkedIn has raised my profile both internally at MongoDB and externally in the broader developer community. Number seven, lead an employee networking group. Now, companies have different names for these. I've heard them called affinity groups or business resource groups. What I'm talking about are those groups at your company for particular groups of people with a common interest. When I was at IBM, I led the worldwide work from home group at MongoDB. I currently participate in the women's group these groups provide an opportunity to demonstrate leadership as well as build connections with people across the company. At MongoDB, our executives are involved in these groups, so it's a great way to get to know an executive in a more informal setting. Now I'm going to caveat this recommendation. Some companies really value the work people do in leading these networking groups. Bother companies see these as nice to have groups that don't provide a lot of value to the business. So be sure that you can frame your work in these groups in a way that matters to your management team. Number eight, attend, host, or speak at a meetup or a hackathon meetups and hackathons are a great way to get connected with other people in your local community. Hosting a meetup doesn't require any technical skills, but if you execute the meetups consistently, people will see you as a leader. Attending and asking thoughtful questions will also help you be seen as a technical leader. Hackathons are a fantastic way to work with and get to know other developers in your area, so get involved in your favorite meetup or hackathon. Number nine, answer questions publicly online on places like stack overflow or community forums. If you provide thoughtful, accurate answers, people will begin to recognize your name. When I worked at IBM, I decided to answer one question a day in our online forums. This helped our users recognized me. It also demonstrated to my team that I was knowledgeable and helpful. All right, number taken. My last tip for you today and possibly the most important advertise your work. If you have a daily scrum or a weekly status meeting, show up ready to talk about what you've accomplished. When you meet someone new, be ready with your elevator pitch. Capture any compliments you get and make sure your management team sees them. For example, if someone says that they enjoyed a conference talk that I give, I will grab the link andor forward it to my manager. If someone gives me a compliment verbally, I'll ask them to send it to me as an email as well, so I can just forward that to my manager. I also have a Google Doc where I keep a list of every compliment that I receive. Then, when it's time for me to write my performance review, I just organize the compliments into groups and paste them directly into my performance review. This gives my management team tangible evidence that I'm doing my job well. If possible, find a manager who is good at advertising your work as well. I've been very fortunate that my director, my boss's boss, acts as a sponsor for me. He speaks well of me when I'm not in the room. If I send him a really good compliment, he forwards it on to his boss. This means that the executive team isn't only hearing about me at performance review time, they're hearing positive things about me throughout the year. All right, so those are my top ten tips for raising your profile. Raising your profile will probably feel uncomfortable at first, and that's okay. That's normal. I encourage you to make a plan, take baby steps as you step out of your comfort zone. So consider, what can you do this week, this month, and this year? I encourage you to write down a specific action youll can take to acquire a new skill, modify what you're known for, or raise your profile. So I've got spots for you on page two of the worksheet to do just that. For each action, consider how you will evaluate success. How will you know if you've followed through on that action? How will you know if the action worked? How will you know if you got that desired outcome? Also consider how you will hold yourself accountable. What I like to do is set a calendar reminder to check in with myself. Maybe youll can ask a friend to hold you accountable. What can you do to keep these actions that you're going to write down from just sitting here on the paper or sitting there in youll text file and making sure that you follow through? So in just a moment, I'm going to give you a minute to think about this. Now, before I do that, let me remind you of the tips for raise your profile. Number one, become the Goto person. Number two, contribute to open source or public projects. Number three, be the news reporter for your team. Number four, write blog posts or articles. Number five, give tech talks. Number six, post on social media. Number seven, lead an employee networking group. Number eight, attend, host, or speak at a meetup or hackathon. Number nine, answer questions publicly online, and number ten, advertise your work. So as you're thinking about what you can do, be specific. If you can. If you want to become the go to person, what do you want to become the go to person for? All right, so I'm going to give you just a minute. If you want to pause the recording and taken your plan, what can you this week, this month, this year, how are you going to evaluate success and how will you hold yourself accountable? All right, I hope you've made a plan. You've got your plan. You're ready to start taking small steps to raise your profile. I cannot wait to hear about you in the coming weeks and months. You've got this.", "words": [], "utterances": null, "confidence": 0.957232864051577, "audio_duration": 1498.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- In order to get promoted, you need to raise your profile internally at your company. Your profile consists of things like who you are, what you can do, and what you're known for. Take a moment to jot down some notes about your profile in a worksheet.\n- Take a moment and think about what you can do. These could be technical skills or soft skills. Write down what you're known for internally at your company and externally in the broader tech community. Now you have an idea of what you want your profile or your personal brand to be.\n- For a lot of software engineering roles, raising your profile is part of the promotion requirements. As you move up the engineering levels, your influence is expected to increase both inside and outside the company. Here are four reasons why you should raise your profile.\n- Khan Academy's engineering career development document has an emphasis specifically on evangelism and public artifacts. It's a common theme to see in the higher ranks of software engineers and developers. Raising your profile opens doors.\n- Become the go to person for a particular language like Python or a technology like kubernetes. contribute to open source projects. Report the news for your team. Give tech talks. Many people have a fear of public speaking. Don't let that fear stop you.\n-  Capture any compliments you get and make sure your management team sees them. If possible, find a manager who is good at advertising your work. When you meet someone new, be ready with your elevator pitch.\n- Raising your profile will probably feel uncomfortable at first, and that's okay. I encourage you to make a plan, take baby steps as you step out of your comfort zone. Write down a specific action youll can take to acquire a new skill or modify what you're known for. Also consider how you will hold yourself accountable.\n- One of the tips for raising your profile is to become the Goto person. contribute to open source or public projects. Write blog posts or articles. Lead an employee networking group. Answer questions publicly online. And advertise your work.\n- All right, I hope you've made a plan. You're ready to start taking small steps to raise your profile. How are you going to evaluate success and how will you hold yourself accountable? I cannot wait to hear about you in the coming weeks and months.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.06, "text": "other people", "timestamps": [{"start": 932348, "end": 932694}, {"start": 1184028, "end": 1184454}]}, {"count": 1, "rank": 0.06, "text": "other awesome people", "timestamps": [{"start": 677132, "end": 678360}]}, {"count": 1, "rank": 0.05, "text": "Many people", "timestamps": [{"start": 989950, "end": 990602}]}, {"count": 1, "rank": 0.05, "text": "other developer", "timestamps": [{"start": 713512, "end": 714254}]}, {"count": 1, "rank": 0.05, "text": "particular groups", "timestamps": [{"start": 1126152, "end": 1126866}]}, {"count": 29, "rank": 0.05, "text": "profile", "timestamps": [{"start": 43228, "end": 43682}, {"start": 79388, "end": 80230}, {"start": 109492, "end": 109914}, {"start": 146352, "end": 147050}, {"start": 148592, "end": 149450}, {"start": 155172, "end": 155642}, {"start": 164068, "end": 164918}, {"start": 167112, "end": 167534}, {"start": 171576, "end": 172370}, {"start": 194576, "end": 195062}, {"start": 336892, "end": 337422}, {"start": 355108, "end": 355626}, {"start": 364392, "end": 364814}, {"start": 633228, "end": 633778}, {"start": 651348, "end": 651946}, {"start": 667432, "end": 668062}, {"start": 681804, "end": 682386}, {"start": 706868, "end": 707630}, {"start": 738448, "end": 738998}, {"start": 842102, "end": 842534}, {"start": 902912, "end": 903366}, {"start": 921896, "end": 922206}, {"start": 1043408, "end": 1044170}, {"start": 1107508, "end": 1107882}, {"start": 1332188, "end": 1332950}, {"start": 1335308, "end": 1335762}, {"start": 1367208, "end": 1367970}, {"start": 1415128, "end": 1415890}, {"start": 1491724, "end": 1492470}]}, {"count": 1, "rank": 0.05, "text": "great work", "timestamps": [{"start": 40812, "end": 41670}]}, {"count": 1, "rank": 0.05, "text": "other awesome engineers", "timestamps": [{"start": 668206, "end": 669454}]}, {"count": 1, "rank": 0.05, "text": "large groups", "timestamps": [{"start": 477234, "end": 477938}]}, {"count": 1, "rank": 0.04, "text": "other amazing engineers", "timestamps": [{"start": 664484, "end": 666126}]}, {"count": 1, "rank": 0.04, "text": "domain level impact", "timestamps": [{"start": 421896, "end": 423570}]}, {"count": 1, "rank": 0.04, "text": "affinity groups", "timestamps": [{"start": 1121176, "end": 1121966}]}, {"count": 6, "rank": 0.04, "text": "companies", "timestamps": [{"start": 373032, "end": 373378}, {"start": 376732, "end": 377030}, {"start": 578732, "end": 579078}, {"start": 1119032, "end": 1119282}, {"start": 1156596, "end": 1157150}, {"start": 1162020, "end": 1162398}]}, {"count": 1, "rank": 0.04, "text": "home group", "timestamps": [{"start": 1132476, "end": 1133400}]}, {"count": 1, "rank": 0.04, "text": "several different ways", "timestamps": [{"start": 862228, "end": 863054}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}