{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/d0567bed-9f55-4e39-8010-2c8f540052b0", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["be", "big", "blocks", "bosonq psi bqp", "build", "building", "business", "can", "capabilities", "chief quantum architect", "classification", "clustering", "computing", "conf fourty two", "karthiganesh durai", "larger", "modules", "nn", "professionals", "promising", "providing", "qml", "qnn", "qsvm", "qtl", "quanvolutional", "solutions", "techniques", "these", "verticals", "workloads"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "62744834-3073-47e0-b681-fa6e71ce5989", "status": "completed", "error": null, "text": "Quantum machine learning is a research area that explores these interplay of ideas from quantum computing and machine learning. As you know, machine learning revolves around algorithms, model complexity and computational complexity. Whereas quantum computers offers parallel processing capabilities which are essential to build efficient machine learning solutions, quantum phenomena such as superposition and entanglement are helping the industry to build efficient machine learning algorithms. Applications of QML QML is becoming a base building block for many scientific solutions on built on quantum computing. The classification we can use for classifying nanoparticles subatomic scale because here the data itself available in quantum information, not a classical data and molecular modeling for drug discovery and prediction, weather forecasting, geometrical differences in recommendation space exploration, large language systems like chat GBT. So when you hear the quantum applications, you may wonder what are the techniques offered by quantum machine learning these days it is very fancy to prefix the word quantum in front of any technique or any tool. So that's what first we look like when there is a support vector machine, quantum support vector machine neural network quantum neural network. But QML has their own approaches also like quantum binary classifier and even the grower search algorithm is one of the fundamental technique for most of the quantum machine learning solutions. Quantum enhanced reinforcement learning, quantum sampling techniques, quantum neural network, quantum convolution neural network dissipative quantum neural network, hidden quantum oracle models, explainable quantum machine learning quantum transfer learning and these quantum generative adversary networks then fuzzy cognitive mass FCM. These are all various techniques used for QML based solutions. What are the platforms or software tools available to build QML systems? IBM Kiskit is one of the prominent quantum computing framework. Kiskit has QML libraries to build quantum support vector mission nearest neighborhood neural network and there are some special functions like ZZ feature map and those Kiskit based libraries are helping to build a counterpart for their classical machine learning models. And Xanado is having a special package called Pennylan. Pennylan is can again Python package which can be imported and installed in your Python environment. These connect it to the various quantum computers and Pennyland has more QML specific functionalities functions libraries to implement your quantum machine learning solutions. And if you are from Tensorflow based classical machine learning solutions, you can use Google's Tensorflow quantum for building Tensorflow quantum based QML solutions. Dwayve has their machine learning libraries and then PYQL. They are offering grower search based QML solutions. Apart from these things there may be more framework or software tools which I may not aware. If anyone knows, please share. It is growing every day new libraries are coming. There may be many advancements in the QML so you might have found better QML solutions. Also. If there is, please even I think qsharp is also having a QML package and bracket. So almost all quantum computing platforms have their QML capabilities. You hear QML is not the new technology. Even the research theoretical researches started 1995 itself. There is a biological inspired QML work by CAN 1995, but in 2009 d wave demonstrated a QML capability to predict cars in the digital image processing. In 2013 Google and NASA jointly started quantum artificial lab. Then 2014 all optical fiber classifier was built, a perceptor model was built. Then powertrain modeling and optimization of dual motor driving systems for electric vehicle that also build in 2014, 2015 to 2018 multiple use cases enhancements happened like train their probabilistic generative models with arbitrary and pairwise connectivity for handwritten image generation. Traffic flow optimization using quantum annealer which is then in 2019 2021 there are experimental demonstration of quantum speed up of learning time of the reinforcement learning. Then quantum neuron was built, even tensorflow quantum was released since 2022 multiple chain. This timeline is not exhaustive. There are a lot of new researchers, papers are published and if you see the number of papers published on QML, it is an exponential cow. The last four years we have seen thousand 200 peppers per annum. So that is the growth of QML. So QML is promising more powerful and then efficient algorithms to build quantum systems which are utilizing these QML capabilities. Thank you. Thank you.", "words": [], "utterances": null, "confidence": 0.917529097222223, "audio_duration": 405.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Quantum machine learning is a research area that explores the interplay of ideas from quantum computing and machine learning. QML is becoming a base building block for many scientific solutions on built on quantum computing. There may be more framework or software tools available to build QML systems.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.11, "text": "QML QML", "timestamps": [{"start": 51908, "end": 53034}]}, {"count": 1, "rank": 0.11, "text": "Tensorflow quantum based QML solutions", "timestamps": [{"start": 223190, "end": 226590}]}, {"count": 1, "rank": 0.1, "text": "QML based solutions", "timestamps": [{"start": 143790, "end": 145654}]}, {"count": 3, "rank": 0.1, "text": "QML solutions", "timestamps": [{"start": 225160, "end": 226590}, {"start": 233580, "end": 235030}, {"start": 258100, "end": 258954}]}, {"count": 1, "rank": 0.1, "text": "efficient machine learning solutions", "timestamps": [{"start": 41532, "end": 43218}]}, {"count": 1, "rank": 0.1, "text": "Tensorflow based classical machine learning solutions", "timestamps": [{"start": 215032, "end": 218334}]}, {"count": 1, "rank": 0.09, "text": "QML libraries", "timestamps": [{"start": 160100, "end": 161946}]}, {"count": 1, "rank": 0.09, "text": "better QML solutions", "timestamps": [{"start": 257396, "end": 258954}]}, {"count": 1, "rank": 0.09, "text": "QML systems", "timestamps": [{"start": 150436, "end": 151710}]}, {"count": 12, "rank": 0.09, "text": "machine learning", "timestamps": [{"start": 23418, "end": 24174}, {"start": 29548, "end": 30438}, {"start": 31228, "end": 31782}, {"start": 42018, "end": 42502}, {"start": 49202, "end": 49854}, {"start": 90038, "end": 90940}, {"start": 116046, "end": 116690}, {"start": 132514, "end": 133078}, {"start": 183570, "end": 184182}, {"start": 212186, "end": 212802}, {"start": 217022, "end": 217522}, {"start": 227708, "end": 228262}]}, {"count": 5, "rank": 0.09, "text": "Quantum machine learning", "timestamps": [{"start": 23130, "end": 24174}, {"start": 89616, "end": 90940}, {"start": 115608, "end": 116690}, {"start": 132242, "end": 133078}, {"start": 211620, "end": 212802}]}, {"count": 1, "rank": 0.08, "text": "quantum transfer learning", "timestamps": [{"start": 133164, "end": 134614}]}, {"count": 1, "rank": 0.08, "text": "quantum convolution neural network dissipative quantum neural network", "timestamps": [{"start": 122462, "end": 126870}]}, {"count": 1, "rank": 0.08, "text": "efficient machine learning algorithms", "timestamps": [{"start": 48652, "end": 50858}]}, {"count": 1, "rank": 0.08, "text": "more QML specific functionalities functions", "timestamps": [{"start": 203410, "end": 208426}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}