{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/ef8ee7f6-78ca-4fd1-8fa7-0afc8c80dc9d", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["how to succeed", "be", "become", "better", "but", "chief architect", "ciocto", "conf fourty two", "digital transformation", "fails", "has", "implementing", "keyhole software", "primary", "process", "reasons", "transformation", "zach gardner"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "ca312f76-1b37-4ff9-b454-b3e2ec64701c", "status": "completed", "error": null, "text": "Welcome all to my presentation at Conf fourty two today. What I want to talk to you about are the four reasons comp 1234, why digital transformations usually fail, and how you can be successful. My name is Zach Gardner. If you didn't already know, somehow I'm the chief architect here at Keyhole Software. I get to work with some amazing people day in and day out that help solve real world challenges for real world applications. We don't do embedded software, we don't do guided missiles, none of that stuff. What I do is I help companies digitally transform by focusing on user centric applications. Now, what that means to everyone is completely different. What that means for a hospital is different than what it means for a utility company. But I've had the privilege and the pleasure of helping different companies figure. But what digital transformation means to them and how they can use that to empower their customers. Full disclosure, I'm not here to sell you a product. I'm not here to sell you anything in particular. I'm here because I care about this subject passionately, and I think that we as software practitioners have really done a disservice of explaining what digital transformation is and how it can positively impact the lives of real people. This presentation is a compilation of the things that I've learned. After doing this two or three times, I kind of lose count on how many times it's been. And what I hope you'll get out of it is to understand how you can, I guess, not have a successful digital transformation, but also how you can have a successful one. So with that, let's get started. Now, it seems like every couple of years there's a topic that comes along that simply everyone is talking about. Chat GPT seems to be the flavor of the day. A couple of years ago it was microservices, before that it was service oriented architecture. The list goes on and on. In the past couple of years, what we on the keyhole software side have noticed is that digital transformation seems to be on the top of everyone's minds, all the way from the CEOs, the CIOs, the CTOs, down to the managers, the directors, the people leading software development teams. And you can tell just from these clips that the term digital transformation is becoming more and more ubiquitous. Now. The industry has taken notice and it seems like everyone is offering a service on how to digitally transform your applications, how to digitally transform your business. I can go on. And I can go on. I actually have more slides that I didn't include in this. The first reason why a digital transformation do not succeed is because there is a fallacy in how a lot of companies approach it. There is no single tool that will allow you to digitally transform your business. There's just not. Every single business is unique. Every single business has very specific constraints, specific things that it's good at, things that it's not so good at. And even within a particular industry or sector, one company to another can be radically different. They can be neck and neck, number one and number two, and they could do things entirely differently. How do you have a single product that you can buy off the shelf and customize to any degree that will somehow work between these two and digitally transform it? If someone tells you that, it's because they're trying to sell you something. And what's funny is that this fallacy is not specific to this particular kind of transformation. In the years that I have been the software development field, I have seen these trends become, and I have seen these trends go. But they all share one interesting characteristic, the fact that there is always one particular way of looking at the world that will somehow make everything better. The oldest, and probably the first that I really dealt with was SOA, to where we were going to have these beautiful services that completely modeled our business. And all these services were going to interact with each other, and somehow that was going to allow us to compose applications on top of them and not have to write any custom code anymore. Well, I think we all know how that one went. The next one that I got to was an enterprise service bus. Where? Well, from SOA, we kind of figured out that there are all these different business rules that need to be in the middle, and we need to have some way of orchestrating calls from here to here to here. We put the smarts out of the edges and we put it into the pipes. Well, we all know how that went. It got to be too complicated, and we didn't understand it anymore. Well, what did we do next? We have microservices, and this is the trend that we are seeing. Not to say that any of these approaches that I've talked about so far are inherently wrong, in much the same way that a hammer or a saw can't be wrong. It can be applied to the wrong job. It can be used improperly. But it in and of itself is not necessarily wrong. It is how you apply it to a particular problem. That's the part that I think we're getting wrong in a lot of these cases. So with microservices, we all know that these are independent services that can go in and out of production at different cadences. Theoretically, they could be written in completely different languages, though kind of behind the curtain. I don't know if I've ever actually seen that happen at any large organization. It typically is pretty homogeneous, but that's a different presentation at a different comp 42 for a different day. So we have all these different services. They're talking to each other and they're going, and they can communicate asynchronously. They have high cohesion and low coupling. Well, what happens is usually one of these services goes down. We didn't properly plan for failure cases, or what can also happen too, is we realize that our business services, we've defined them a little bit too granularly. So we actually need to combine microservices together in and of itself. This is not a failure of microservices. What it is a failure of in all the three that I've mentioned up to this point, is the fallacy that somehow there's one particular approach that will help us solve our problems. And it's a lie that we keep telling ourselves over and over again, that even though we've seen this never work before in the past, we felt it. We have scar tissue. In some cases, I'm talking but abortly, but we have scar tissue. We remember what it is like. We always tell ourselves this lie, that sometimes this new thing that I'm trying, it will be different. That if I just purchase this one product, it will digitally transform me, even though I have never seen that happen in the past. And we tell ourselves, this time is going to be different. That's reason number two. This time will not be different. You are going to wake up exactly the same team, exactly the same people with exactly the same idiosyncrasies, the same worldviews. Everything about the teams that you will be working digitally transform, everything about your customers that you are trying to transform, they will be exactly the same. This time will not be different. So what do we do? We have to plan accordingly. Here's the fun part. How do you do that? How do you plan for a digital transformation where, you know you're going to need to do something different than you're doing right now? You're going to need to figure out different ways of thinking about things that maybe you haven't thought about in the past? Well, first of all, you need to define what a digital transformation is. And honestly, if you've never jumped to it before, it's kind of like that first year of marriage where raise your hand if you made a few mistakes during your first year of marriage. I am very culpable of that. You kind of have to figure it out as you go. But we can look for how other companies that have gone before us have done things and not always emulate exactly what they've done, but try to figure out why it is that they did the things that they did, why they chose that path, and what made them successful. And from that, let's work backwards. Let's figure out how it works in our particular industry, our particular business, our particular problem. So the first case study that I want to bring up is DHL. They did market research on their customers, and they figured out what made their customers choose them instead of one of their competitors. They tried a couple different things. They saw some things that worked, some things that didn't work, the basics of agile. In any given organization, you kind of got to figure out what works and what doesn't work. One of the things that they discovered was that people like to know where their packages are, which, as someone who occasionally orders things through DLL, excuse me, DHL, I can attest to, but what people don't like is having to talk to other people. We live in a digital age. We like to be able to do everything that we possibly can on our phones. I have very a couple of members of my family that if they could get away with never talking to anyone other than their immediate family, they'd be totally happy. So let's stop saying these people are wrong and let's embrace it. Let's figure. But how to bring them into the fold? How do we engage these kind of people? Because they're becoming more and more ubiquitous. What DHL found was if they create a chat bot, something on their website, it can be both on desktop as well as mobile. And that's an important point, because they found out most of their customers actually preferred mobile. They could have the chat bot interact with the user. The user could tell it, here's my shipping number. Can you tell me where my package is? And it could even tell them where their package was. They can schedule on demand deliveries where you could say, oh, you're projecting it to deliver it on this date, but I'm actually going to be out of town. Can you maybe deliver it same day next week? Or is there any way you can move that delivery day up? They could even have people, the chat bot, generate QR codes for labels so that they don't have to go to the post office, they don't have to take extra steps. You know what's funny is when they did that, they found their customer satisfaction scores increased and their profits increased. People had a more pleasurable time dealing with this new digitally transformed DHL than they did with the previous ones. Now they're still experimenting with new things. They're actually one of the companies that are really on the forefront of using blockchain, which in their particular domain, it makes a lot of sense. They have packages that go all over the place, and having an immutable ledger of where these current packages are, that's a pretty compelling use case. But not every company is going to be able to get away with a chat, but it really depends. This is kind of a sneak peek of what I'll be talking about in a little bit. It really depends on who your customers are, where they are, what they want, and what you can do to meet in the middle. Now, the second company in this case study is Disney. They have done a ton of work in the digital transformation sphere, and I can attest to it. I was at Disneyland at the end of 2021. There were so many new offerings that we almost had to find guides online to figure out how to use all these different features, all these different apps just to get in there and get in the park. We found good tips about making sure that we had battery packs and solar chargers and logging into the same accounts ahead of time. Genie is one of their best enhancements that they've ever done because it allowed us as consumers to plan our day. We could say, well, we know we have two little kids, so they're going to get tired around noon or 01:00 so we're going to have to go back to the hotel. So let's figure out how much walking we can do in the morning and what are the rides that are closest to us that have the lowest wait time? Because they were seven and three at the time, my daughters, and we knew that they would get bored really quickly if we were standing in a line. Disney spent enough time to figure out that that has one of the critical features that that was built into the mvp. I'm sure that they have a huge laundry list of things that are on their backlog that they could have implementing, but because they understood their customers, they went through and they only implemented things that were the absolute most critical that would provide the best value. Disney, along with other digital transformation features, they actually have a program that not a lot of people know about where their executives have to spend time every single year dressed up has a cast member, so you never know if the person that you're taking a picture next to that's in a goofy suit. I mean, not like Goofy has in silly, but goofy as in Goofy, the character that might be a vice president or a senior vice president. They have to go and they have to live in the lives of the people that they serve. They get to interact with the customers. They have to stay in character all day. They get to really understand what that experience is. Now, not every organization has the luxury of doing that, and that's totally fine. There is one, however, near and dear to the heart of a lot of people that I work with, because they get gasoline from there and they get pizza from there is Casey's. Casey's, if you haven't noticed, has gone through a rebranding and they're looking holistically at all the different aspects of their business. And there are two things that they found in particular that apply to a digital transformation. The first is that they had a lot of different systems that tracked their customers and none of these systems were talking to each other. So they drew a line in the sand. They said, we need one particular platform, whatever it is, where all of this transformation is going to be gathered, so that we can run reports off of it, so that the light of the people that need to do analytics and business intelligence aren't so painful. They chose Salesforce, and I'm not being paid by Salesforce to say this. I'll just say it's a very popular tool that I've seen a lot of different organizations that I've personally worked with use for this particular type of digital transformation. There's other ways of doing it. You could have single pane of glass applications where even if you have an EMR and an ERP and a CMS, they all tie together and they all appear to the user as one particular, very unique, very atomic application. Even though under the covers it might be retrieving data, it might be sending data, it has that layer of abstraction that allows us as humans to focus on one thing and one thing only, and leaves it to the technology to figure out how to do this kind of reconciliation. The second thing that they learned is that once they had all this information, what are the things that their customers really care about? You know what people at Casey's really like even more than gas that is cheap, they really like the pizza. I can't tell you how many times we have gone, and this is not an advertisement for Casey's. It's totally not. I'm not being paid by them, but they want to send me some bitcoin. I'm not going to complain how many times people have gone there and raved about the breakfast pizza. That pizza in particular has a ton of love. So how can they lean into that? They don't need to diversify. They don't need to go into all the other pizza derivations like calzones or hot pockets. But how do they maximize on people's love of Casey's pizza? You know what they did? They came out with a triple pepperoni pizza. Now, you might not think that's a digital transformation, but it is because they were using technology to figure out how to transform their business. And the insights and the analytics that they gained from having that single pane of glass allowed them to increase their revenue. And here's the fun part. In all those three examples, you'll notice I didn't name one particular director, I didn't name one vice president, I didn't name one CTO, one CEO as the rock star. A digital transformation, yes, I will agree, has to start from the top, be agreed to. This is our new priority, full stop. We need to figure out how to do this, and it has to be implemented on every single level below. But when you get to the very, very last level, that is where the digital transformation is actually felt. So it's sort of a paradox. The CEO and all the leadership has to agree this is what we're going to do. But the people that are actually at the center of a digital transformation are not the people at the top. It's the people at the bottom, so to speak. It's the customers. The end user is the star of the digital transformation. Because every business no better if you're in b to b, b to c if you're in fintech, if you're in web three, if you're in AI. We're only here because there is an end user that has a problem, and they are willing to pay us to solve that problem for them. So we need to, as an industry, stop thinking about ourselves as these amazing people that have been gifted from on high, that are allowing people to communicate in new and exciting ways. No, the end user, the customer, the person that is actually using your software, is the one that you need to be focused on, and you need to be borderline obsessed with learning, has many things as you can about these people, about what it is that they want, about probably what it is that they don't want, about what you do better than all your other competitors, and you can use technology to do that. That is the heart of a digital transformation, you can do it in many, many different ways. Probably the most popular way is through user experience. You can go through, and this is an investigative report that Forbes did. For every dollar that you spend on learning about user experience, this could be in reasons, this could be in write alongs, this could be any number of different ways that you're learning about users. But every dollar that you spend in user experience, it's a hundred to one return. I mean, you'd be silly not to do it. Now, in the three examples that I gave previously, DHL, Disney, Casey's, they're all in different sectors. They've all done completely different things. They all have potentially different customers. But they found at the very core of it, the fact that the customer is the one that truly drives their innovation, and they are the ones that are getting into the customer's head, figuring out where it is they need their business to go. Software, as much as we don't want to admit it, it is a game of catch up. We are always going to be behind the ball. We can try to figure out where the industry is going, but we are never going to get in front of the business. So let's stop telling ourselves the lie that we will somehow get in front and instead think about what are some of the different ways that we can embrace that. What are some of the different tools that we could use to get into the heads of our users. Write alongs are honestly my favorite. If you ask any software developer what their favorite part of the process is, I can almost guarantee it's going to be the times when you've gotten to sit with a user that is using what you're producing. We have metaphorical blood, sweat and tears in the applications that we build. We spend hours of our lives. We spend time away from the people that we love the most, our families. Unless you have the privilege of working from home. My two kids, I mean, it sounds like a war is happening when I'm at home, so I have to work from an office just to get any work done. But even for those of you that work at home, you still have to focus. You're taking time away from the people that you love to work on an application. You're sitting behind an ide for 30, 40, 50 hours a week. You care deeply about the products that you deliver and being able to see someone use it, being able to see someone delighted or see someone frustrated. There's a level of empathy that we need to tap into as software developers and software practitioners that we aren't and doing ride alongs is one of my favorite. Carmax actually does this really well. They do studies where they have their development teams and everyone sort of sit and just go on mute and let the end users talk. But what it is that they like and what it is that they don't like now there is the potential for a Rashimon effect where everyone can have completely different interpretations about what it is that the users liked and what they didn't. And that's okay. Software is great. Not when it's a lone wolf developing in their basement encoding all through the night with too many red bulls or that new panera enhanced lemonade that has 1200 grams of caffeine. No, it's done by a team. And so even if you have conflicting views, that's fine, embrace it. Figure. But how you can get to the root of what the user was actually talking about. And there is no one single role that is responsible for this. I'm a firm believer that the earlier you can have software development product owners and architects and be has involved in the process, the better the project is ultimately going to be. But no matter where you involve them in the process, it's something that we all have to do. It is 2023, as I speak to you. We have rovers going around on Mars. This is something that we can do. This is not rocket science. This is extremely simple. It just has to be prioritized. And we have to understand that a user is at the heart of everything that we do. There's many tools, there's many techniques, if you've seen the slides that have been going on as I'm talking. But at the end of the day, it's the software development team that is the one that is responsible for delivering the digital transformation. It has to be prioritized. Don't get me wrong, it's the development team that actually does the work. And this unfortunately is the fourth reason why I've seen digital transformations not work. So you have the wrong people on the bus if you have not to pick on them. Managers that have been in the business for 2025, 30 years, maybe they grew up as being developers on a mainframe. And their entire mental model is revolved around the mainframe. The mainframe and the mainframe, if you talk to them, and all they can talk about are the glory days of the as 400, they may not be the right people on the bus because what we're talking about with the digital transformation goes beyond any particular software stack, it goes beyond any particular language, it goes beyond even any particular SDLC be it safe or agile or scrum or waterfall. It goes back to what we're doing here. It goes back to why we are even here. We are here to serve an end user. If we don't understand who that end user is, if we don't care if we think that the end user is at best an inconvenience, we got the wrong people on the bus. So we really need to take a hard look at what are the strengths and understand what are the weaknesses. What are the mental models of everyone on those low level, I say low level closest to the client teams, and if we have people on there that maybe their mental model can't be stretched to understand what we're doing, we might need to have some difficult conversations. Now, in any large organization, there's inertia. Inertia, I would honestly say, is another word for culture. This has always been the way that we're going to do things, and any derivation thereof is not allowed. People, we kind of get in a groove. We like to do things the same way. You talk to someone who's been developing software for 30 years, chances are at around year ten or 15, they found a way that they like to do it, and that's going to be how they want to do it from here on out. When you do a digital transformation, you have to leave that kind of childish mentality behind. I say childish because I have that mentality sometimes too, so I totally get it. You might have to get the wrong people off the bus, and you might have to get the right people on the bus. Now, no matter what it is you choose to do, I can guarantee you that it's not going to be easy. But once you get the people that are not going to move you forward off the bus, and once you get those people that are going to help you, the people that are going to be obsessed about who your clients are, the people that are going to spend night and day thinking about what are the things that really work well and what are the things that don't work well. When you have people that truly care, that have an enormous amount of empathy for your end users, you're going to find that almost everything else will sort of take care of itself. So, to recap, when you hear digital transformation, don't buy into the hype. Don't just look at what other people are doing. Don't just look at what other tools people are doing and think that if you somehow purchase those tools, you yourself will be the rock star of the show, because you're not. Because if you're doing a digital transformation for yourself, you will never be as successful as if you focus on who the truly important people of the digital transformation are, because it's your customers, it's your people. And until you can get the wrong people off the bus, get the right people on the bus, you're always going to be hitting up against that inertia day after day after day. So we have to, from the top, understand that this is going to be a priority. Make it clear constantly, possibly over communicate the fact that this is now a priority. We need to embrace the fact that people are on mobile devices. We need to embrace the fact that our customers want us to do things that we're currently not doing. And if we don't, our competitors are going to do it better than we are. Once you get to that state of customer nirvana where you are constantly thinking about what is their life like, what process can I solve for them? It doesn't always have to be technical. As I mentioned with the example with Casey's having a pizza with not one, not two, but three different types of pepperoni, that kind of insight, that kind of knowledge, that increase in revenue was only possible because they had a digital transformation that allowed them to see it, to see it so clearly that they could go out and reach it and potentially taste it. I haven't had one yet, but from what I hear, they're fantastic. So again, my name is Zach Gardner. I'm the chief architect here at Keyhole Software. I've helped two, three organizations with their digital transformation. I've seen it go well. I've seen it go not so well. I hope you found this presentation insightful. I know I've had a lot of fun delivering it, but I need your feedback. So scan the QR code, let me know what are the things that I'm doing well. What are the things that I need to work on? And if you agree with me, scan the QR code. Let me know if you disagree with me. I also want to know as well, because there is not enough time in the day. I wish there were more than 24 hours, but at last there is not. And our customers, we are real people. I am a customer and I am also a provider of software services. I want to help solve people's process through software. I think it is such a unique opportunity that we have and a lot of these other presentations at Conf fourty two that you're going to be listening to, they kind of touch on this. Software is one of those unique fields that allows us to do things that we thought potentially were impossible. We can scale solutions to business problems to be able to solve people's problems while we sleep and as far as I know there's very few other fields unless it's the building of roads and the building of buildings that can anywhere close to how tactile and how tangible we can get with these solutions to our problems and allow them to scale and we owe it not just to ourselves and honestly not just to our bottom lines because if you're thinking like that you're going to fail. We owe it to our customers, we owe it to the real users to stop thinking about things in the way that we used to just because there's momentum and truly start to understand what it is and where they need us to go what are their problems and how can we provide those solutions again my name is Zach Gardner, chief architect at Keyhole Software. Thank you very much for my presentation and I hope you enjoy the rest of 42.", "words": [], "utterances": null, "confidence": 0.958510999241558, "audio_duration": 1939.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Zach Gardner is the chief architect at Keyhole Software. He says he helps companies digitally transform by focusing on user centric applications. Gardner: Four reasons comp 1234, why digital transformations usually fail, and how you can be successful.\n- Digital transformation seems to be on the top of everyone's minds. There is no single tool that will allow you to digitally transform your business. Every single business is unique. What it is not a failure of microservices is how you apply it to a particular problem.\n- DHL found if they create a chat bot, something on their website, it can be both on desktop as well as mobile. Not every company is going to be able to get away with a chat, but it really depends.\n- Disney has done a ton of work in the digital transformation sphere. Casey's has gone through a rebranding and they're looking holistically at all the different aspects of their business. They chose Salesforce for their digital transformation.\n- Software development team is responsible for delivering the digital transformation. We have to understand that a user is at the heart of everything that we do. The earlier you can have product owners and architects involved in the process, the better the project will be.\n- Zach Gardner: I want to help solve people's process through software. Software is one of those unique fields that allows us to do things that we thought potentially were impossible. We owe it to our customers to stop thinking about things in the way that we used to.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.07, "text": "other people", "timestamps": [{"start": 617432, "end": 618434}, {"start": 1694688, "end": 1695114}]}, {"count": 2, "rank": 0.07, "text": "digital transformations", "timestamps": [{"start": 44556, "end": 45778}, {"start": 1492556, "end": 1493762}]}, {"count": 1, "rank": 0.07, "text": "other digital transformation features", "timestamps": [{"start": 848512, "end": 851478}]}, {"count": 1, "rank": 0.07, "text": "other tools people", "timestamps": [{"start": 1696608, "end": 1698122}]}, {"count": 2, "rank": 0.07, "text": "real people", "timestamps": [{"start": 118616, "end": 119586}, {"start": 1853012, "end": 1853742}]}, {"count": 4, "rank": 0.06, "text": "different ways", "timestamps": [{"start": 520952, "end": 521522}, {"start": 1206676, "end": 1207310}, {"start": 1227212, "end": 1227734}, {"start": 1291244, "end": 1291862}]}, {"count": 1, "rank": 0.06, "text": "many things", "timestamps": [{"start": 1187612, "end": 1188214}]}, {"count": 1, "rank": 0.05, "text": "new things", "timestamps": [{"start": 711412, "end": 711918}]}, {"count": 1, "rank": 0.05, "text": "different organizations", "timestamps": [{"start": 957188, "end": 958026}]}, {"count": 1, "rank": 0.05, "text": "different systems", "timestamps": [{"start": 923352, "end": 924734}]}, {"count": 1, "rank": 0.05, "text": "other ways", "timestamps": [{"start": 963338, "end": 963774}]}, {"count": 1, "rank": 0.05, "text": "different sectors", "timestamps": [{"start": 1246592, "end": 1247622}]}, {"count": 1, "rank": 0.05, "text": "software services", "timestamps": [{"start": 1856228, "end": 1857280}]}, {"count": 1, "rank": 0.05, "text": "different cadences", "timestamps": [{"start": 377212, "end": 378310}]}, {"count": 1, "rank": 0.05, "text": "software development teams", "timestamps": [{"start": 175778, "end": 177298}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}