{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/5f7a9808-8cef-4366-93db-2ce8d5604677", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["absolutisms", "agile coach", "algorithms", "allows", "arinnia", "be", "become", "best", "business", "can", "challenge", "collected", "concretely", "conf fourty two", "conflict", "decisions", "emphasizing", "experiments", "felice pescatore", "from", "inspearit", "intelligent business agility ai", "operations", "presenting", "process", "processes", "project", "prudent", "represents", "revising", "skills", "supports", "teams", "those", "transformation", "treasure", "turning", "validated"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "d56af49d-b33b-4203-ae44-1e7cb8eb0f30", "status": "completed", "error": null, "text": "Hello everybody. Become to this talk. This treasure related to the intelligent business agility. So before to think about intelligent, we needed to understand why this can be very, very important for your organization, for your company. And the idea here is that you need to find a way to align, to create a bridge between the strategy and the execution. Those is very important because sometimes in the real world, it's very, very hard to transform your ideas, your approach to the market in a way that can be really executed by your organization. And this can create a very gap, a very problems between what you think to do and what you really achieve during your activities and in the way in which you can support your customers. And for that, it's very important to have in your mind that your organization must follow, must achieve what we typically call business agility. What is business agility? Business agility is an ability of an organization to fast adapt itself to the market. And those ability related to those ability to change in a very fast way, but in a very cost effective ways. Those transformation of your environment shows also you need to have a great focus, a great capability to produce a very, very good product, a very quality product. And in case you must focus your attention to the technical agility. So business agility is built on process agility, enterprise agility and technical agility. This is a great point. Sometimes in the lecturer tools you can find that business agility is the same than enterprise agility or process agility is not true. Business agility is those full vision of agility of your company in relation to the market, in operations, to your customers. But you needed to be focused to make a great attention, to also have all of these three pillars, agility themselves. In that way you can try to create the right mix, the right balance between them and between all the activities, all the initiatives that you can approach to achieve those final results. So enterprise agility means that you can have your organization focused on what really is important. And you can do that having for example, grid leader inside your company, thinking about to going beyond budgeting. So thinking about how I can founding my solutions, my budget teams without have a so bureaucracy plan. So bureaucracy approach to the budgeting. Something like okay, we needed to create the budget for the whole year, but we have no way to change it. That's not correct. We needed to have a flexible way to adapt the using of our founding to create our budgeting in relation what really happens during the day by day activities and supporting what really create value for our customers and our company. We needed to be agile, we need to be lean, it's important that because actually agile lean can be the most powerful tool that you can use to achieve the enterprise agility in relation to business agility. And sure you must think about value stream before projects because value stream is something that it's very very continuously live in your company. It's not something that starts and ends in a specific time, but it's something that continuously is attention inside your company to create values, continuous value for your customer. And the second point, technical agility. There is no way to achieve the business agility without technical agility. This means that you need to be excellent in what you do and the way what you do something. So you can use different framework, different practices, but it's very important to create your own approach, your own mix of all of these to really, really achieve technical agit. And also you must be excellent in technology. Select the last solutions and so on. That's very, very important. And list but not last process agility. You can identify how support in a practical way this transformation using frameworks inspire yourself to toolkit create a mix also in the way that you really, really apply those concept of a culture, innovative culture, learning culture in a very pragmatic way. For example, you can decide to use scrum or kanban or something like this. It's not so important to be the best in the world to adapt, for example scrum. But it's very important to create a tailoring of all of that in the way that can really support your goals like company. And here the idea is that you needed to innovate, you needed to transform your company, you needed to start to think in a different way, how you can guide your organization and you can lead your organization to achieve these results. And we need to change, you need to change. And to do that, one of one model that can support you is related to the eight steps process for leading change suggested by Dr. Cotters. These are a set of eight steps, but the most important for starting the flame for start a new transformation is the creation of a sense of urgency. When you can create, when there is a sense of urgency, every time that you are sure that you view that something that you are doing from a lot of years is not helpful, it's not still helpful for you. So you need to think something different, a different way to work. And sometimes when all the things are okay, is very difficult to have a real commitment in a transformation because those people doesn't understand why change if all is okay, when different products, different actions doesn't go well, you can have more support for those I'm not suggesting to create a problem problems inside your company, but I suggest you to have a very good attention to what happens in your company. Identify when can be a good time for start and when is the moment to really reinvolve the company, the organization to something different. Because change have a cost and you need to motivate that. And you can measure to use a disciplinary job approach to change. What it means with that is an idea that there is no right model for everyone. There is not the right framework for everyone. But you must think something like creating options inside your organization. And you can use those until metaphor for that. For example, you can imagine that in your company, every one of you is an ant. And every one of you and everyone of those ant, every ant transport an option transport something that can be helpful to improve your antil. If something is not correct, if something is wrong, no problem. Because you have your colleague and yourself can select a different option to have a very real improvement. Not one improvement, but a real improvement. In this way you can be fast in change. You can be sure that one local failure is not so big, but you can learn from it. And you can select in a fast way a different approach coming from a very, very restrict number of selection, because you are learned from your failure before, from your experiment. So small experiments are better. Yes, that's true. And you can imagine that you have a pragmatic approach for that. Define a starting model, defining an idea, identify the first candidate option to adopt, presenting an MVC, a minimum viable change that you can use for experiment something different with a metrics that's very important that you can use to measure it. So after you apply this MVC, after you experiments this MVP, you can measure the outcomes and identify if the new idea, the new option is in line with your expectation. And if yes, you can accelerate the adoption of those new option, these new practices and so on. If not, you can go back identify new MVC or if needed, you can change the plan because you are totally out of the scope that you before image to follow for improve your organization. And you can best all of that with the using of the artificial intelligence. I yes, that's true. Because if we go back to this slide, one of the steps is related to measure outcomes. So that means that you have data and you needed to analyze this data. And you know that people are not so good in analyzing a very, very big amount of data. So in this case, you can use I to improve your capability to analyze this data and reduce the number of options that you must consider for your new improvement. The heart is to succeeding fast, succeed faster. That means that using machine turning, using big data, using ie, you can receive suggestion from models, algorithms and so on that can be useful for be faster, identify the right option to achieve the better results in aless time. And that's very, very interesting. So for that I created the idea of the intelligent business agility. And this IBA does mean that you can use all of the data that you can collect inside your company to support an organization achieve its business agility. And the right definition here is that IBA represents the ability of organization to develop an adaptive corporate culture supported by intelligent agents that are able to support people to enable more fast decision. And that's very important because it's not something that remove the needs of people, but support the people in their decisions. So how IBA supported in the presenting GDT, collecting information coming from customer, so we can have more data from customer, coming from example, I don't know, from social networks and so on to support, how to support in presenting how customer are looking for us and what is our brand reputation in their minds. So we can use this data for supporting innovation because we can select new ideas, new products in relation to the data that we collect from a lot of sources and in the commitment. Why this? Because in those way we have a total sharing of information, data, different point of view collected in different analysis, used for different analysis that can support different people inside the company. We can use also ie for supporting the technical agility, because we can use that to align your technology choice to the real needs needed solution. So we can really understand measure in some way if we are in the right path to use in an efficient way our technology and if this technology is the right one to achieve the right goals and create the right products. And also we can use for example, data for maximize the capability to use better way our technical skills and improve step by step, all of that. And we can use also a to support process agility. Sure, because we can use it for monitor what happens inside the different teams, how their mature level improvement, for example, across different iteration, across different sprints and so on. We can use that for accelerate their growing. For example, they can measure, for example an IBoT can identify view the different trends for I don't know how time you need to create to have a daily inside your team and suggest you few standard approaches to use better the time and to reduce the wasted time inside it. And it's very important to have accuracy so you can have a really important way to really identify step by step what is your real possibility to achieve the IDL goal. And I suggest you to few practices that can improve the opportunity to improve yourself in the right direction. Two principles are at the basis of IBA, empowering and inclusive and data driven. Empowering inclusive means that you must create a learning culture and a culture based on sharing and collaboration. That's very important because you needed to share and you needed to also use the data, not just for the personal, just for the personal goal, but in relation to holistic goals, company goals. And it's very important that also you use in the right way with the respect those data, this data with the respect of the other people and for protect their privacy, their identity and so on. Also you must be sure that you trust this data to transform them. Not just something like an additional tools, but really base your decision on them and on the other side, data driven. You must be sure that all the company people can access in a very fast way, in a very simple way, all the data across the organization. And you need sure to have rigorous data practices to be sure that the data that you are using during your analysis and for support ABI are good data and not the bad data. So what can be four Edel steps to go ahead with your implementational journey in relation to ABA. So you can start but those foundation from the foundation point. At this point you are asking yourself if you have those good data and if your expectation are satisfied or not, what is your level of digitalization and what are your capabilities, analytic capabilities to use this data to create real information, not data but information for supporting decision inside your company. The second step is the approaching step in you can start image what can be the promises that can be outside from the using of this approach. So you can starting create the right platform, the right digitalization inside your organization to use those information. You will start looking for how you can increase and optimize the process. And sure you must be also aware in how you can distribute in some way. You can give the right information to the right people. Those next step is aspirational. So in this case you will experiments and apply to really a BA at all level of your organization. And in this case you can identify how you can use that to improve your lifecycle, your management and so on and building and how to build the foundation for that architecture. At the fourth stage of your journey you can imagine that you will be mature and you have really created a continuous learning organization with a high digitalization and a real, real trust in the BI, IBA and for this you will trust the information. You are sure that your system will give you a real important information to support your organization, to improve itself. And for this you will have two main guidelines to implement your journey. The first is those stair guideline. So security and privacy, this is very important. You must be sure that you will have security and privacy about your data. Transparency, accountability, inclusiveness and reliability and safety. So security and privacy, how I said before is a very, very important point because you need to be sure that data are managed in the right way and you must be sure that you protect your data from external attacks, from misuse of them. And that's very, very important because if you grant this, you can be sure that your people will trust it. And we collect a good amount of data and the right data to support you in the business. Intelligent business, agility, AI and those transparency. This is another important pillar because you must be sure that you are very transparent in using your data, in how you can share the key elements of that. And you must train your people to use the suggested action coming from bots and other type of ie just for support them. But the final decision will be theirs. Not coming, not automatic decision coming from these tools, accountability. So these people must be in charge for maintaining the responsibility over ever decisions that we will take based on this data, on this information. So it's not remove managers, it's not remove team lead, it's not remove developers here. The point is that you need to use that to give to these rules, those people new tools on which they can take their decisions in a better way, in a more informed way, in a more specific way. That's the point, inclusiveness. So you need to remember that it's very important to have a respect for all the sources and use all the information in a holistic way. So it's not a way to divide people, separate people, but it's a way to clue people, to link people between them. And every information coming from the different people are very, very important to grow in a very, very inclusiveness way and the reliability and safety. That's true. You must be sure that you are using the right data in the right way with a good supporting systems that can assure you that the system will be available when it's needed, and not just one time every week. For example, something like this. The system must offer you a good slA, a good availability to support you every time you need its support. And also give you few pushes about something that you forgot or something that you doesn't see your own. So the second guideline is to use the agile a approach and this is based on four main experiments. Get started with those pre built I doesn't create from scratch your solution, please select a standard solution coming from the market. Identify the right one. For example, you can use a lot of machine learning algorithm coming from a lot of cloud services provider and so on. Leverage development tools. That means that when you start in the implementation of your absolutisms or you are starting in the customization of prebuilt solutions, your point is to invest on these tools and be sure that you can reinforce them. You can support their evolutions because this is a very important investment for your organization and you must be sure that you will take all the Roy that you can extract for them. Develop by people, for people. Remember that this approach is not related to create automation without people. Is thinking to create tools that can suggest to other people how to use data, how they can improve those company activities, company roles, company improvement using data coming from internal, coming from the internal environment and from the external environment. So when you create these tools, when you select these tools, you must think that these tools are for people, not for machine. And you also must be sure that you create that your I must be ready for data state. And that's another good point because it's very important to have the right data and can data in our activities because without that we can have the risks that we will select too much time, the wrong choices, the wrong options for transform ourselves and that can create not an efficient way to improve our organization. So thanks to listening, thanks to arrive at the end of this presenting. If you have a more curiosity about that, you can contact me on LinkedIn, on other channel and enjoy the conference. And I hope to see you soon in other conference and also in presenting if this is possible. Thank you so much.", "words": [], "utterances": null, "confidence": 0.937482837796241, "audio_duration": 1608.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Business agility is built on process agility, enterprise agility and technical agility. You need to find a way to align, to create a bridge between the strategy and the execution. These are a set of eight steps, but the most important for starting a new transformation is the sense of urgency.\n- The idea of the intelligent business agility is to use all of the data that you can collect inside your company to support an organization achieve its business agility. Two principles are at the basis of IBA, empowering and inclusive and data driven. Four Edel steps to go ahead with your implementational journey in relation to ABA.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.07, "text": "different people", "timestamps": [{"start": 837840, "end": 838618}, {"start": 1381548, "end": 1382518}]}, {"count": 2, "rank": 0.07, "text": "good data", "timestamps": [{"start": 1052516, "end": 1053182}, {"start": 1080572, "end": 1081302}]}, {"count": 1, "rank": 0.06, "text": "more data", "timestamps": [{"start": 783676, "end": 784182}]}, {"count": 12, "rank": 0.06, "text": "business agility", "timestamps": [{"start": 28290, "end": 29538}, {"start": 97760, "end": 98790}, {"start": 99248, "end": 100082}, {"start": 100166, "end": 100922}, {"start": 137548, "end": 138550}, {"start": 154196, "end": 155082}, {"start": 159348, "end": 160426}, {"start": 262228, "end": 262942}, {"start": 291232, "end": 291974}, {"start": 731522, "end": 732466}, {"start": 743632, "end": 744810}, {"start": 1265368, "end": 1266610}]}, {"count": 1, "rank": 0.06, "text": "big data", "timestamps": [{"start": 707810, "end": 708510}]}, {"count": 5, "rank": 0.06, "text": "technical agility", "timestamps": [{"start": 136396, "end": 137234}, {"start": 145824, "end": 147238}, {"start": 286860, "end": 287990}, {"start": 292400, "end": 293302}, {"start": 844368, "end": 845382}]}, {"count": 2, "rank": 0.06, "text": "better way", "timestamps": [{"start": 876584, "end": 877414}, {"start": 1346064, "end": 1346698}]}, {"count": 4, "rank": 0.06, "text": "process agility", "timestamps": [{"start": 142768, "end": 143766}, {"start": 157588, "end": 158314}, {"start": 326988, "end": 327890}, {"start": 887228, "end": 888142}]}, {"count": 2, "rank": 0.06, "text": "other people", "timestamps": [{"start": 1009364, "end": 1010110}, {"start": 1515768, "end": 1516754}]}, {"count": 4, "rank": 0.06, "text": "enterprise agility", "timestamps": [{"start": 143878, "end": 145142}, {"start": 156308, "end": 157290}, {"start": 190880, "end": 192246}, {"start": 260708, "end": 261482}]}, {"count": 1, "rank": 0.06, "text": "different products", "timestamps": [{"start": 468150, "end": 470002}]}, {"count": 1, "rank": 0.06, "text": "different practices", "timestamps": [{"start": 304394, "end": 305870}]}, {"count": 1, "rank": 0.06, "text": "different framework", "timestamps": [{"start": 301668, "end": 304298}]}, {"count": 2, "rank": 0.06, "text": "different analysis", "timestamps": [{"start": 832890, "end": 835410}, {"start": 836268, "end": 837026}]}, {"count": 1, "rank": 0.06, "text": "different actions", "timestamps": [{"start": 470136, "end": 471410}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}