{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/3ad7da9c-0c46-438e-bd38-a3fcbf1d37a1", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["billing", "building", "conf fourty two", "consulting", "developers", "extroverted", "feet", "hints", "looks", "matt harrison", "metasnake", "persons", "python data science corporate trainer consultant", "skills", "started"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "c72c7b80-c0e5-4a05-9eb2-3be372c02566", "status": "completed", "error": null, "text": "In and I'm going to be talking about consulting for introverted developers. A little bit about me. I used to work in the Bay area. I went to school out there. So I worked at various startups and I moved to Utah. I ran the Utah Python user group for five years, and I'm the author of multiple Python and pandas looks. And for my day job I do corporate training and consult team through a company called Metasnake. The goal of Metasnake is to get people understanding Python well, but also get them up to speed with the Python data stack. I also do various consulting as well. So I'm going to talk about some of the stuff that I've done and how I got to be where I am right now. I live in Utah, as I said, and some of the things I like, like I like skiing. In fact, I went skiing this morning and I like hiking around, being outside. Picture on the right. Here is a picture from southern Utah of where I live. It's fabulous and beautiful. Some of the things I don't like, like I don't particularly like doing cells. I don't particularly like being in large groups. I'd prefer to be in small groups where I can have a more one on one talk rather than conversing in a group and trying to talk over other people you might think, know, why should I listen to Matt? You might not want to listen to me. Right. Let me just give you my background. I think you should be wary of anyone you take advice from, and you should know where they're coming from. So my background, I'm a white man, I have four kids. So I'm not someone who's working all the time. I like to be around and hang out with my kids, and this is my story. Right. And there's no guarantee that what works for me necessarily works for you. The idea with consulting is that people are going to pay you for your expertise. And my goal here is not to necessarily convince you that you should be a consultant, but just talk about my journey and maybe inspire you to think about some things that you might want to do or might want to take advantage of in your job as a technical persons. So why is consulting nice? Well, it pays pretty well. I have complete control over my time. Like I said, I went skiing this morning. It's a little bit harder to do that when you work for someone else. And I have control over what I do, which can be a good thing and a bad thing. So why might you not want to consider consulting? Well, if you're extroverted. If you're not super thrilled about being in front of people, then you might not want to do the sales or marketing. Right. A lot of software or technical people think that marketing is this slimy word, and you should avoid marketing at all costs. Also, I run a small company, and running a company has a lot of things behind the scenes that you don't necessarily know about, but that can take a lot of time as well. And you might realize that we're now in a global workplace, and you might be competing for work that people in other places can do for cheaper quicker than you. So some would call that a race to the bottom. Might be that a traditional job is better for you. So if you are considering going this route, sort of the first steps that I would recommend would be to get an accountant. It's amazing what someone who is trained in some of these things can do. And I think it's kind of silly that you need to get an accountant. You don't need to, but I would highly recommend that. Again, I am coming from a us centric point of view, this may or may not apply in other places. And in the US, you'd want to form an LLC just to have some protection about that. Again, I'm not a lawyer or an accountant. Talk to your professional service provider here, and then I would list that on LinkedIn. Why would I do that? Well, it's just nice to have you associated with some consultancy or some company or group that's yours instead of someone else's. And then when people are browsing your profile, they'll see that even if you're working for a company, they can see that, hey, this person might be doing things on the side. Right? And that might turn off some people, but it also sort of puts a stake in the ground and lets you say, if you want to hire me, I've done this in the past, and if you want to hire me full time, right, I might do things on the side, and hopefully that's kosher with them. If you decide to legitimately go off and do your own thing, especially in the United States, I would say, go find a health insurance broker. Again, it's sort of silly, but these people can pull strings that I can't do as an individual, take advantage of people who are professionals, and leverage those, rather than trying to be cheap or save time by doing things yourself. It turns out they save you both time and money. Okay, so there's this Venn diagram of data science by Drew Conway. It says, like, data science is a combination of stats, programming and expertise. So I'm going to riff on that a little bit, and we're going to talk about consulting. And I'm going to say that there's kind of three things about consulting that I think are important, and that is your attitude. And then investing, investing in yourself and others. So the Remy meter of this talk will basically go over these three things. Hopefully you can glean some insights from it. So let's talk about attitude. First of all. First of all, I think it's great to have what we call an abundance mentality that there is more than enough work to go around right now. It's sort of a weird time. Like, there are companies doing layoffs, but there are also companies that are hiring. And before the layoffs, there was all of these reports of, like, there is not enough people to do the work. And so if you are a professional and you know how to do work, oftentimes companies are willing to outsource that. And even during times when people are getting laid off, oftentimes they might have small jobs that they don't want to hire someone for. So getting a consultant often makes sense for these companies to hire that work out. But if you have the attitude that there's no work, I compete me with everyone else, that's not going to take you very far. I firmly believe that even with the advent of things like AI, there's a ton of work. I have more work than I can do, and there's plenty of people looking for smart people to help them do work. Here's an example of attitude. I'm going to tell a little story. There was this young man whose friend was speaking at all the conferences, and this young man wasn't. And so I decided I want to speak at conferences. I mean, this young man decided that. So I started working towards that, right? And it was just at first I was like, watching this person who was a friend, I'm like, oh, that's cool that they get to do that. Why don't I get to do that? And it turned out the reason why I didn't get to is because I didn't put myself out there, right? So I have to have a mental shift to be able to do that. I will admit I am, like I said, introverted. I really don't like crowds of people. So in general, like, going to a conference, it's kind of a waste of time for me to just go to a conference because I'm generally not one to want to go, hey, let's get a group of people and go talk. And that doesn't really interest me. I'd rather, like I said, talk to sort of really small groups, one or two people, three or four people, but not 20 people, and sort of try and fight over other people to talk. That's not really interesting to me. So attending conference as just an attendee, not particularly interesting to me as an introvert, however, completely different, is speaking at a conference, right. When you speak at a conference, you're sort of flipping the roles there, and you're dispensing wisdom, sharing with others, but also you're basically inviting others to come to you and talk with you. A power tip that I would give you is that if you are introverted and you're like, I need to go network with people, well, flip it. Be the one who's dispersing the wisdom, and then people will come to you. On that note of attitude, right. Generally, I have to feed my family, so I do things from, you could say, a purely monetary point of view, right. I don't go to conferences generally just for fun. I go there because I have a goal, right, which is to feed my family. Right. And generally, when I'm speaking, I expect to get business from the talk. I might not get paid for this talk, but my general feeling and my experience, and again, this is anecdota, this is just my experience, is that most of my work comes from my network and from interactions with others, and most of that is from conferences. So that's a big source of work for me. Like I said, I get pitched all the time, places like LinkedIn or Twitter, but most of my work has come from my network or being at a conference and talking at a conference, and that brings people to want to work with me. Another thing that's a great idea, is just to have goals, right? My goal was to speak at a conference, and so you can say, I want to speak at a conference, but if you never do anything towards that, then you really don't want to. It's just sort of a wish. So I would say write down your goals and work towards them. Maybe find a mentor, someone who can help you and make progress towards that. But I'm a big fan of goal setting and putting forth action towards what you want to achieve. Let's talk about investing in yourself. I'm going to tell you a story about someone who wanted to create the first Python series for a company called Pluralsight, which does on demand video. This person was asked to create the first Python course, and at the time, pluralsight was a net company. And so this person made an introductory Python course or a demo course on Linux. And pluralsight told me, I mean this person that they don't want the course because it's on Linux, they want it recorded on windows at the time. And I was like hey, I'm a hardcore Linux user and I've been running Linux for ten years. I'm not really interested in recording it on Windows or whatever. Long story short, this person did not get that video. But I've been heard that that video has generated on the order of a million plus dollars in revenue for the person who did Create that video, right? So bad choice. Person who chose not to get a windows laptop, right? And my story is that you should invest in the correct tooling, right? At that point in time I was like they should just use what I want to use. And turns out that a lot of times the business world doesn't work like that. They want to use what they want to use. And if you want to play in their ballpark, you need to play by their rules, right? That small investment in getting a laptop and maybe that small investment wouldn't have made it so I would have got the video, but I imagine it would have, could have been a lot of money, right? Tell you another story about a person who gave a tutorial and then wanted or was invited by a conference to give this tutorial again at another conference. And so this person started writing a looks from the tutorial rather than just rewriting the slides. And so this book took me a little bit longer than I wanted to. I mean this person took this person a little bit longer than they wanted to, but eventually they wrote the book. Writing a book is a great way to attract interest, right? It is an investment in yourself. A lot of people will say don't write a book for the money. Some books are more or less, they sell more or less, right? Most technical books don't sell lots. Some can. This is like a business card, right? When you have written a book on something, it's sort of like saying I'm an expert in this and you're sort of putting a stake in the ground. And so if you want business around some topic, especially if it's a niche topic, putting a book out there is a great way to attract business for consulting. And these days self publishing is super easy. It is not hard to write a book. I mean it is hard work to write a book, but I could take a word document and upload it into Amazon and have a book published in like 48 hours. So the process of getting that book published self published is not particularly hard. I'm not going to get into the pros and cons of self publishing versus not, but I will say that publishers want content. And I have heard stories of people who self published a book and then well before they self published it, they approached a publisher. The publisher is like, no, I don't. Not interested. You're an unknown and we don't want you. After they self publish their looks on Amazon, you can see their rankings and these publishers can look at their rankings and they can know how many books they'll sell based on the rankings. Right. And it's pretty easy for them just to look at the rankings and figure out whether or not they want to basically take that book in and do a rerelease of it as a published book. And that is possible as well. So these are investments that you can make in yourself. Certainly writing a book should take time, or will take time. My experience is that it's not something that you do in 48 hours. It takes a bit of time, but it can pay dividends. Not just monetary dividends, but bring you work that pays you more than writing the book itself would pay. Another thing that you can do to invest in yourself is to become a leader. Again. This is something that a lot of people who are technical people aren't particularly interested in doing or don't think that they can do. And I'm here to tell you, even if you're an introvert, you can be a leader. And these are skills that you can learn. Right? So I've got a little drawing here, what I call the onion skin of open source participation. And so like I said, I used Linux for a long time on my laptop. I've been involved in the open source community and the people who hold the most power are the most central, right? And so you could think of this like an onion that has layers. At the middle is the committer. This is the person who's writing the code, who knows the code. And people have to do what the committer says basically. Right. Then you have people around that maybe you submit a pr pull request so someone will change something. So you're pretty involved, but you're not a committer. Right. But that might lead to getting commit rights if you do that multiple times. And then you'll hear of people who will just file bugs and use the mailing list, which is not quite as involved as writing a pull request. Then there are people who will use the library, and then there are people who have heard the library so we're going outside here as we go out. These people have less leadership or less responsibility. Right. If you want to be known for a project and you want to consult on a project, great thing to do would be to start pushing yourself into that project so you can start participating in that and leverage that for consulting. So I'm going to tell another story about a person who wanted to be a core Python committer. This is a colleague, so it's not me. And this person was like, I want to be a core Python committer. Right. And they didn't just say they wanted to do that. They started following the mailing list, they started submitting pull requests, and eventually they became a core Python committer, which led to a bunch of jobs and opportunities that I would dare say that they wouldn't have gotten had they not done that. And I watched this firsthand. This person worked with me, set a few cubicles down for me. So what can you do to become a leader? Well, you can speak, right? So go to a meetup. You can share with other looks. Right. And sharing can be in various ways. Right. It can be in book form, it can be in podcasts, it can be on a blog, it can be through social media. All of these things of putting yourself out there can be hard and difficult, but if you're interested in something, it shouldn't be particularly hard to start talking about that. Right. The challenge for a lot of people is like, looking someone in the eyes to do that. But again, this is something with practice that you can learn to do. There's a blog post by a fellow named David Robinson who said something pretty similar. The effectiveness of public work, doing work in public. Right. You're going to do a bunch of work anyway. If you sort of share that on social media or whatnot, people start to know you for that. And so you can blog about something, you can tweet, you can contribute to open source, you can give talks, you can record screencasts, you can write a book. This is in their order of easiest to best, or the things at the bottom are the most effective. I don't necessarily think that writing the book is necessarily the most effective. I know that people who have gotten a lot of business just from tweeting, so there are various forms of putting yourself out in the public and getting attention that way. Another thing that you should do when you're investing in yourself is take care of your body. So I have, like, my keyboard. This is my current keyboard, or part of it. When I was writing my first book, my fingers started hurting, and I'm like, I need to take care of my fingers because I use a keyboard for a living, right? And so I messed around with keyboards and found a keyboard that works for me. Not saying that you have to get a keyboard like me, but you should listen to your body, right? And you should do things like get enough sleep generally, like, trying to hack through the night is not an effective way of coding or working and exercise. Right. Doing things that take care of yourself because there's only one of you. Okay. The next thing is to invest in others. What do I mean by that? Well, again, this is that abundance mentality. There's more than enough work to go around. I can share that work, and I can share and help others. On that note, like I said, I've been involved in the Python community for a long time, and I know a lot of python authors. I also know a lot of python consultants and a lot of python trainers. So these are people who I see at conferences or I chat with on social media, or even email with. And I could look at them as competition, but they're not my competition. There's more than enough work to go around, and I would prefer to not view them as competition, rather as partners. Hopefully, if I help them, they will help me and we'll share the abundance together. Another thing that you can do to help others is instead of thinking immediately, I'm going to pitch you on my services, ask them, what can I do for you? Without necessarily expecting payment? And that can open some doors, right. If you're showing that you're willing to help others, that is a way for it to build trust. And when you have trust, people want to work with you. Another way you can invest in others is to have what's called a mastermind group. So this is basically getting a small group of people who are doing similar things that you are doing, and then just chatting with them, talking about what they're doing, their problems, and brainstorming. So, like, I've done this in the past with folks doing similar things. To me, it can be super useful. You can get ideas from them, but you can also get, like, don't do this, this hurt me. Or, hey, go look at this. This might help you. Oftentimes we're very heads down in what we're focused on, but other people who are doing similar things might be focused on something else that we might not be aware of. Another thing is investing in others. You can view clients as others and investing in clients. Right. I want to work with clients that are good to me. And presumably clients want to work with me when I'm good to them, right? So how can you do that? I mean, one thing is giving them a fair price. You should be willing to drop clients if they don't want to invest in you, right? If they're not returning the favor, drop them. So be fair to clients, but also don't let them take advantage of you. Again, how can you invest in others? And this goes back to that. Put yourself out there teaching, investing in yourself, but sharing that with others is investing with others. And if you want to bring attention to you, social media is a great way to do that. And I've seen this happen on multiple platforms, right? Twitter, LinkedIn, YouTube. By sharing content, people start to pay attention and know that they can get the content from you. What are some other ways to invest in others? Just be charitable with yourself. Like donate, invest in others. So I like to teach, and I teach at schools, right? So I've taught classes for third to 6th graders, teaching them how to program python, do data science, create ebooks, program drones, that sort of thing. I think it's just good to have a good attitude and to not look, know everyone's sort of taking away from me, but I'm contributing to society as a whole. There's a great book called the Coder's path to wealth and independence. The title might be a little woo woo, but Mark Beckner wrote this book and I've had it for a long time and it sort of kicked me off down this path and has a lot of good advice. So if you're considering going down like this, consulting rabbit hole, this book, it's a little old now, but it has a lot of good pieces of advice for starting off that path, especially if you're in the US. Okay, so in summary, three things I think are important is just your overall attitude. Look on the positive side of things and then be willing to invest. Be willing to spend money and time in both yourself and others. Typically, an investment has some risk, right? And the investment might not get value, but generally we are investing because we believe something will grow and return us back more than we put into it. The things that I've listed here I've seen have helped me. Again, this is anecdotal, but they've helped me in my career and allowed me to do what I do. Thanks everyone for listening. I hope you found something of this useful. Even if you're not considering going out and becoming a consultant, if you want to reach out to me, feel free to connect on Twitter Dunder M. Harrison. I'm also on LinkedIn as well. If you're interested in training or consulting, reach out to me and we can talk about Metasnake. Okay. Have a great conference. Thanks, everyone. Bye.", "words": [], "utterances": null, "confidence": 0.961109127453288, "audio_duration": 1390.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Matt Wilson talks about consulting for introverted developers. The idea with consulting is that people are going to pay you for your expertise. If you're not super thrilled about being in front of people, then you might not want to do sales or marketing. Get an accountant if you are considering going this route.\n- Most of my work comes from my network and from interactions with others, and most of that is from conferences. A power tip that I would give you is that if you are introverted and you're like, I need to go network with people, well, flip it. Be the one who's dispersing the wisdom.\n- Writing a book is a great way to attract interest. It is an investment in yourself. It takes a bit of time, but it can pay dividends. Not just monetary dividends, but bring you work that pays more than writing the book would pay.\n- Another thing that you can do to invest in yourself is to become a leader. This is something that a lot of technical people aren't particularly interested in doing or don't think that they can do. But with practice, you can learn to do it.\n- The next thing is to invest in others. There's more than enough work to go around. If you're willing to help others, that is a way for it to build trust. Be fair to clients, but also don't let them take advantage of you.\n- Dunder M. Harrison: Just be charitable with yourself. Look on the positive side of things and then be willing to invest. If you're interested in training or consulting, reach out to me.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.07, "text": "other people", "timestamps": [{"start": 95472, "end": 96282}, {"start": 460692, "end": 461102}, {"start": 1204452, "end": 1205166}]}, {"count": 1, "rank": 0.07, "text": "enough people", "timestamps": [{"start": 359428, "end": 359934}]}, {"count": 2, "rank": 0.07, "text": "technical people", "timestamps": [{"start": 180012, "end": 180870}, {"start": 838668, "end": 839302}]}, {"count": 1, "rank": 0.07, "text": "smart people", "timestamps": [{"start": 395168, "end": 395722}]}, {"count": 1, "rank": 0.06, "text": "great thing", "timestamps": [{"start": 914648, "end": 915234}]}, {"count": 3, "rank": 0.06, "text": "similar things", "timestamps": [{"start": 1177468, "end": 1178440}, {"start": 1191132, "end": 1191654}, {"start": 1205892, "end": 1206414}]}, {"count": 3, "rank": 0.05, "text": "enough work", "timestamps": [{"start": 347472, "end": 347866}, {"start": 1098832, "end": 1099306}, {"start": 1127452, "end": 1127846}]}, {"count": 1, "rank": 0.05, "text": "book form", "timestamps": [{"start": 977608, "end": 978002}]}, {"count": 1, "rank": 0.05, "text": "Most technical books", "timestamps": [{"start": 732380, "end": 733426}]}, {"count": 19, "rank": 0.05, "text": "time", "timestamps": [{"start": 117448, "end": 118020}, {"start": 154148, "end": 154382}, {"start": 196784, "end": 196954}, {"start": 282236, "end": 282502}, {"start": 308596, "end": 308910}, {"start": 312116, "end": 312430}, {"start": 350342, "end": 350602}, {"start": 439452, "end": 439606}, {"start": 548512, "end": 548954}, {"start": 610724, "end": 610894}, {"start": 627384, "end": 627960}, {"start": 667368, "end": 667506}, {"start": 818232, "end": 818434}, {"start": 818968, "end": 819154}, {"start": 823608, "end": 824034}, {"start": 857412, "end": 857758}, {"start": 1107396, "end": 1107950}, {"start": 1314292, "end": 1314638}, {"start": 1342272, "end": 1342570}]}, {"count": 1, "rank": 0.05, "text": "hard work", "timestamps": [{"start": 758868, "end": 759246}]}, {"count": 1, "rank": 0.05, "text": "more work", "timestamps": [{"start": 390352, "end": 390794}]}, {"count": 1, "rank": 0.05, "text": "multiple Python", "timestamps": [{"start": 43468, "end": 44306}]}, {"count": 1, "rank": 0.05, "text": "public work", "timestamps": [{"start": 1011684, "end": 1012270}]}, {"count": 1, "rank": 0.04, "text": "lots", "timestamps": [{"start": 733916, "end": 734450}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}