{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/d25ab7d1-6a8c-439b-9459-6e7ebf3cc37e", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["artem lebedev", "change", "cloud", "computing", "conf fourty two", "cuttingedge", "insights", "microsoft", "programming", "serverless", "software", "software engineer", "trip"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "15996732-f226-490f-9b89-19d4c59c854a", "status": "completed", "error": null, "text": "My name is Artem. I'm a software engineer with experience more than ten years. Currently I'm working at Microsoft and today I would like to give you a short overview of serverless programming, the most popular platforms in this area, and some challenges you can face during developing your application with serverless programming. So what is the cloud computing? Cloud computing refers to the library of computer services over the Internet, enabling user to access resources and applications on demand without the need for local infrastructure or hardware. In cloud computing, data, applications and resources are hosted on remote servers maintained by cloud services providers, allowing users to access them from anywhere with an Internet connection. Azure cloud computing platforms are Amazon Web Services, Microsoft Azure and Google Cloud platform. Let's talk about each one. So, first in the list, Amazon Web Services is the most comprehensive and widely used cloud platform in the world, with customers in over 190 countries. OS, which works with over 5000 educational institutions and 2000 government organizations, accounts for more than half of the global public. Cloud share OS offers more than 200 cloud services and products in industries such as computing, storage, databases, analytics, networking, mobile developer tools, management tools, Internet of Things, security and enterprise applications. Below, we'll describe the most popular of them. So here are the top five for Amazon. EC Two is a compute cloud web service which allows users to rent virtual serverless instances and run various application and workloads on them. RDS this is a cloud service to create various database instances like relational databases, nonrelational databases and many of others. S free is a scalable cloud storage service which is designed to store and retrieve any amount of data from anywhere over the web, offering highly durable and available object storage infrastructure. It's really, really a reliable one. Amazon Lambda Service is a service to support serverless computing. We will talk more about these kind of services a bit later after overview of the most popular cloud computing services. Cloud Front this is a content delivery network which is, in a simple words, improved website performance by providing access to cloud based data in more efficient way. Let's go to the next one. Next one is the Microsoft Azure. It's a cloud computing platform developed and operated by Microsoft. Includes over 200 products, same as Amazon and cloud services designed to easily build, run and manage applications across multiple clouds. Using a variety of tools and frameworks. From DevOps to business analytics to the Internet of Things, Azure offers scalable, cost effective solutions that bring together everything you need, related products, services, third party applications, modern nowadays, open eye resources which you can use to leverage power of large language models in your applications. So let's move on to the top five Microsoft Azure services first and similar to Amazon Service, Azure VMS and web applications support. You need to handle different computing tasks, web applications, different workloads. You just create instances there and run your code. Next one is Azure Blob searches which supports your needs to store any portions of data for your applications. Very useful in data lakes and things like this. Next one Azure Kubernetes serverless, would offer you managed Kubernetes environment to support your continuous delivery work with your cluster and to ease your day to day life. Azure functions similar with AWS Lambda serverless computing service and next one azure active directory or azure identity. This is a service to support many features based on access control such as user siding, authorization authentication and control over access from one application to another. Let's move on to the third one in this list. Google Cloud platform is a cloud computing platform used by Google to power all of the tech giants, services and products including Gmail and Google Search, on the other hand, offers over 100 products and services under the GSP brand to millions of customers worldwide. The lineup includes a wide change of cloud services such as computing storage, machine learning and data analytics. Here we have top five for Google Cloud platform compute engine. This is a Google analog for cloud computing similar to Amazon EC two or Azure Web services. Cloud storage allows highly durable and available storage infrastructure. Bigquery is a fully managed, serverless and highly scalable data warehouse and analytics platform provided by Google Cloud platform. It enables users to analyze large data sets using SQLite queries quickly and cost efficiently without needing to manage infrastructure or worry about scalability. Google Kubernetes Cluster Kubernetes engine same as Azure Kubernetes services support your Kubernetes with environment infrastructure to help you process your continuous deployment and other stuff. Google Cloud platforms, AI and machine learning includes tools for automated model training and AI platform for simple model deployments. Let's now talk about serverless computing. Serverless computing is a method of obtaining on demand backend services. In other words, we only pay for actual code execution for actual function calls instead of paying for maintaining service or infrastructures. As we told before, Amazon, Microsoft and Google provide serverless computing at their cloud computing platforms such as OS Lambda, azure functions, and Google Cloud services. Here are some benefits which we can gain from serverless computing. First in the list is scalability, the ability of application to automatically adapt to changing workloads. It means that cloudless serverless computing allows us to smoothly go through traffic spikes to increase capacity of our resources on the demand. Next one is cost effectiveness because users are built based on actual usage. Serverless computing can save a significant amount of money when we have low traffic or we don't have traffic at all. We just don't pay if we don't use and the last one in the list performance serverless Pro platforms provide tools and services for monitoring and optimizing applications performance at scale. Let's talk about some real use cases of cloud computing and serverless computing. First example, Amazon, which leverage benefits of serverless computing to handle spike traffic during different events like Black Fridays or other promotions, so scalable design helps to provide smooth shopping experience for Milan of customers. Amazon relies on cloud computing to effectively manage its massive online retail operations using the benefits of its cloud platform. The leading cloud platform, the online retail agent, gains scalable infrastructure capable to handle traffic spikes. As I said before, it relies on such technologies like EC Two for web hosting, Amazon s three for storage, which I also mentioned. It's really reliable solution and also they use lambda functions to serverless functions let's go to the next one. Next one is healthcare. Kaiser Permanent, one of the largest healthcare providers in the United States, has been actively incorporating Microsoft Azure's cloud computing services into its operation to improve patient care and efficiency. Care teams in particular use Microsoft Azure solutions to collect and analyze data from medical devices in order to ensure data driven decision making and personalized patient care. Azure also powers telemedicine services, allowing patients to access healthcare services from anywhere. With Azure's comprehensive set of cloudbased services, Kaiser Permanent is now capable of providing timely and personalized digital experience to its massive patient base of more than 12 million patients, as well as equivalents medical personnel to make more informed decisions and a little bit different area from previous two gaming. Supercell, the developer of maybe popular mobile games such as Clash of clans, relies on cloud solutions to handle traffic spikes during the game launch and updates. Supercell requires thousands of servers on a continuous basis because each player starting a game necessates a session on the server side and the number of servers must grow concurrently as more players join in. So Supercell's entire game infrastructure is built on Amazon Web Services, the same as Amazon. It use EC two instances distributed across multiple availability zones to increase availability, storing up to ten terabytes of game event data per day. With the ability to scale server capacity based on player demand, they can efficiently handle traffic spikes while minimizing cost during quieter periods. So let's now talk about what challenges we can met with cloud computing, and first in the list would be the protection of personal and sensitive data such as personal information financial information or health records is critical in cloud computing. In a serverless architecture where the servers are managed by the cloud service provider, protecting this kind of data becomes a difficult task. Compliance with the regulations such as health insurance portability and accountability acts, or GDPR general data protection regulation is required to fulfill it. Following the security guidelines provided by cloud service providers, conducting regular security audits, and implementing strong identity and access management, we can mitigate this risk. Amazon, Azure and Google Cloud, each of them offer different security guidelines, tools to monitor your applications to assist in the security of cloud based application. Regular assessment of cloud infrastructure to identity and correct potential security vulnerabilities aid in the maintenance of a strong security posture. Username identity access management controls framework to ensure that only authorized and authenticated users have access to specific data or applications. Next one is vendor lock in. What is the vendor lock in? Vendor lock in occurs when a user loses ability to switch to a different vendor. So for example, we lose ability to switch from Amazon to Azure or to Google Cloud platform. It may occur by different courses by using vendor specific logic and things like this. So how we can work with this one, so we can work with implementing cloud agnostic technologies like contrization or microservices architecture. These strategies make it easier to switch cloud providers if necessary, reducing the impact or vendor lock in so we can save ourselves from these risks. And the next one in the list cost management. So it's really important to understand how much we pay for our services for our infrastructure we keep in cloud provider and analyzing serverless cost is essential for cost management and tools such as AWS, cost explorer or Azure. Cost management help organization track and understand their serverless spending, their budgets on the infrastructure. To optimize serverless cost, organization can implement resource cleanup practices, set up budget alerts to monitor spending, and regularly review usage patterns to precise resources and reduce unnecessary expenses. Cost optimization is crucial for maintaining a cost effective serverless environment. So let's talk about trends we have in this area right now, where we'll be developed in the next decade. So one of the trends we can see, it's edge computing and the Internet of Things. Edge computing is gaining popularity because it brings computation closer to the data source. Reducing latency and enable real time processing is critical for Internet of Things devices, autonomous vehicles and remote monitoring. Serverless computing is being extended to edge devices, allowing organization to run lightweight serverless functions directly on edge devices, enhancing their ability to process and respond to data locally. One of the most significant on my opinion trend, it's machine learning and artificial intelligence machine learning and AI are increasingly being integrated with cloud and serverless platforms. Microsoft Azure provide you open eye resources which you can use to get an access to GPT, four Dalia different models which you can use and leverage the power of it in your application. Other cloud providers as well provides specialized services and frameworks that enable organization to efficiently build and scale AI solutions. AI and machine learning are being used in a variety of fields, from healthcare diagnostics to self driving cars. Natural language processing and computer vision are two examples of AI driven services that are transforming industries and spam. New applications right now and the next trend hybrid and multicloud solutions hybrid cloud environments, which combine on premises infrastructure with public and private cloud resources, are becoming more common. They are adaptable, allowing data and workloads to move seamlessly between environments. Multicloud strategies employ multiple cloud providers for various purposes, providing redundancy and flexibility. In other words, you use the best each cloud provider can offer you. Multicloud deployments are expected to play a significant role in the future of cloud computing as organizations seek to avoid vendor locking and optimized performance. So that was my overview of the current cloud computing services of the serverless products they have, and the conclusion here that the rise of cloud computing is reshaping the digital world. I think it's also reshaped right now, creating new opportunities for scalable and cost effective deployment cycles, allowing organizations to scale easily while focusing on code rather than infrastructure management measure. Multinational corporations such as iOS, Microsoft Azure, Google Cloud platform provide hundreds of cloud services and products that transform virtually every industry from e commerce to healthcare and gaming. Despite some potential security concerns and serverless architectures, these technologies have a promising future. Cloud computing is rapidly evolving with new technologies and services operating on a regular basis. It involves new products like, as we told before, tools for machine learning, for artificial intelligence, who are using power of the natural language models and all other modern stuff. Yeah, thank you for the listening me today. Thank you for your time. Hope you enjoy the conference. Have a great day.", "words": [], "utterances": null, "confidence": 0.927327885816238, "audio_duration": 1136.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Cloud computing refers to the library of computer services over the Internet. It enables user to access resources and applications on demand without the need for local infrastructure or hardware. Here is a short overview of the most popular cloud computing platforms.\n- Microsoft Azure is a cloud computing platform developed and operated by Microsoft. Includes over 200 products, same as Amazon and cloud services designed to easily build, run and manage applications across multiple clouds. From DevOps to business analytics to the Internet of Things, Azure offers cost effective solutions.\n- Google Cloud platform is a cloud computing platform used by Google to power all of the tech giants, services and products. The lineup includes a wide change of cloud services such as computing storage, machine learning and data analytics. Here we have top five for Google Cloud platform compute engine.\n-  serverless computing is a method of obtaining on demand backend services. We only pay for actual code execution for actual function calls instead of paying for maintaining service or infrastructures. Let's talk about some real use cases of cloud computing and serverless Computing.\n- Kaiser Permanent, one of the largest healthcare providers in the United States, has been incorporating Microsoft Azure's cloud computing services into its operation to improve patient care and efficiency. Supercell, the developer of maybe popular mobile games such as Clash of clans, relies on cloud solutions to handle traffic spikes.\n- The protection of personal and sensitive data is critical in cloud computing. Vendor lock in occurs when a user loses ability to switch to a different vendor. Cost optimization is crucial for maintaining a cost effective serverless environment.\n- Edge computing is gaining popularity because it brings computation closer to the data source. Machine learning and AI are increasingly being integrated with cloud and serverless platforms. New applications right now and the next trend hybrid and multicloud solutions.\n- The rise of cloud computing is reshaping the digital world. It creates new opportunities for scalable and cost effective deployment cycles. Despite some potential security concerns and serverless architectures, these technologies have a promising future.", "auto_highlights_result": {"status": "success", "results": [{"count": 6, "rank": 0.09, "text": "cloud services", "timestamps": [{"start": 67176, "end": 67858}, {"start": 113944, "end": 114690}, {"start": 215832, "end": 216498}, {"start": 345520, "end": 346442}, {"start": 451876, "end": 452720}, {"start": 1086028, "end": 1087126}]}, {"count": 1, "rank": 0.09, "text": "cloud service providers", "timestamps": [{"start": 738112, "end": 739798}]}, {"count": 18, "rank": 0.09, "text": "cloud computing", "timestamps": [{"start": 45804, "end": 47090}, {"start": 47250, "end": 48290}, {"start": 61012, "end": 61802}, {"start": 75662, "end": 76466}, {"start": 188066, "end": 189286}, {"start": 207604, "end": 208474}, {"start": 324168, "end": 325466}, {"start": 359508, "end": 360154}, {"start": 446110, "end": 447690}, {"start": 515768, "end": 516446}, {"start": 537644, "end": 538374}, {"start": 584258, "end": 584994}, {"start": 696000, "end": 697370}, {"start": 710708, "end": 711802}, {"start": 1036972, "end": 1037598}, {"start": 1047328, "end": 1048214}, {"start": 1056388, "end": 1057194}, {"start": 1102130, "end": 1103306}]}, {"count": 1, "rank": 0.09, "text": "Azure cloud computing platforms", "timestamps": [{"start": 75030, "end": 77490}]}, {"count": 1, "rank": 0.08, "text": "AWS Lambda serverless computing service", "timestamps": [{"start": 296032, "end": 299260}]}, {"count": 1, "rank": 0.08, "text": "cloud based data", "timestamps": [{"start": 198272, "end": 200118}]}, {"count": 1, "rank": 0.08, "text": "cloud based application", "timestamps": [{"start": 763188, "end": 764340}]}, {"count": 1, "rank": 0.08, "text": "cloud infrastructure", "timestamps": [{"start": 766168, "end": 767182}]}, {"count": 3, "rank": 0.08, "text": "cloud providers", "timestamps": [{"start": 835778, "end": 836706}, {"start": 969576, "end": 970446}, {"start": 1020782, "end": 1021598}]}, {"count": 1, "rank": 0.08, "text": "Azure Kubernetes services", "timestamps": [{"start": 396896, "end": 398266}]}, {"count": 1, "rank": 0.08, "text": "Other cloud providers", "timestamps": [{"start": 969110, "end": 970446}]}, {"count": 1, "rank": 0.07, "text": "Google Cloud services", "timestamps": [{"start": 451584, "end": 452720}]}, {"count": 1, "rank": 0.07, "text": "multiple cloud providers", "timestamps": [{"start": 1020264, "end": 1021598}]}, {"count": 11, "rank": 0.07, "text": "serverless computing", "timestamps": [{"start": 178300, "end": 180402}, {"start": 297398, "end": 298646}, {"start": 421272, "end": 422862}, {"start": 423006, "end": 424254}, {"start": 442976, "end": 444470}, {"start": 456276, "end": 457790}, {"start": 469990, "end": 471582}, {"start": 492054, "end": 493254}, {"start": 516648, "end": 518174}, {"start": 521656, "end": 522654}, {"start": 926670, "end": 927806}]}, {"count": 1, "rank": 0.07, "text": "cloud solutions", "timestamps": [{"start": 640128, "end": 640886}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}