{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/5484a70b-57ed-4e15-b2e8-037e112b7a9b", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["anupam phoghat", "associate director", "businesses", "closely", "cloud", "cognizant servian", "conf fourty two", "demystifying", "fastpaced", "modernisation", "true"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "4de771f5-629d-4630-bf6f-3e6acb916476", "status": "completed", "error": null, "text": "Hello everyone, thanks for joining us. Today in this rapidly evolving digital era, businesses are continuously seeking ways to leverage modern technology g's to enhance their efficiency, stay competitive and accelerate their growth. A pivotal aspect of this transformation is digital modernization. Today, we embark on a journey into the realm of digital modernization on public cloud platforms, examining its three key facets, application modernization, infrastructure modernisation and data modernization. We'll also look into the strategic use of tools like terraform and Packer, crafting a resilient platform that empowers us to unlock the complete capabilities of the public cloud platform through streamlined deployment and resource reapplication. As we embark on our exploration for digital modernization today, it is crucial to dispel the misconception that it merely involves migrating applications to the cloud. The landscape of modernization extends beyond a simple relocation. It encompasses a holistic transformation that integrates three essential elements, application, infrastructure and data. These three facets synergize to form the comprehensive concept of digital modernization. Now let's break it down a little further. Application modernisation involves optimizing and enhancing existing applications, making them cloud native, scalable and agile. Simultaneously, infrastructure modernization focuses on refining the underlying it infrastructure to harness the full potential of cloud resources. Finally, digital modernization addresses the strategic management and utilization of data, ensuring that it becomes a valuable asset for informed decision making. Together, these interconnected components redefine the digital landscape, creating a symbiotic relationship that goes beyond simple migration. It is a transformative journey towards digital modernisation. So remember in this equation, the combined force of application modernisation, infrastructure modernization and data modernization provides the true essence of digital modernisation. Now, there are many benefits of application modernisation and some of these benefits include increased agility and scalability. All the cloud based applications are much more agile and scalable than traditional on premises applications. This means that businesses can quickly adapt to changing customer demands and market conditions. It also provides reduced costs. All the cloudbased applications can help businesses to reduce their it costs by eliminating the need to purchase and maintain on premises hardware and software. Improved security and compliance cloud platforms offer a number of security and compliance features that can help businesses to protect their data and applications. Cloudbased applications can also provide a better user experience than the traditional on premises applications. This is primarily because they can be accessed from anywhere on any device and they can be updated more frequently. Cloudbased applications can also help businesses to innovate more quickly by providing access to new technologies and development tools. Now, before we dive in, let's clarify the concept of digital modernization. I believe digital modernization is the process of harnessing advanced technologies and platforms to transform IT infrastructure, data management and application development. In the context of Google Cloud platform or any other cloud platform for that matter, we'll break it down into true core categories. Infrastructure modernization it is the foundation of digital transformation. It is basically transitioning from legacy on premises infrastructure to agile, scalable and cloud based solutions. Google Cloud platform also offers a wide array of services and tools for modernizing infrastructure. Then comes data modernization, which is unlocking the value of data through cloud based storage and processing capabilities, empowering advanced analytics, real time insights and intelligent decision making. Similar to the infosec modernization, Google Cloud provides powerful solutions for data modernisation as well for data warehousing, data lakes, analytics and machine learning. Third in the list is application modernization, which is basically the process of updating application architecture, design and functionality to leverage new technologies and cloud platforms, enhancing scalability, agility and user experience of the application. A transformative process that goes beyond simple migration to the cloud infrastructure modernization forms the bedrock of any digital modernisation. It involves migrating from traditional on premises setups to dynamic cloud based infrastructure. It refers to the process of updating and migrating an organization's IT infrastructure to the cloud. This can involve moving servers, storage networking to the cloud, as well as adopting cloud native technologies such as containerization and serverless computing. The key elements include virtualization and containerization by utilizing tools like Kubernetes and compute engine for scalability, profitability and efficiency. Infrastructure as a code which is automating infrastructure provisioning and management through code based tools like terraform serverless computing which is leveraging platforms like cloud run cloud functions for automatic scaling and cost efficiency. Then we have network modernisation which is Google Cloud platform's high performance network infrastructure for fast, secure and globally connected applications. From a data modernization perspective, data is a very valuable asset and modernizing data management unlocks its full potential. Data modernization refers to the process of updating and migrating an organization's data into the cloud. This can involve moving data from on premises data centers to cloudbased data lakes and warehouses, as well as adopting cloudbased data processing and analytics tools. Some of the key concepts include data warehousing which is migrating to solutions like bigquery for handling large volumes of structured and semi structured data, data lakes and analytics where storing, managing and analyzing diverse data types using cloud storage, dataflow and dataproc. Then we have data streaming and real time analytics which is ingesting, processing and analyzing data in real time using tools like cloud, pubsub, machine learning and AI. Harnessing AI services like Automl AI platform and Tensorflow for innovation and efficiency. Lastly, application modernisation. It is all about more than just migrating to the cloud, it is about enhancing applications architecture and functionality. Some of the key concepts included in application modernization process are breaking the application into microservices architecture. As I mentioned, it is basically the process of breaking monolithic applications into microservices for agility, scalability and independent deployment. API based integration which is fostering interoperability through seamless integration with other applications and systems. DevOps and CI CD which is embracing DevOps practices and CI CD pipelines for automated builds, testing and deployment employ something like domain driven design. If the core businesses are aligned with specific domains, decouple the applications from any specific technology. Isolate business logic from technology stack now whenever we talk about migration to the cloud, we have heard of the R's. Depending on the vendor it can be 5 hours, 6 hours or 7 hours, but on a very high level the R's. Here are the process or the methodology that we are using to move the application to the cloud. So first one in the list is retire. This is basically the process of where after application discovery you can decide that you don't need these applications in the future, so you are just going to retire them. This is just getting rid of them as you are not going to use them anymore in future. Second one is retain. You can decide to keep applications exactly as is before a reevaluation sometime in future is required. An example of this application migration strategy could be unsupported authentic system and applications legacy applications that do not have a business justification for migrating to the cloud. The next one is rehost. One of the most basic ways of migrating to the cloud is simply to rehost something and this is sometimes also called as lift and shift. This means to take your applications or systems and move them exactly as is into the cloud environment. This approach is great for organizations that need to migrate quickly. For example, the data center lease is coming to end soon. For the majority of applications, this type of strategy is also the first step because it's easier to optimize or rearchitect them once they are already running in the cloud. An example of this kind of strategy could be a VM currently running in your local ESX cluster which is copied to a vsphere instance running on cloud, something like GCP VM instance. Some of the pros of this approach is speed of migration. Reduced risk of migration could be automated or assisted by cloud native tools. Then we have real platform which is sometimes called as lift and reshape because you can potentially take advantage of some of the spatial capabilities of the cloud. An example of this app migration strategy would be replatforming leads to cloud optimization due to some cloud platform adoption while keeping the application core architecture the same. Often, replatforming is used when replacing database backends of application with a corresponding pass database solution of a cloud provider. The next strategy in the list is repurchase. Repurchasing, also called as replacing, is the strategy where the legacy application is fully replaced by a SaaS solution that provides the same or similar capabilities. This involves abandoning the existing software that you have and migrating to a cloud first application. An example could be changing your web application firewall to something like cloud armor web application firewall with managed rules, or swapping a self run email system for an online email as a service offering. The last one in the list is rearchitect or refactor for highly critical applications that require cloud native characteristics or applications that need thorough modernization due to outdated NAS or performance issues. Rearchitecting, also called as refactoring or rebuild, is the strategy that usually leads to the highest transformation cost. However, it allows optimized use of cloud, leading to cloud native benefits and making the application future proofite. Rearchitecting an application often comes along with the opportunity to even break down the supported business processes into fragments, which greatly improves simplicity and makes a business process more agile. This is the most advanced application migration strategy. Put simply, it is a redesign of your application in a more cloud native manner. In general, you create a serverless version of legacy application. An example of this approach could be migration of your on premises oracle database to something like cloud spanner. You can choose to modernize your monolithic application by breaking it down into smaller microservices and leverage services like cloud run or cloud function. Some of the benefits are highly increased efficiency, agility and improved cost, eliminating dependency on custom hardware or proprietary technology platforms and no infrastructure or service to maintain. Just a call out here that it's the last approach which is refactor or rearchitecting which is basically the application modernization that we are going to be focusing on now. Just to reemphasize application modernisation is the process of updating and refactoring existing applications to take advantage of new technologies and cloud computing platforms. This can involve a variety of changes such as migrating applications to the cloud native services, refactoring them to a microservice architecture, or adding a new feature such as mobile support or artificial intelligence. To summarize, everything that we have discussed the three facets of modernization. Google Cloud platform, along with Hashicoff product suite, offers a wide range of services and tools that can help businesses to modernize their application. An example of such an architecture or such a solution could be something that's shown on this page here. I'm not saying this is the only solution, but a combination of different services that are displayed here could be used to achieve a complete digital transformation for our business. So on the very far left, top side, we have externally facing applications configured with cloud load balancing and cloud armor. Tools like APG API platform or cloud endpoints are used for interfacing with applications via custom developed API endpoints. Then we have native tools like cloud build in conjunction with third party tools such as terraform and Packer that are used to define infrastructure as a code. Application secrets can be stored securely in secrets manager or hashicoff vault data encryption address is provided to multiple services via key management system or KMS, in short, container image deployment using artifact registry and securing that with signature validation via binary authorization, which is basically the process of only deploying the images from verified sources. Then we have application compute components replatformed and are rearchitected into containerized platforms, things like cloud run or GKE or even cloud functions. Then we have on the right hand side, in the middle of this whole tier data where we host data on cloud native services such as cloud storage, cloud SQL firestore or memory store event driven interaction using services like pub sub or event arc. Then at the very far right, we have cloud operation suites utilized for application observability and then we have tools like Bigquery and Google Data Studio for analytics purposes. So as we can see the whole spectrum from left to right, there are a number of services that we can use to optimize the infrastructure, application and data to provide the complete digital modernization to any business. Now, to distinguish between application modernization and cloud migration, I'll put together some of the key focus areas here. While these two are closely related, application modernization and cloud migration have distinct focuses and scopes. So from a focus perspective, application modernization enhances application architecture, whereas cloud migration primarily involves shifting to the cloud, moving your application from on premises to the cloud. From a scope perspective, application modernization encompasses infrastructure, data and application architecture, whereas cloud migration centers on application and infrastructure transition from a compelling moment or trigger point perspective. More often than not, application modernization is considered when there are issues with the application performance or when you want to include new capabilities and the functionalities, how the application is run or behaving. Whereas for cloud migration it is primarily when the data center leave is coming to an end and we need to move our application off to another set of servers or we need to renew the lease. So that's when the cloud migration is primarily considered. From benefits perspective, application modernization fully leverages cloud technology's potential, whereas cloud migration primarily taps into the scalability and flexibility that is provided by the public cloud platform. Now, in the quest to harness the power of cloud technology, application modernisation is a pivotal strategy. By understanding infrastructure modernization, data modernization and application modernisation as interconnected components, businesses can embark on a comprehensive journey to transform their applications and fully embrace the potential of the public cloud application modernisation, infrastructure modernization and data modernization are all essential components of a comprehensive digital transformation strategy. By modernisation, all these true components organizations can improve their agility, scalability and efficiency to gain a competitive advantage in this digital economy. Remember, it's not just about moving to the cloud, it's about optimizing applications for success in the modern digital landscape. Thank you for your attention.", "words": [], "utterances": null, "confidence": 0.927127518307569, "audio_duration": 1348.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Businesses are seeking ways to leverage modern technology g's to enhance efficiency and stay competitive. A pivotal aspect of this transformation is digital modernization. The landscape of modernization extends beyond a simple relocation. It encompasses three essential elements, application, infrastructure and data.\n- Digital modernization is the process of harnessing advanced technologies and platforms to transform IT infrastructure, data management and application development. Google Cloud provides powerful solutions for data modernisation as well for data warehousing, data lakes, analytics and machine learning.\n- Application modernization is the process of updating and refactoring existing applications to take advantage of new technologies and cloud platforms. Google offers a range of tools that can help businesses to modernize their application. Here are the three main ways to migrate to the cloud.\n- Application modernization and cloud migration have distinct focuses and scopes. From a focus perspective, application modernization enhances application architecture. Cloud migration primarily involves shifting your application from on premises to the cloud. By understanding infrastructure modernization, data modernization and application modernisation as interconnected components, businesses can embark on a comprehensive journey to transform their applications.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.12, "text": "applications legacy applications", "timestamps": [{"start": 687596, "end": 690086}]}, {"count": 10, "rank": 0.11, "text": "application modernization", "timestamps": [{"start": 73614, "end": 75170}, {"start": 376092, "end": 377350}, {"start": 568664, "end": 569998}, {"start": 954292, "end": 955594}, {"start": 1174376, "end": 1175810}, {"start": 1186450, "end": 1187950}, {"start": 1194886, "end": 1196246}, {"start": 1210906, "end": 1212218}, {"start": 1230730, "end": 1232230}, {"start": 1268030, "end": 1269550}]}, {"count": 1, "rank": 0.11, "text": "application modernization process", "timestamps": [{"start": 568664, "end": 570642}]}, {"count": 1, "rank": 0.1, "text": "cloud armor web application firewall", "timestamps": [{"start": 830540, "end": 833170}]}, {"count": 8, "rank": 0.1, "text": "Application modernisation", "timestamps": [{"start": 141950, "end": 143366}, {"start": 201604, "end": 203070}, {"start": 214072, "end": 215550}, {"start": 554234, "end": 555710}, {"start": 961722, "end": 963222}, {"start": 1287710, "end": 1289222}, {"start": 1296800, "end": 1298102}, {"start": 1310210, "end": 1311946}]}, {"count": 2, "rank": 0.1, "text": "premises applications", "timestamps": [{"start": 227052, "end": 228790}, {"start": 268648, "end": 270366}]}, {"count": 3, "rank": 0.1, "text": "application architecture", "timestamps": [{"start": 380066, "end": 381858}, {"start": 1197126, "end": 1198650}, {"start": 1215976, "end": 1217646}]}, {"count": 4, "rank": 0.09, "text": "cloud platforms", "timestamps": [{"start": 68696, "end": 70050}, {"start": 252986, "end": 254202}, {"start": 386172, "end": 387510}, {"start": 469576, "end": 470494}]}, {"count": 3, "rank": 0.09, "text": "Cloudbased applications", "timestamps": [{"start": 239804, "end": 240966}, {"start": 262550, "end": 264158}, {"start": 279690, "end": 281202}]}, {"count": 1, "rank": 0.09, "text": "other applications", "timestamps": [{"start": 594816, "end": 595910}]}, {"count": 1, "rank": 0.09, "text": "Application secrets", "timestamps": [{"start": 1064630, "end": 1066530}]}, {"count": 1, "rank": 0.09, "text": "monolithic applications", "timestamps": [{"start": 580338, "end": 581666}]}, {"count": 1, "rank": 0.09, "text": "application development", "timestamps": [{"start": 306996, "end": 308750}]}, {"count": 2, "rank": 0.09, "text": "existing applications", "timestamps": [{"start": 146534, "end": 148250}, {"start": 966846, "end": 968318}]}, {"count": 1, "rank": 0.09, "text": "application discovery", "timestamps": [{"start": 654836, "end": 656154}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}