{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/1e608ed2-dce6-4c40-9781-8dc76e4206f7", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["by", "career", "community", "company", "concrete", "conf fourty two", "developer advocate", "energized", "grammarly", "lauren", "lauren hayward schaefer", "provide", "stories", "strategies", "wider", "youll"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "d4a5d98c-f8ff-459a-878d-f6fdfa06a384", "status": "completed", "error": null, "text": "Hey, friends, I'm going to kick things off today with a story. Well, an embarrassing story. So back when I was working on my master's degree in computer science, I had to write a thesis. And a thesis is this massive paper where you explain your research and how it contributes to the larger body of work. Now, I diligently worked on my thesis over time, and looking back, I should have sent it to my professor every time, finished a chapter. But I was never really thrilled with what I had written, so I just kept chipping away at it on my own. Now, eventually, I finished the first draft and I had to send it to my professor. I needed to know if it was any good. My graduation depended on it. So I sent it to her. The whole thing, all 83 pages, and she didn't reply. I knew she had it, but she was a busy professor with lots going on, and she didn't have time to read an entire massive paper all in one night. So I anxiously awaited her reply. I don't even remember how much time passed, but I got more and more nervous by the hour. I was totally in my head. I was asking myself questions like, how much was I going to have to rework? Was I going to be able to graduate on time? Was I just bad at this whole grad school thing? Now, eventually she replied, and she liked it. She had recommendations, of course, like, it wasn't perfect, but her overall review was positive. I wasn't going to have to redo my research or rewrite the whole thing. Graduation was within my grasp. I was absolutely thrilled. So I was so excited. And I'm a millennial who's very attached to their mom. So I decided I should forward this email to my mom. I started typing out, mom, I'm so excited. My professor liked it. I'm going to graduate. Book your flight. I'm going to graduate. This is great. Now, I initially threw in a little shade about someone else, and then I deleted that part about the other person and I pressed send. And that is when I realized my mistake. I had not forwarded the email to my mom, I had forwarded it to my professor, and there was no way to stop it. And so off it went into her inbox, and I was mortified. And I was super glad that I'd removed the shade about the other person. Now, luckily, my professor was very cool about the whole thing and she didn't hang it over me. But I remained embarrassed. And I also learned about Google's undo send that day because for some reason, mistakes become so much more obvious. When you actually press send. So let's have a moment of solidarity together. Just think about it. Has your writing ever gotten you into trouble? Maybe you sent an email or a chat message that didn't go to the person or group you intended. Maybe your tone was a little snotty, either intentionally or unintentionally. Or maybe you missed an opportunity because the reader just didn't understand what you meant. The written word is powerful. It can get you into trouble if you're not careful. But it also has the power to level up your career. We're all writing every day. A recent study found that knowledge workers spend about 20 hours a week. That's roughly half our work week on written communication. Writing is super important, and it's hard to get it right. Much like writing code, if you use the wrong word, you misplace a character. Youll can get it all wrong, but when you get it right, it feels so good and the impact can be massive. Your writing has the power to improve your personal success and your personal reputation. Over the next few minutes, I'm going to share with you five concrete strategies for writing to level up your career. And then I'll share three ways that you can improve the quality of your writing. Okay, so let's just dive right in with strategies for writing in order to level up your career. First, strategies write to help your users. So, jumping back a little more backstory on me. After grad school, I started working as a software engineer. I chipped away at my coding projects at work. I started getting comfortable with them, and then I asked my manager what I needed to do in order to move my career forward. He emphasized the importance of demonstrating scope I needed to show that I was influencing and helping others. So he recommended that I begin answering questions on our user forums. Now, I got to tell you, this was a little scary to me at the time. I certainly was not an expert on our products, and I didn't want to look dumb in front of my colleagues who would be reading my public answers. But I decided to try it anyway. So I set a goal for myself to answer one question each day. In the beginning, I had to really search for a question that I had a clue how to answer. I often had to code the solution myself to figure out if what I thought would work would actually work. The first time someone marked my answer as correct felt amazing, like I, a new grad, had helped a professional like out in the real world. That was so cool. Now, I'm not going to pretend I always got my answers 100% right? I mean, sometimes my colleagues would drop in and add suggestions to my answers and sometimes I wouldn't receive any feedback at all and I would have no idea if my answers were helping other people. But over time, I learned more about our product and I got better at answering questions. So I kept at it and I continued to try and answer one question a day. My reputation points grew a little bit each day and I eventually ranked in the top 1% of users on our forums in terms of reputation points. End users, as well as colleagues from other offices who I'd never met, began to recognize my name. Writing was starting to give me visibility, and I just share this to show that little bits of writing every day add up over the long term. Once I was somewhat confidently answering questions on our user forums, I went back to my manager and was like, hey, what do I need to do to progress my career? And he suggested that I start writing posts on our company blog. Once again, this was new and scary. I remember just staring at a blank screen and thinking, oh my gosh, how am I going to sound competent when I have to write so many words? But I pushed through the discomfort and I published a post and then I kept going, becoming a very frequent author on our blog and these activities are part of what led to my current role as a developer advocate at Grammarly, whose mission is to improve lives by improving communication. I was able to take the writing skills I developed over my years as a software engineer and then turn them into a core part of a career that I love. Writing to users improved my career at a company where I was working and then helped me pivot to a slightly different career at other companies. All right, that's enough about me. Let's look about you and how you can write to help your users. Your users might be internal at your company or external users of your product. Whatever the case, write to them. Help them. There are so many ways you can do this, and what makes sense for you will be customized for your company and your role. But let me give you some ideas. You can answer questions in forums. You can write blog posts and tutorials on your company's blog. You can write documentation. You can respond to users bug reports and requests for features. You can write reason for outage reports. You can email your users. You can chat with your users on platforms like Slack or discord. Or you can even curate a newsletter. Perhaps you're thinking, why bother? This seems like a lot of work. Well, these are the sorts of things that can impact your company's bottom line. If your users are unhappy or confused or frustrated. Your role, your team, or your company may not be around for long. Now, you might also be thinking, well, this sounds great, but writing to my users is not one of my core responsibilities. How can I possibly make time for this? I encourage you to take a look at your career ladder or talk with your manager to discover what you need to do to progress to the next level. I've looked at a lot of technical career ladders, and almost all of them require you to demonstrate scope and influence. Showing that you're impacting your users through personalized help or more broadly on a larger, less personalized scale is a great way to do that. All right, so write to help your users. Second strategy for writing in order to level up your career is to write to educate the tech community. I believe that everyone has a story to tell. Seriously. Maybe you've worked really hard to become an expert in a technology. You've got a story, you can share what you know. Maybe you're in the process of learning something new. Share as you learn. This is a great way to reinforce your learning. Or maybe youll have failed spectacularly. Share your story so we don't make the same mistakes. You can share your technical skills as well as your soft skills, or some people call them core skills. I've written about a variety of topics on everything from data modeling to how to be successful remote employee to how to theme the Grammarly text editor SDK to match Taylor Swift albums. One of the great things about the tech community is that we are lifelong learners. We want to continuously improve and grow. So share what you've learned. So here are some ways that you can write to educate the tech community. You can answer questions on sites like Stack, overflow or Dev. You can participate in discussions on open source projects. You can chat in tech communities on platforms like Discord and Slack. You can share micro content on platforms like Twitter, LinkedIn, or Instagram. You can write tutorials or thought leadership articles on your own blog or on platforms like Dev Medium or LinkedIn. Or you can really go for it and write a book. So why do this? Well, I think there are two main reasons. First up, you can help others. It feels so good when someone comes back and tells you that what you wrote helped them solve their problem. But two, a little more selfishly, you can help yourself. The more you write, the more you will become known as the go to person on a topic that's going to help you demonstrate scope and influence in your current role. And it's going to get your name out there for potential new roles. For me, writing to the tech community is probably the scariest suggestion that I'm going to make today. And from talking with others, many people also fear writing in public. Not just speaking in public, writing in public. I've been asked questions like, what if I write something dumb or wrong and people call me out on it? I mean, people on the Internet can be mean. Chances are good you're probably going to get a few mean comments. There's no getting around that. You're going to have to focus on the positive comments and learn to let go of the negative and to be transparent. It's easier said than done. It doesn't matter how many kind comments I get, one mean community will wriggle around in my brain for days. So if you start to feel dragged down by the mean comments, just go back and reread the good ones. But you can also work to prevent some of them by having a trusted friend or colleague read your work before you publish it to spot check it for any glaring technical errors. You can also use a human or a tool to spot check your writing for spelling grammar mistakes. Getting both a technical review and a copy edit review will give you more confidence when you go to click publish. In the end, writing for the tech community will be worth it. Okay, third way to write to level up your career. Write to document team knowledge I love this gift from parks and rec where the mayor says, if there's praise, I will humbly accept it, but if there's blame, it's your fault. Have you ever looked at code and asked yourself, who wrote this nonsense? This code doesn't make any sense and there are no community to explain what's going on. And then you checked the git blame and realized that it was you. Yeah, me neither. Moving on. We all have opportunities each day to improve the daily work of our teammates, and potentially for our future selves by documenting team knowledge. So here are some guidelines. If you find yourself answering a question more than once, either verbally or in a chat, find a way to document it. Maybe you drop it in a readme, or maybe you put it in a team wiki, but drop it somewhere that others can easily discover it. Point people to it, and then ask them to improve it if it doesn't fully answer their question. When you make a decision on your own or as a team, document the decision and why you chose it. This doesn't have to be a big, huge document. I mean, if it is, that's great, but it can also just be like a quick paragraph that summarizes what you chose, with some bullets below it about other options that you considered and why you didn't choose them. Future teammates and future you will appreciate this context, and it can prevent you from having to revisit the same decision again in the future. Finally, document team processes it's nice to feel needed, but it's not nice to feel needed at 03:00 a.m. When the person on call can't figure out how to fix a problem in your area, so they call and wake you up. Document team knowledge and processes so that your team can easily keep moving forward, even if a key person is offline. All right, fourth strategy. Write to encourage your teammates have you ever worked with someone who's a natural encourager? Kindness just seems to ooze out of them. They're always ready to compliment your latest pull request or the way you ran a meeting, or how cute your shoes are. It feels so good to be around them right now. Most of us are not natural encouragers. We might occasionally remember to say something kind when someone goes above and beyond, but otherwise we just stay focused on our jobs. I am very much the second type. My husband will tell you that I am quick to criticize and slow to praise. He loves that about me. I'm very task oriented and I tend to focus on accomplishing my tasks. When I feel overwhelmed and behind on my work, I go even deeper inside this bubble of solitude. When I was at my previous company, I decided to be more intentional about celebrating the successes of my teammates. When someone shared something they'd accomplished in our team chat, I made sure to celebrate it with them. When I saw someone doing good work, I complimented them publicly in our team chat. And when someone did something to help me out, I made sure to thank them through our company's platform for recognizing others. To be clear, this was not something that came naturally to me. This was something I chose to intentionally do. Shortly after I left that company, a former colleague, Megan, tweeted this. She said, we still talk about youll and how amazing and brilliant and kind you are. And I was like, what, me kind? They had noticed and appreciated my efforts to be kind. Tell your teammates that you appreciate them and that they belong. They are going to thrive in this environment. I encourage you to be intentional in encouraging your teammates. If you're likely to forget, set a reminder on your calendar every Friday to encourage a teammate. When someone does great work, celebrate it and let others know about it. If your company doesn't have a platform like bonusly or lattice for sending public compliments. You can post them in team chats or send an email to the person and CC your manager and CC their manager. The person you're thanking will appreciate it, and it's going to give both managers visibility into what you're working on. All of these efforts can help create a culture of compliments on your team. When you start recognizing other strengths, they're likely to start recognizing yours. And that's a win for everybody. Which leads to my last point in this section. Write to record your accomplishments. Now, I don't know about you, but I have to write a performance review every year. And every year I kind of dread this process. Here's the thing. Your performance review is your chance to make a case for yourself as to why your manager should give you a bonus, a raise, or a promotion. Do not waste your performance review I know you'd rather be doing something technical than working on your performance review. But do not waste your performance review. I write the longest, most detailed performance reviews. I format them. I bold the key points. It's possibly a bit over the top, but it works. Managers are busy. It's easy for them to overlook or forget your accomplishments. Your performance review is your chance to remind them of all the amazing things you've done so that they can go advocate for you. So here's what I recommend throughout the year, regularly document what you've accomplished. If you typically track all of your work in your to dos in task tracking software like Jira or Asana, you're good to go. But if you track the main step from your team in one place and then you end up tracking other to do's in a list that ultimately gets deleted or thrown away. Set aside time, weekly or monthly, to document what you've accomplished and who you've helped. Whenever you get a compliment, drop it in a doc dedicated just to compliments. When it's time for your performance review, you can group items together into bigger themes. Then copy and paste in any relevant compliments and state what you've accomplished. Don't undersell yourself. This is not the time to be humble. Tell your manager what you've accomplished, the impact it had, and how it moved your team's or your company's goals forward. Make it super easy for your manager to make a case for your raise after you've done this. Update your resume, your CV, your LinkedIn, whatever you use to show potential employers what you've accomplished. You're probably not going to remember the impact you had three years from now when you need it updated, so write it down now while it's fresh in your mind. Over time, your resume is going to become really strong if you do this regularly. Now, for me personally, LinkedIn has been huge for my career. I got my last two jobs through LinkedIn, and I've also gotten speaking opportunities through LinkedIn. Taking the time to document your accomplishments and your impact can help you at your current company and help your career prospects at other companies as well. When you're having a down day, maybe you're feeling like an imposter or that your work isn't living up to your standards. You can open up your compliments, doc or your performance review. It's a great pick me up to see the amazing things you've accomplished and all the nice things people have said about you. All right, so let's recap five strategies for writing to level up your career. Write to help your users. Write to educate the tech community, right to document team knowledge, right to encourage your teammates, and right to record your accomplishments. And I encourage you to pause and think right now. What strategy can you try over the next month? Write it down. Make a commitment to yourself. What do you want to try out now? Now that we've talked about the ways that you can write to level up your career, you might be concerned about the quality of your writing. How are you going to make sure you write in a way that people understand what you're trying to convey? I'm going to share with you three ways you can improve the quality of your writing. So this might seem super obvious, but it's super important, so I'm going to share it anyway. Don't be a jerk. I've created this very scientific scale of being a jerk. So down at the bottom, we have those times when you intentionally act like a jerk. Perhaps it makes you feel better to put others down. Up at the top, we have those times when you're unintentionally accidentally being a jerk. Maybe you don't realize that the words you're using negatively impact others, or that others may misinterpret the tone in your writing. Now, to be totally transparent, I've done things all over the scale. I'm not proud of it, but it's happened. So what can we do to not fall on the scale? Well, be empathetic. Put yourself in your reader's shoes. They don't want to feel dumb or that their technology of choice is somehow lesser than yours. As the old saying goes, you catch more flies with honey than vinegar. So don't put others down because you're likely to lose them as a reader. Now, up at the top of the scale, we have those times when you're unintentionally accidentally being a jerk. It's kind of easy to unintentionally be a jerk in your writing. The words you choose matter. So use inclusive language, even if you don't care about being inclusive. For the sake of being inclusive, be inclusive for the sake of getting your message across. I recommend perusing Google's developer documentation style guide to get recommendations on words to avoid. Now, full disclosure, I'm a Grammarly employee, but I feel like I need to throw out there that there are tools like Grammarly that provide suggestions on inclusive language. Your tone can also get you into trouble because you know exactly what you're trying to convey, but your readers may not. So this is another case where having someone else, either a human or a tool like Grammarly, can really help. Last point of not being a jerk every time you write to someone else, either privately or publicly, is a chance to make their day a little bit brighter or a little bit crummier. So I encourage youll to use your words to make someone else's day a little bit brighter. My former teammate Mark Smith included a fun gift whenever he accepted someone's pr, and this always made my day a little brighter. I have a colleague now who uses emojis to share his appreciation and when he thinks someone's done a good job and it makes us all feel so good. So use your words and youll gifts and your emojis to make someone's day a little brighter. The second way you're going to improve the quality of your writing is to practice. Just do it. I encourage you to regularly set aside time for writing. At about the same time that I started writing technical blog posts at work, I decided to start a personal blog where I wrote about anything that interested me. Now, ultimately, my blog never took off. I never became Internet famous because of it, but I got a ton of practice writing. My goal was to write two posts a week, and I did that consistently for a little over a year. Were my posts good? But my blog allowed me to develop my personal voice, which I still use today. In my professional writing, I'm able to write higher quality articles and write faster than I did years ago, and that's because of all of the practice that I have. So I encourage you set aside time to write regularly. Now, earlier in this talk, we talked about five strategies to write to level up your career, and I encourage you to pick one way now. Put a block on your calendar to do that. Maybe you want a daily reminder for shorter content, or maybe you want a weekly reminder for monthly content. But set aside the time and follow through. You will get better just by practicing. All right, my final recommendation for you today is to educate yourself on how to be a better wider there are a few different ways you can do this. You can use an aipowered writing assistant like Grammarly that will teach you as it reviews your content. Another way to educate yourself is to find a writing partner. You can set up regular writing reviews to get feedback. This will help you improve your writing and hold you accountable to following through on your commitment to write, which is a win win. Look for patterns in their feedback, identify your weaknesses and work to improve. There are so many ways to learn to be a better writer. You can read a book. I know I've got docs for developers. It's on my current reading list. There are excellent articles available for free online. You can attend workshops. Megan Grant and I led a workshop last fall on how to get your first technical article published. Or you can take an online course. Lots of options out there, so see what works for you. Give it a shot. Let's recap. So at the beginning of this presentation, I shared five strategies for writing in order to level up your career. And then I shared three ways to improve the quality of your writing. Don't be a jerk. Practice and educate yourself. So those are ways to improve the quality of your writing. Once again, I'm going to encourage you to pause and think, what do you want to try over the next month? And commit to doing it? If you want to dive deeper into these strategies, get a quick overview. Later this week, share it with a colleague. You can check out a blog post I wrote on the Grammarly for developers. Blog covers the same content, so check that out. Share it with your networks. In closing, use the power of the written word to level up your technical career. I cannot wait to read what you write.", "words": [], "utterances": null, "confidence": 0.958980353557389, "audio_duration": 1754.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- The written word is powerful. It can get you into trouble if you're not careful. But it also has the power to level up your career. Here are five ways to improve the quality of your writing.\n- After grad school, I started working as a software engineer. My manager recommended that I begin answering questions on our user forums. I eventually ranked in the top 1% of users on our forums in terms of reputation points. Writing to users improved my career at a company and then helped me pivot to a different career.\n- Your users might be internal at your company or external users of your product. Help them. There are so many ways you can do this. Take a look at your career ladder or talk with your manager to discover what you need to do to progress to the next level.\n- Second strategy for writing in order to level up your career is to write to educate the tech community. The more you write, the more you will become known as the go to person on a topic. It's going to get your name out there for potential new roles.\n- Third way to level up your career: Write to document team knowledge. Document team knowledge and processes so that your team can easily keep moving forward. Finally, document team processes it's not nice to feel needed at 03:00 a. m.\n- Most of us are not natural encouragers. Set a reminder on your calendar every Friday to encourage a teammate. When someone does great work, celebrate it and let others know about it. All of these efforts can help create a culture of compliments on your team.\n- Your performance review is your chance to make a case for yourself as to why your manager should give you a bonus, a raise, or a promotion. Set aside time, weekly or monthly, to document what you've accomplished. Taking the time to document your accomplishments can help you at your current company and help your career prospects at other companies.\n- Five strategies for writing to level up your career. Write to help your users, educate the tech community, document team knowledge. What strategy can you try over the next month? Write it down. Make a commitment to yourself.\n- Don't be a jerk. Use inclusive language, even if you don't care about being inclusive. The words you choose matter. Set aside time for writing. You will get better just by practicing.\n- You can use an aipowered writing assistant like Grammarly to teach you. Another way to educate yourself is to find a writing partner. Set up regular writing reviews to get feedback. There are so many ways to learn to be a better writer.\n- Use the power of the written word to level up your technical career. Here are three ways to improve the quality of your writing. Once again, I encourage you to think about what you want to try over the next month.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.06, "text": "written communication", "timestamps": [{"start": 241296, "end": 242650}]}, {"count": 1, "rank": 0.05, "text": "regular writing reviews", "timestamps": [{"start": 1649312, "end": 1650406}]}, {"count": 2, "rank": 0.05, "text": "other companies", "timestamps": [{"start": 487292, "end": 488120}, {"start": 1295712, "end": 1296346}]}, {"count": 3, "rank": 0.05, "text": "Document team knowledge", "timestamps": [{"start": 837532, "end": 839210}, {"start": 945630, "end": 946966}, {"start": 1333692, "end": 1335270}]}, {"count": 1, "rank": 0.05, "text": "technical blog posts", "timestamps": [{"start": 1555866, "end": 1556906}]}, {"count": 4, "rank": 0.05, "text": "team knowledge", "timestamps": [{"start": 838102, "end": 839210}, {"start": 875262, "end": 876254}, {"start": 946342, "end": 946966}, {"start": 1334242, "end": 1335270}]}, {"count": 1, "rank": 0.04, "text": "technical career ladders", "timestamps": [{"start": 583788, "end": 585122}]}, {"count": 1, "rank": 0.04, "text": "good work", "timestamps": [{"start": 1029372, "end": 1030134}]}, {"count": 1, "rank": 0.04, "text": "practice writing", "timestamps": [{"start": 1569752, "end": 1570930}]}, {"count": 4, "rank": 0.04, "text": "document team", "timestamps": [{"start": 837532, "end": 838410}, {"start": 932076, "end": 933158}, {"start": 945630, "end": 946554}, {"start": 1333692, "end": 1334502}]}, {"count": 1, "rank": 0.04, "text": "other people", "timestamps": [{"start": 380834, "end": 381640}]}, {"count": 9, "rank": 0.04, "text": "ways", "timestamps": [{"start": 276488, "end": 276742}, {"start": 505892, "end": 506094}, {"start": 676092, "end": 676390}, {"start": 1359604, "end": 1359774}, {"start": 1372056, "end": 1372418}, {"start": 1634252, "end": 1634454}, {"start": 1667832, "end": 1668034}, {"start": 1702596, "end": 1702862}, {"start": 1713268, "end": 1713406}]}, {"count": 1, "rank": 0.04, "text": "great work", "timestamps": [{"start": 1084252, "end": 1085062}]}, {"count": 2, "rank": 0.04, "text": "written word", "timestamps": [{"start": 220872, "end": 221570}, {"start": 1748428, "end": 1749158}]}, {"count": 15, "rank": 0.04, "text": "users", "timestamps": [{"start": 289600, "end": 290490}, {"start": 400948, "end": 401306}, {"start": 405156, "end": 406010}, {"start": 480988, "end": 481442}, {"start": 493808, "end": 494726}, {"start": 495312, "end": 495766}, {"start": 498758, "end": 499126}, {"start": 524808, "end": 525146}, {"start": 533612, "end": 534470}, {"start": 536508, "end": 536914}, {"start": 555172, "end": 555626}, {"start": 568472, "end": 568846}, {"start": 593168, "end": 593526}, {"start": 603092, "end": 603870}, {"start": 1327736, "end": 1328610}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}