{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/a049861d-f593-47c4-b89e-96500198dfd3", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["being", "both", "business", "conf fourty two", "constructive", "engineers", "from", "had", "harvard", "insights", "pegasystems", "professors", "senior manager cloud engineering", "terms", "yasia romanets"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "964fc227-f3a8-451b-b03b-e6659450d7b5", "status": "completed", "error": null, "text": "Hi folks, my name is Yasir and I'd like to invite you to my talk positive and constructive feedback and how you had it all wrong. Here is a quick glimpse at the agenda them I'll start off with an introduction of myself so that you know who's talking to you and why you should listen to me. I will introduce the concept of the standards devotion matrix and say a few words on inquiry and feedback on different cultures. I will then reframe the word feedback into slightly different terms. Afterwards, I will summarize the learnings from this talk and send you off on your way with some homework to put those learnings into practice. So first off, a few words about myself. I have over nine years of professional experience with the past five years spent as a cloud engineering manager at Pega. I am a graduate of the leadership consortium, which is a course taught by Harvard Business School professors with very practical learnings for your professional and daily life. And I rely very heavily on this talk on the learnings from that course. Last year I was named as top 100 women in cloud computing in Poland. I hold a master's degree in machine learning, which is such a catchy topic recently that I felt compelled to include this information. And privately, I am an avid natural language learner with seven and counting and a proud bomb to a beautiful son and the cutest cat. So let's now get into the meat of the talk. Let's talk about the standards devotion matrix. This is a concept that is going to help you locate yourself in relation to the people around you in terms of your standards for them, how high your standards are and what you expect from them, and in terms of your devotion to them, essentially how much you care about them being successful, or how much they feel that you care about them being successful. And we're going to go through each quadrant one by one and to see some of the behaviors you might exhibit when you land in each of the quadrants. So let's start with the bottom left quadrant. Your standards are low for the people and your devotion is very low. This is called neglect. The behaviors you might exhibit would be essentially not paying attention, not caring about what work they're doing or how they're doing it. And I'm not going to spend time here because this is a situation that arises very, very rarely and is not necessarily a place where you want to end up in far more frequently. You will end up in the top left corner, which is called severity, which means that your standards for the people around you are very high, but your devotion to them is very low. So they do not necessarily feel that you are deeply devoted to their success. And this is a situation that you frequently have with your peers. There is this phenomena called peer bias when you expect far more from your peers than from someone on higher or lower level than you. Oh, I'm working so much. I'm doing so much. Why aren't you you doing as much as I'm doing? On the opposite side is the bottom right quadrant, where people feel that you are deeply devoted to their success, but you're not necessarily setting very high standards for them. This is called fidelity, and honestly, this is a little bit too kind. So you're not expecting them to do a lot of work. You're making sure that they're comfortable. And people tend to stagnate with you when you fall into this quadrant because they're not growing as individuals, they're not growing as professionals. The situation you want to end up in is, of course, as in any matrix, the top right quadrant. Valerius Maximus, a greek philosopher, called this justice, and Anne Morris and Francis Fry, whose book you will find in my sources, called this love. This is a place where you have high standards for people and they feel that you are deeply devoted to their success. Ideally, you will end up in this category with your direct reports, but human nature has it slightly different things, making things hard for us. So normally people oscillate between these two categories, oscillate between severity and fidelity. It goes something like this. You might start off in severity having very high standards for people, and then people complain, oh, you're pushing me too much. I'm tired, I'm burning out. I can't take this anymore. There's too much on my plate. So subsequently, you try to make people feel comfortable, you lower your standards, you try to make sure that they're not overworked and that they feel very at ease with you. You're lowering your standards, and little by little you end up in fidelity. Until one morning you wake up and you say, okay, this is enough. No work is getting done anymore. I need to increase my standards again. And boom, you end up back in severity. So how do you break this loop? How do you move along the axis of devotion? And how do you move along the axis of standards where there are two components to this? If you want to increase your devotion, you do that through inquiry, and I'll talk about that in a second. And if you want to increase your standards, you do that through feedback. The main topic of this talk, which I will delve into in a couple of slides. So let's start off with the devotion axis and inquiry. So when you want to reveal your devotion, you essentially are going to ask people questions, how can I help you be the most successful or best self? How can they provide more opportunity for you? More and more and more questions you ask, the more they're going to feel that you truly, really deeply care about their success and about them as individuals. And remember, the currency of love is attention. So before we move on to talking about feedback and different components of feedback, I want to say a few words about the cultural aspect. So Erin Mayer performed a lot of research in terms of culture and the role of feedback in different cultures. And she drew this axis with direct negative feedback on one end and indirect negative feedback on the opposite end. So essentially, you will have some countries, some cultures where straight off the band, people are going to be very direct and they're going to tell you straight up what you're doing wrong. Netherlands is going to be on the complete opposite end of indirect negative feedback, sitting very hardly indirect feedback. A person from Netherlands is going to tell you very, very clearly what you're doing wrong, and they're going to do that in front of a group of people. And nobody's going to consider this route. Japan, for instance, sits on the opposite side of the spectrum, where a japanese person will never dream about telling you something directly negative, but you will have to listen in the things they're not saying for the things that you need to improve on. And us sits somewhere in the middle a little bit, leaning into the indirect negative feedback, for instance, with the very, very famous compliment sandwich technique, which, by the way, you should never use. But this is not quite the topic of this particular talk. So I want to reframe this a little bit into terms that will allow you to give feedback very accurately, no matter the culture. So we're going to divide feedback into two categories. There's positive reinforcement and there's constructive advice, and I am going to portray the difference between the two right now. So essentially, positive reinforcement is catching somebody doing something well and telling them, do more of this. And constructive advice is catching someone doing something not quite well and telling them, you know what? Do this a little differently. And when it comes to timing, for positive reinforcement, usually 12 seconds is sufficient to provide positive reinforcement. And for constructive advice, at most 10 seconds, it has to be very short. 10 seconds is quite enough. Positive reinforcement is going to be very specific and sincere. And constructive advice, again, has to be very specific. Can't be, oh, this is all terrible. You have to pick up on a specific action or activity with the people that you're talking to, and it has to be non judgmental but developmental. So essentially I am telling you this for the sake of your development, for the sake of your success and positive reinforcement, you're going to give all the time and constructive advice you're going to give ASAP after you have noticed that particular activity that you want fixing. And the reason why I'm saying give positive reinforcement all the time is that there is a specific ratio of these two between these two that is needed to make this successful. And the ratio is five to one. So essentially, in order to be able to give constructive advice that is going to guide the person, to stir the person in the right direction, you need to have built a foundation of positive reinforcement to give yourself credibility. If you're going to only give constructive advice, then the person is going to say, oh, they're never noticing the good things that I'm doing, they're only focusing on the bad. I'm not going to take this very seriously, but if you give positive reinforcement very frequently, this will give you credibility. This will give your worst credibility that, okay, this person is noticing not only the difficult things but also the positive things. And essentially the five to one ratio means that if you want to give constructive advice once a day, you have to give positive reinforcement five times a day. If you want to give constructive advice once a month, you need to give positive reinforcement once a week and so on. But the reason why you need to start giving positive reinforcement straight away and all the time is because you need to give constructive advice as soon as possible. And if you do not have that foundation built up, it is not going to be effective. So be very keen to remember this ratio. So to sum up, we talked about the standards devotion matrix. We delved into how to move along the axis of the matrix and get into the justice and love category with inquiry and feedback. We talked about being mindful about cultural differences and we introduce the concept of positive reinforcement and constructive advice. Now on to the homework. So first off, my task for you is to find yourself on the standards devotion matrix. What is the default for you? Find yourself in all categories with whom you are, in which quadrants. The second task is to reveal your devotion. So ask questions. The more you ask, the more you're going to build up on that devotion quality. And the third task is to practice giving constructive advice. And you can come up to a friend and tell them, you know what, I'm going to practice this. I'm going to practice giving you very specific, short, sincere, non judgmental, constructive advice. I might not be great at it at first, but I need to practice to be better. So please help me practice with that. I'm going to showcase you my sources. It's a book called Unleashed by Frances Rye and Anne Morris of the Leadership Consortium. It is a book of memorable deeds and saying by Valeris Maximus and the Culture mob by Erin Mayer. If you want to get some additional reading on feedback, Marcus Buckingham has a great book called Feedback Fallacy that I encourage you to check out. Thank you so much for tuning in to my talk, and I hope you enjoy the rest of the talks in Con 42 DevOps 2024 conference. Take care.", "words": [], "utterances": null, "confidence": 0.943948843503941, "audio_duration": 913.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Yasir will talk about positive and constructive feedback and how you had it all wrong. He will introduce the concept of the standards devotion matrix. Afterwards, he will summarize the learnings from this talk and send you off on your way with some homework to put those learnings into practice.\n- The standards devotion matrix helps you find yourself in relation to the people around you. It shows how high your standards are and what you expect from them, and in terms of your devotion to them. Normally people oscillate between these two categories, oscillating between severity and fidelity.\n- So when you want to reveal your devotion, you essentially are going to ask people questions. More and more and more questions you ask, the more they feel that you truly deeply care about them. And remember, the currency of love is attention. Before we move on to talking about feedback, I want to say a few words about the cultural aspect.\n- We're going to divide feedback into two categories. There's positive reinforcement and there's constructive advice. There is a specific ratio of these two between these two that is needed to make this successful. The ratio is five to one.\n- The first task is to find yourself on the standards devotion matrix. The second is to reveal your devotion. The third is to practice giving constructive advice. I hope you enjoy the rest of the talks at Con 42 DevOps 2024.", "auto_highlights_result": {"status": "success", "results": [{"count": 13, "rank": 0.07, "text": "positive reinforcement", "timestamps": [{"start": 578562, "end": 579730}, {"start": 589670, "end": 590774}, {"start": 611396, "end": 612406}, {"start": 615016, "end": 616334}, {"start": 626650, "end": 627874}, {"start": 661508, "end": 662806}, {"start": 678076, "end": 679154}, {"start": 707572, "end": 708906}, {"start": 728172, "end": 729778}, {"start": 756292, "end": 757402}, {"start": 764904, "end": 766014}, {"start": 772136, "end": 773310}, {"start": 812596, "end": 813614}]}, {"count": 3, "rank": 0.07, "text": "indirect negative feedback", "timestamps": [{"start": 474872, "end": 476254}, {"start": 497808, "end": 499142}, {"start": 544272, "end": 545798}]}, {"count": 13, "rank": 0.07, "text": "constructive advice", "timestamps": [{"start": 580418, "end": 581750}, {"start": 597472, "end": 598662}, {"start": 617032, "end": 618290}, {"start": 631852, "end": 632882}, {"start": 665560, "end": 666494}, {"start": 697216, "end": 698438}, {"start": 713572, "end": 714602}, {"start": 751988, "end": 753658}, {"start": 759972, "end": 760874}, {"start": 777964, "end": 778994}, {"start": 813848, "end": 815170}, {"start": 846272, "end": 847610}, {"start": 862602, "end": 863886}]}, {"count": 1, "rank": 0.07, "text": "direct negative feedback", "timestamps": [{"start": 472504, "end": 473774}]}, {"count": 3, "rank": 0.06, "text": "high standards", "timestamps": [{"start": 262644, "end": 263246}, {"start": 312724, "end": 313406}, {"start": 340768, "end": 341526}]}, {"count": 14, "rank": 0.06, "text": "people", "timestamps": [{"start": 140768, "end": 141002}, {"start": 180972, "end": 181366}, {"start": 216408, "end": 216642}, {"start": 257108, "end": 257422}, {"start": 278236, "end": 278550}, {"start": 313608, "end": 314034}, {"start": 329986, "end": 330214}, {"start": 341728, "end": 342394}, {"start": 343168, "end": 343450}, {"start": 356212, "end": 356510}, {"start": 425256, "end": 425570}, {"start": 483938, "end": 484262}, {"start": 512228, "end": 512666}, {"start": 646032, "end": 646426}]}, {"count": 1, "rank": 0.05, "text": "machine learning", "timestamps": [{"start": 113860, "end": 114722}]}, {"count": 1, "rank": 0.05, "text": "talk positive and constructive feedback", "timestamps": [{"start": 42092, "end": 45026}]}, {"count": 1, "rank": 0.04, "text": "Harvard Business School professors", "timestamps": [{"start": 95248, "end": 96694}]}, {"count": 4, "rank": 0.04, "text": "standards devotion matrix", "timestamps": [{"start": 59028, "end": 60442}, {"start": 134028, "end": 135670}, {"start": 795824, "end": 797606}, {"start": 822344, "end": 823934}]}, {"count": 2, "rank": 0.04, "text": "Anne Morris", "timestamps": [{"start": 303796, "end": 304714}, {"start": 881724, "end": 882306}]}, {"count": 2, "rank": 0.04, "text": "different cultures", "timestamps": [{"start": 63432, "end": 64450}, {"start": 467848, "end": 468850}]}, {"count": 1, "rank": 0.04, "text": "Harvard Business School", "timestamps": [{"start": 95248, "end": 96202}]}, {"count": 7, "rank": 0.04, "text": "things", "timestamps": [{"start": 326760, "end": 327102}, {"start": 327452, "end": 327654}, {"start": 531772, "end": 532360}, {"start": 535788, "end": 536022}, {"start": 719528, "end": 719714}, {"start": 742992, "end": 743562}, {"start": 745030, "end": 745660}]}, {"count": 2, "rank": 0.04, "text": "Erin Mayer", "timestamps": [{"start": 461236, "end": 462350}, {"start": 891468, "end": 892706}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}