{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/5dc66aa6-c2ff-43c3-a8ee-8ac8438096f7", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["applied mathematician", "by", "cisgender", "computing", "concepts", "conf fourty two", "males", "neurotypical", "sara marzella", "those", "trying", "understand"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "07bd0d46-c2f9-488c-8f82-3605a23ac0d5", "status": "completed", "error": null, "text": "Hi. This short talk is to share with you some peculiarities of the quantum computer word that I've noticed over the years. In the three years that I've been involved in quantum computing, I collaborated with, learned from, and tutored people of all ages, genders, cultures, religions and backgrounds. But I've also been in context where the majority of people were male, heterosexual, white and cisgender. It was useful to observe those difference between those contexts and those inclusive ones. In the former, those air was stagnant, the interactions unproductive. There was an atmosphere of competition and defense of own's work that soon made them stale and obsolete. Speeches were often dry discussions not aimed at building something together. Speakers did not aim at bringing something to others, but at showing their superiority. And those who ask questions were often not motivated by real interest. On the contrary, they usually already knew the answer, but wanted to show off to others. I think that the key of the success of the inclusive environments is the awareness of difference. Knowing one's own physical and cognitive peculiarities goes along with those respect of for others. This leads to mutual consideration, open mindedness and willingness to share one's work. And that's for two reasons. First, the knowledge and skills you build during your life are unique. No one can steal them from you, so don't be afraid to share them. And second is that the collaboration is crucial. It could be hard to go on on your own. I learned a lot in inclusive environments. On a technical and on a personal level. People much more experienced than me found time to listen to my doubts, to explain what I did not understand and guide me step by step in different aspects. On the technical side, they taught me how to create a demo, but not with arrogance. They let me make my own mistakes, highlighting them and allowing me the time to learn and improve from them. On the social side, I found less technical people, but socially skilled, who helped me build my network and figure out how to move in such a fickle world. I believe that the predisposition for inclusiveness of such environments is rooted in two causes. On the one end, we can observe that very slowly our society is changing. The push toward inclusiveness is getting stronger, and we are beginning to see the first results. On the other hand, it is related precisely to quantum computing. Quantum technologies will have a massive impact on our reality. We already know that with sufficiently powerful quantum computers, we will revolutionize many sectors with radical impacts on our lives, just to mention two of them. The discovery of new materials to fight climate change and reduce our impact on planet Earth, or the possibility of finding new medicines for diseases now dreaded or incurable. But those change needs to be addressed together. We should not remain deaf to the lessons artificial intelligence are imparting to us right now. We are developing them poorly, filling them with dangerous biases, and failing to legislate and listen to those addressing the ethical problems they might trying. History has shown us over and over how a new technology can be as wonderful, if well managed, as fearsome if misused. We need to develop technologies in a more inclusive environment, respectful of others. To have a broader view, we should leverage on a diverse environment and on the fact that new technologies cover different aspects of our lives. We can call in experts in different fields from all over the world, from any culture or identity, because each background can give different insights to the implementation and use of technology. An inclusive environment help us better understand both how to harness it and how to avoid gray areas that might backfire on us, or at the very least, how to live as few as possible. Not only that, thinking about technology even before it gets to the supremacy stage, imagining how we can integrate it, even visually into everyday life will save us a lot of effort later. Let's see just a few examples of the professions that will be affected by the quantum computing revolution to get an idea of the cross cutting nature of its impacts. Some of you may have already heard about post quantum encryption. Many companies, particularly banks or those involved in security, are already taking steps to make their data secure to possible decryption attacks that will come with quantum algorithms. Data that has been or is being stolen now, even if not decryptable at the moment, will most likely become decryptable in a few years, so it is necessary to move in anticipation. One aspect that we are considering, much less is quantum readiness to data management and architectures. Even with quantum computers ready on real use cases, we might not be able to use Azis data. We often have outdated architectures and data cataloging systems that are already struggling to be optimized on current systems. Those will make it impossible to use quantum algorithms on such structures. It is time to adapt them and be ready to incorporate quantum solutions when they become available. Another area that will be involved will be graphics and interfaces. Quantum systems will have to be usable, so it is important to create integrated interfaces between classical and quantum systems to ease the transition. And finally, the trying of technology translations figures is becoming increasingly crucial. That is, those figures who have hybrid knowledge both of quantum computing and other fields such as finance, chemistry, telecommunications and so on. We need them in order to facilitate and optimize communication between experts in quantum solutions and those in the various fields of application and we need them to understand when and how to apply quantum technologies. We should look back at artificial intelligence and see how using it with out of control hype has led to its indiscriminate, even inappropriate application resulting in wasted money and time. And for quantum technologies this issue will be even more relevant. In conclusion, over the years I've learned from and collaborated with people older and younger than me, with male, female and queer people, with Christians, jewish, Muslim, hindu and artist people, with people in physics, mathematics, business, comics, chemistry and graphic design. And in my experience I can tell you that not only it is possible to create more inclusive work environments and make the most of them, but it is already happening. Please feel free to reach out to me on social networks if you would like to talk about quantum technological and social revolution or if you have any ups about this talk. Thank you for listening and happy learning.", "words": [], "utterances": null, "confidence": 0.922589323374343, "audio_duration": 604.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- In the three years that I've been involved in quantum computing, I collaborated with, learned from, and tutored people of all ages, genders, cultures, religions and backgrounds. We need to develop technologies in a more inclusive environment, respectful of others. Quantum technologies will have a massive impact on our reality.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.08, "text": "quantum technologies", "timestamps": [{"start": 221270, "end": 222590}, {"start": 521896, "end": 523410}, {"start": 544512, "end": 545894}]}, {"count": 2, "rank": 0.07, "text": "quantum computers", "timestamps": [{"start": 229602, "end": 230978}, {"start": 430556, "end": 431634}]}, {"count": 4, "rank": 0.07, "text": "quantum computing", "timestamps": [{"start": 30428, "end": 31698}, {"start": 219288, "end": 220690}, {"start": 372088, "end": 373086}, {"start": 496848, "end": 497974}]}, {"count": 2, "rank": 0.07, "text": "quantum algorithms", "timestamps": [{"start": 400532, "end": 402110}, {"start": 451332, "end": 452394}]}, {"count": 2, "rank": 0.07, "text": "quantum solutions", "timestamps": [{"start": 458282, "end": 459578}, {"start": 512292, "end": 513470}]}, {"count": 1, "rank": 0.07, "text": "post quantum encryption", "timestamps": [{"start": 385324, "end": 387110}]}, {"count": 1, "rank": 0.06, "text": "new technologies", "timestamps": [{"start": 308916, "end": 309978}]}, {"count": 2, "rank": 0.06, "text": "inclusive environments", "timestamps": [{"start": 97952, "end": 99494}, {"start": 143632, "end": 145110}]}, {"count": 8, "rank": 0.06, "text": "people", "timestamps": [{"start": 35042, "end": 35302}, {"start": 44448, "end": 44730}, {"start": 148750, "end": 149258}, {"start": 184386, "end": 184758}, {"start": 555924, "end": 556318}, {"start": 561562, "end": 562160}, {"start": 567086, "end": 567700}, {"start": 568696, "end": 569010}]}, {"count": 1, "rank": 0.05, "text": "technology translations figures", "timestamps": [{"start": 485372, "end": 487646}]}, {"count": 1, "rank": 0.05, "text": "different fields", "timestamps": [{"start": 316728, "end": 317694}]}, {"count": 1, "rank": 0.05, "text": "new materials", "timestamps": [{"start": 240128, "end": 240934}]}, {"count": 1, "rank": 0.05, "text": "classical and quantum systems", "timestamps": [{"start": 477004, "end": 479426}]}, {"count": 1, "rank": 0.05, "text": "new medicines", "timestamps": [{"start": 247926, "end": 248870}]}, {"count": 2, "rank": 0.05, "text": "different aspects", "timestamps": [{"start": 160596, "end": 161950}, {"start": 310692, "end": 311706}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}