{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/1e1b56ce-2751-44f6-a007-9d3c3154b8b8", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["app", "applications", "computing", "conf fourty two", "cuttingedge", "hype", "michal jankowski", "objectivity part of accenture", "quantum computing enabler", "realworld", "required", "skills"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "d9c2aeb6-bcc7-4535-bf70-8fb9f9d178c0", "status": "completed", "error": null, "text": "Hello and welcome. My name is Mihankowski and today I would like to talk you through the journey about out quantum computing. I would like to ask from the question is it actually real or is it hype? Just brief introduction of myself. I'm working for objectivity. I'm ahead of emerging technologies so I onboarding cuttingedge technologies to our customer organizations. Right now my main focus is quantum computing. Previously I was focusing on Nova roll call, looking on my whole career. I'm person with a strong technical background, still working and playing with the technology, sharing the knowledge during different events like this and others organizing conferences and I'm also Microsoft MVP in category Asia. I would like to encourage you to scan the contact or invite me on LinkedIn because if you have any question just ping me on LinkedIn or send me an email and I'm happy to answer all your questions. Organization when I'm working in objectivity is a software house. It is part of Accenture and we are existing on the market over 30 years already. We are specializing in building custom made solution for our customers and this is our core service and together those core services we have some additional services like quantum computing, data and AI, machine learning and similar. But today I would like to focus on just brief introduction to the quantum technology agenda is very easy. I would like to ask on the question what is quantum computing, why we should look at this right now and how it can affect my organization. I've been talking about this technology from the perspective that we are looking on in our organization and I will give you also some insights when I not cover some kind of the topics and I will leave them for you. So let's start with the question, what is quantum technology? Quantum technology, this is the new way of maybe not so new away, but this is like a way of making the calculation that give us a possibility either getting results faster, either getting better quality results, or working with bigger problems. Also, there's a possibility that when we are running quantum algorithm we could get multiple scenarios. And this is based on the quantum physics and quantum phenomenon. I do not want to go deeper into this topic because I'm afraid that if I would like to do it correctly, it should take like almost half of the presentation. If you think about what is the difference between quantum computing and classical computing, think about the book. If you have classical computer, you need to read page by page. If you have quantum device, you can read the whole book at once and think about the calculation, thinking about solving complex problems. This is like this on this maze, like this animation of the maze. You can see that each time that we are just having a junction there, we can check both group path in the same way. Very often when I'm talking about the quantum computing, there's always a question, will it replace the classical computing? Actually not. For me, it is like an extension, like something that will be working in concurrent way. Some of the problems will be solved on the classical computer. Some of the problems will be able to run on the quantum devices. Looking on different predictions, it seems that the quantum computing will have bigger adoption from the commercial perspective between five to ten years. I providing here a quote from the report, state of the quantum 2022 from November 2022. And you can see there in the report there is information that 63% believes that commercialization of the quantum computing will hit the market in next five years. If we extend this timeline to 2030, 90% of organizations believe that they will be transferred by quantum computing. And actually probably you are thinking what is possible in the quantum computing. And when I started my journey, I was thinking, is it possible to run my application on the quantum device? And it was easier than I expected. This is example of IBM quantum composer. This is one of the quantum devices that is available in the cloud. And you can see here that the screen is divided into five parts. On the left, top, left side you can see there's operations. So this is the quantum gates that you can put into the circuit. In the center. You have already modeled a quantum circuit by me. So you can see that in the circuit we are setting the qubit to zero, then applying node gate. It is working in very similar way like a classical node gate. So if we have zero, we are changing to one. If we have one, we are changing to zero. And at the end we are measuring the status of the qubit. This is visuala representation. On the right side you have the example implementation in one of the languages. Actually here is Opencasm 2.0. When you can see that we are setting the register with zero to zero, then we are applying x gate on zero and measuring it. In the bottom you have a prediction. This is a simulation of the circuit. And you can see probably as you expected, that if we have zero, if we are applying node gate, we are getting one. So you can see this. On the lower left side you can see that there is one. And also this is in the middle, in the bottom, in the center, there's other representation of that. And this is what you get without even logging to the system. You just open the environment and you can use it if you would like. To run this circuit on the real quantum device on the right side you have set up and run. To do that you need to just log into environment. So this is also you don't need to provide any credit card, you can get just the device and run it. When you hit this button you get information about different devices. So some of them are available for free, some of them are paid version. Actually the bigger quantum devices are available by paying for the access. Also you can see their information about total pending jobs. This is a queue that your job will be next one. So you need to wait a bit. It depends on the time of the day and when those processes that was scheduled before you will be completed, then your process will be also executed. As you can see here I select IBM Oslo. There is over 300 jobs before my job and this computer has seven qubits and first queue to quantum bulb. If I hit the run button then I would love to show you real time demo on this presentation. But actually we will need to wait a bit. So I just share the results in the moment. This is default setup and as you can see there are bigger quantum devices. There's like 64, 128 qubit quantum volume devices, different type of the number of qubits. So you can just select on which devices you would like to run the application. I decided to run this on the, on the smaller one, because for one qubit we don't need to have like a bigger device. And after running that we are getting the results. So you can see that actually we was waiting about 31 minutes in the queue, the system, the algorithm was running 2 seconds. And you can see also here that we was running 1024 times of the circuit. Why? Because when we are working with the quantum devices, we need to think about probabilistic approach and you can see that as a results. Most of our measurements as are predicted in the value of one, but some of them have also zero value. And actually this is when we, from our perspective looking on these results, we can say that almost 95% about this number, the results will be one. This is because the coherence times, because the noise, because different type of the challenges that current quantum computer have. If we have a bigger circuit then we have like a distribution because this is just one qubit here. And then when we are looking on the results we should have the maximum point of the distribution. As to answer in most cases and think about that. This is changing the way how we are working with the computing. We know from the classical world that two plus two is four. When we run the same application with quantum computing, we should say two plus four is in 99% or maybe 95%. It depends on the device four. So you can see that you can very easy run and I encourage you to just take a moment after this session and run your first algorithm on the quantum devices. And this is the way that we are modeling the circuit very deeply by using the quantum gates. But let's think about why we should look on this technology. And I already started at the beginning with the one of the quotes that the future is almost there. If you look on the different components like Capgemini Ey, you can see that they are also providing very same results. 2025 2027 three to five years. So that kind of the reports, and I encourage you to read either UI or Capgemini report about the quantum computer. They're a very nice report and you can learn a lot from them. They're also predicting that the quantum technology will start disrupting our market in next maybe three to ten years. It depends how you are optimistic about the technology. Very interesting report is also have been created by Heparin Research and published in November 2022. They check in the ecosystem of area adopters, how successful PoC that they created that they run on those devices. And looking at the report, they are mentioning that area adopters are highly satisfied with their most important quantum computing development activity. Almost all quantum computing area adopters survey indicated that progress to date was either very or somehow successful. So the algorithms that they run, the problems that they wanted to solve in this quantum computing was successful looking on the market. I just provided we had two groups of the vendors. On the one side we have hardware vendors. You can see here Microsoft, Google, Interhb, Alibaba, D Wave and IBM. And there are many more vendors that are providing quantum computing. Quantum devices that you can access. And actually it is important and interesting how you can access to these devices. On the one side you can buy devices by your own. It is not cheap device and probably it is good. In the next year you need to buy the new one because the technology is growing so fast. But much more easier way to start using quantum devices is either run your application on one of the quantum vendors clouds or also in the public clouds like Microsoft or AWS. And there instead of buying quantum devices, you can just render for a minute for the run of the circuit. This is like for me a game changer, especially when I'm working with the customers and I can use the public allow that they already have in the organization. And it is much more easier to create and also verify the proof of concept with those customers, because for them, in the long term usage of the quantum computing, if for example we use either Microsoft or Azure cloud, it'd be like additional invoice, additional row on their invoice. So it is much more easier to get it because we don't need to have a legal check because it should be already done for the scrubs. On the other side, you can see a lot of area adopters that are checking the technology, looking on this technology, trying to somehow predict its potential. And those area adopters are from the different sectors. You can see here, aerospace, banks, automotive, Freetown, finance and many more. And this is just top of the iceberg, which is very interesting when I'm talking about the quantum, discussing about the quantum from my perspective, it is also a lot of fear in this discussion. And looking on all of my previous experience, I haven't seen such much fear in scope of the discussion about the technology. And this is strictly connected with the fear about the possibility that on the one side, quantum computing can break the encryption keys. That encryption methods that we are using on daily, on daily life, think about that with the quantum device will be very easy decrypt the communication between our computer and our bank. So this is one of the topics is security. And you are trying to find the new way of sending, how to send the information in secure way. From the business perspective. The other dimension of fear is also that what will happen if we miss the moment, think about that. Somebody will develop the algorithm that will be give him like competitive advantage for the organization. A huge competitive advantage actually. He can live in bug all of the components that didn't manage to work on the quantum computing. Right now, regarding them computing back to the security, there is a question about the standards and there are already work to standardize the new way of using quantum devices and the new way how we should work with the encryption. We are looking, we as human being, we are looking of the new algorithms that are either quantum safe or we'll be using this on the quantum devices. So we are trying to prepare to the future, and this is a huge unknown when this future will get us. And this is strictly connected to what I said before. Maybe in two years, maybe in ten years, but definitely it will happen. Talking about the quantum devices, especially when I finish the session and we have a discussion next to the with the coffee, there is always a question about the bitcoin, if we'll be able to decrypt the bitcoin and for that kind of the cryptocurrencies some of them are quantum safe, some of them are not quantum safe. But I don't want to go here into more detail. I would like to share with you with my opinion why I believe that this revolution is happening right now. From my perspective, this is like three main reasons. First of all, I already mentioned that we can run quantum application in the cloud. When I started my journey with quantum computing like over one year ago, I thought that will be something very special, something that will need to have a very specific competences in that area. And that's true. But my thought evolve, my thinking evolve. And right now, for me, the quantum computing is one of the methods that we are using to some kind of the challenges. Sometimes classical computer can be better, sometimes quantum computing can be better, sometimes it could be hybrid. But the possibility that we can run those application on the cloud, in our existing application ecosystem give us the opportunity that we can very easily check the new method, check how quantum computing is affecting previous calculation. And on the right side you can see Microsoft Azure cloud, Microsoft Quantum, and you can see that there is like six quantum vendors that you can run, six quantum computing providers that you can select and run the application, selecting one of them, Quantum, Toshibia, QCI, regetti, Pascal, IonQ, you can select one of those providers, run your application and will be charged for the usage. So this is like something that you can very easily try your application, check how it's easy to start using that kind of technology. And actually Microsoft also giving you some additional credits that you can use in this purpose. The second very interesting and important vector that is helping me believing that is happening also right now is looking on the technology roadmaps from different quantum providers and progression in a speed improvement of quantum processors. Those processors are right now looking backwards into the past. All of the quantum vendors, most of the quantum vendors, and especially looking on those major ones like for example IBM, they are keeping their promise. They are keeping their promise with developing the new quantum processors with bigger number of the qubits. Those number of qubits allow us on the one side to handle error correction, on the other side allow us to handle bigger problems in this ecosystem. And this is growing very fast. The last thing, and for me, the first and the last thing are the most important. What is happening on those roadmaps. In previous years, we was mostly focusing on the number of the qubits. And right now we are switching the direction into building interconnectivity between quantum processors. So we are learning, we are developing the technologies that allow us to scale up those machines and why it has been so important. From my perspective, looking on my whole journey with the computers, I started very eerie. My first computer was Commodore 64, then intel two eight, six. And I remember all of those single core processors. I remember all of the parameters when we moved to multicore processors. Actually, I didn't remember I was looking on those parameters when I was buying a cpu, when I was buying a new processor in a computer. But then I forget the speed improvement was so high that I stopped caring about that because the speed of the processor was not the main parameter that was important at the way. More important was the architecture, how those processor are cooperating with each other, how many threads we can run in concurrent way. And this is happening also with the quantum computing. So I hope you, I encourage you that this is something important, and I hope, I encourage you that you just give a moment to this technology and check what is possible with that. So let's think how we can check this technology, and let's think how this technology can affect your organization. This is very important how you should check cuttingedge technology and checking if actual ibis is real. When I was starting with my journey with the quantum computing, I know that as I mentioned at the beginning, I'm technical person, so I'd love to play with the technology. But actually I said that I will not touch the technology at the beginning. I would talk with the organization, with the people that claim that they are using quantum devices. Why this is so important? Because from my perspective, if I want to offer the technology to our customers, to people to discuss about this technology, these technologies should bring the value to the organization, should bring the business value, so it should generate benefit for the people that are using the technology. And when I see an initial benefit of this technology, this means that this is a good moment that we should think about this technology. And actually my first talks with this was with the organization that are using the quantum devices, checking what value it is deriving, checking if actually this is delivering any value. Checking how easy is to learn quantum computing, how easy is to develop algorithm, asking typical questions, how long it takes to learn it, what type of the skills are needed? How much does it cost? What is the value this technology generated? Based on the answer on those questions, I started to thinking, is it a good moment or not? And as you can see, I'm talking about the quantum computing. I'm building quantum computing division in objectivity. So probably I get a lot of positive information here. And from our perspective, looking on the quantum computing, there are mostly three areas of interest optimization. So solving complex combinatorial problems optimization related to staffing, scheduling, supply chain logistics. The other area is modeling. So predicting customer behaviors, forecasting team and future dementor of sales, or maybe predicting the financial markets. And something that looks very also interesting is quantum machine learning, training models with the less data detecting and management with the data, improvement in decision making with the classifier. Those three areas are strictly connected with the services that we are having in objectivity. And I'm saying, and saying very high here that those three areas are connected with the things that we are doing in the organization when I'm working and why. I'm saying that because in objectivity we don't have in our offering topics related communication and the security. And this is something that I already mentioned, that we are afraid in this technology. So if you are looking on this technology, think about those additional additional areas. How we can use quantum computing in communication, how we can send the messages from the sender to receiver in the secure way. Think about encryption, how this technology can affect already using encryption algorithms, how we can create any algorithms that will support us. And also think about the sensing, think about what type of sensors we can build with the technology. Figure out or think about that with this technology, we can create a sensor that will work like GPS and actually don't need to have the link to satellite because it will be so precise that it will just react on different changes of magnetic fields. And based on this information, it can position yourself on the earth. And think about that. It can work under the ground, under the water. This is like a possibility of this technology. I'm just briefly finishing my talk and I would like to show you two examples, what we managed to deliver in objectivity, in scope of the quantum computing. First one, this is our PoC. This is PoC when we are trying to help our CEO to plan trips between our offices. This is the result of one of the hackathons. The hackathon was happening before the Christmas and we was helping our CEO to allow him to meet with all of the people between our offices and wish them merry Christmas directly. So on the one side we have information about availability of the people in the offices. On the other side we have information about flights, shuttle between our offices. And you can see here that on the main screen our CEO is able to plan his trip. He can decide if for him is the most important part, lower price, shorter flight, or maybe minimization of the co2 generation. He can select the start office. He can select final office, of course, end date is the Christmas, and also start date is configurable. And also there's a possibility of selecting the preference of how many days you would like to stare in different places. When I hit the find the best trip button, I'm sending the defined problem to the quantum device. And you can see we have Schrodinger card and in few seconds we'll get the results. So in this particular case we are using DYF quantum annular. So this is one of the types of the quantum devices. And I'm showing this application to you because here is a good example that this technology exists and we can integrate it with our existing application. So you can see here that we find a solution, you can see the successful criteria, you can see which people you are meeting in each offices, you can see the flight plan, and this is the integration typical like the others, by just using API. And you can see that the communication have been done almost in the real time. The second PoC that we conducted with our customer was related to planning the production of goods. That value was increasing in the time. And here we get from the customer recipe, we get the information about the, we get the information about the elements that are needed to product this good, and the number of those items in the warehouses, and we manage. And also our goal was to maximize, our goal was to maximize the production in those next 13 years. Actually we managed to reduce the calculation time by using quantum device from 4 hours to 90 seconds. But this is just one of the benefits of this technology. The more interesting benefits was that together with this reduction of the time, reduction of time needed for calculation, we managed to also generate additional scenarios of the solution. Why this is so important? Because if customer would like to, for example, reduce the level of the insurance of their warehouses, or maybe reduce the number of the operation in those warehouses, it is much more easier to have multiple scenarios and just scoring the scenarios of finding which one is the best from the positional criteria, instead of adding new dimensions to the model. And also you can see from the time perspective, this 90 seconds means that he can, and of course it depends on the scenario, it can take decision almost in the real time. So this is like a possibility that this technology is giving to us. Probably you are thinking how the code can look like on the one side. I already show you how we can develop the algorithms by using quantum gates. But the quantum gates looks like assembler and probably you don't want to work with this technology that way. If we use higher level languages, higher level libraries, you can see that the application looks very similar to something what we know from the current model. Do some kind of initialization of the object and building and adding some kind of variables, then distributing some kind of elements. But you can see if you go deeply in the code. If you show this code to somebody who is for example, data scientist or machine learning engineer for some of the libraries, it would be hard to check if this problem is run on the classical computer or on the classical device. How to prepare your organization for the quantum revolution from our perspective, we divided this process into four stages. First of all, you need to build awareness in your organization. You need to help your organization to understand what this technology is, what is possible with this technology in the short, in the long term, and also how it will benefit for your organization. Then working with the organization in the discovery phase, you need to figure out a roadmap of the potential use cases for the quantum technology. You should select the cases that will bring and generate the biggest value for your organization. Prioritize them by the value and by the study of the possibility of delivering this on the current devices. And when you have this backlog, you should think about creating like a business case, like a plan of the adoption. Because in most cases you will need to find a sponsor that will allow you to go further with that. The next stage is POC. So we are selecting the most beneficial, the most possible to deliver project and you are building proof of concept. So you are verifying the idea, building a prototype and checking how this technology is behaving with the data. And actually here you can get different results. Either quantum computing will be successful either no. So this is very easy, but very often when we are working with quantum technology, you will learn something about the process, you will learn something about your challenge that you have and it will affect also on the classical solution. So even if you will be not successful with the quantum projects, there is a huge chance that you will figure out something that will increase the value of the classical solution to your organization. And I think this is the most important part when you are working with the technology. Finally, it should generate the business value for your organization. And at the end, you need to think about delivering the application to the production to allow your organization using this technology. Summar of this talk I would try to answer on the question, is it really hype or not? Actually, from my perspective, we can see a huge hype on the topics related to quantum computing. But still this huge hype has a strong justification. Looking on how fast this technology is growing and how fast, we can see the new information about adoption. We can see a lot of use cases, a lot of use cases of the quantum computing, quantum inspired or quantum hybrid projects that are verifying and that are successful on the market. So this is something that you should look to inspire you from my perspective, and I'm very optimistic about technology, so just judge this information by yourself. Read a bit more about the quantum computing. But from my perspective, I would say that we should probably think about waiting like additional two, four to five years to get this technology enough mature to be ready for the universal purposes. Right now, it is very good for the optimization for some kind of narrow cases that are not suitable for the current devices. And multiple case studies that we can see published in the market shows that actually this technology is working and providing advantage to organizations. So from my perspective, I would recommend you that if you don't have quantum computing technology in your strategic focus, in your roadmap, put it there. If you don't want to onboard it to this organization, if you don't want to work with this technology and check it, just have it on your radar, try to remember it and check from time to time because I would like to avoid the situation that you miss the moment that this technology will be actually very beneficial for organization widely adopted. With this thought, I would like to finish the presentation. Please remember that I'm only message or a call away from you. So let's together unlock the potential of the quantum technology in your business operation. And if you have any questions, just ping me or link it in. Just send me the email. I'm happy to answer all your questions, sessions and thank you all for your attention today.", "words": [], "utterances": null, "confidence": 0.939298445736429, "audio_duration": 2328.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Right now my main focus is quantum computing. I'm working for objectivity. I onboarding cuttingedge technologies to our customer organizations. If you have any question just ping me on LinkedIn or send me an email and I'm happy to answer.\n-  quantum technology is the new way of making the calculation that give us a possibility either getting results faster, either getting better quality results, or working with bigger problems. Commercialization of the quantum computing will hit the market in next five years. 90% of organizations believe they will be transferred by quantum computing by 2030.\n- The quantum technology will start disrupting our market in next maybe three to ten years. Much more easier way to start using quantum devices is either run your application on one of the quantum vendors clouds or also in the public clouds like Microsoft or AWS.\n- There is a lot of fear about the possibility that quantum computing can break the encryption keys. There are already work to standardize the new way of using quantum devices. We are trying to prepare to the future, and this is a huge unknown when this future will get us.\n- Quantum computing is one of the methods that we are using to some kind of the challenges. Microsoft can run quantum application in the cloud. Technology roadmaps show progression in a speed improvement of quantum processors. Why is quantum computing so important?\n- I would like to show you two examples of what we managed to deliver in objectivity, in scope of the quantum computing. First one is PoC when we are trying to help our CEO to plan trips between our offices. Second is related to planning the production of goods.\n- How to prepare your organization for the quantum revolution from our perspective, we divided this process into four stages. First of all, you need to build awareness in your organization. The next stage is POC. And at the end, think about delivering the application to the production.\n- We can see a huge hype on the topics related to quantum computing. From my perspective, we should probably think about waiting like additional two, four to five years to get this technology enough mature to be ready for the universal purposes. Let's together unlock the potential of the quantum technology in your business operation.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "quantum computing technology", "timestamps": [{"start": 2267832, "end": 2269058}]}, {"count": 7, "rank": 0.09, "text": "quantum technology", "timestamps": [{"start": 120568, "end": 121620}, {"start": 151988, "end": 152960}, {"start": 153810, "end": 154960}, {"start": 692208, "end": 693498}, {"start": 2058244, "end": 2059246}, {"start": 2123480, "end": 2124498}, {"start": 2315188, "end": 2315838}]}, {"count": 36, "rank": 0.08, "text": "quantum computing", "timestamps": [{"start": 25228, "end": 26386}, {"start": 49648, "end": 50810}, {"start": 109348, "end": 110442}, {"start": 127388, "end": 128710}, {"start": 199056, "end": 199986}, {"start": 236604, "end": 237474}, {"start": 259732, "end": 260794}, {"start": 280348, "end": 281426}, {"start": 293408, "end": 294758}, {"start": 299248, "end": 300274}, {"start": 622168, "end": 623054}, {"start": 731804, "end": 732626}, {"start": 735836, "end": 736818}, {"start": 748912, "end": 749734}, {"start": 769022, "end": 770622}, {"start": 837164, "end": 838206}, {"start": 920840, "end": 921694}, {"start": 979324, "end": 980470}, {"start": 1088924, "end": 1089654}, {"start": 1110532, "end": 1111386}, {"start": 1119556, "end": 1120586}, {"start": 1143232, "end": 1144166}, {"start": 1162804, "end": 1163806}, {"start": 1364568, "end": 1365810}, {"start": 1407604, "end": 1408830}, {"start": 1482636, "end": 1483506}, {"start": 1507828, "end": 1508586}, {"start": 1509076, "end": 1509914}, {"start": 1519288, "end": 1520558}, {"start": 1606772, "end": 1607866}, {"start": 1690768, "end": 1691958}, {"start": 2115704, "end": 2116494}, {"start": 2179068, "end": 2180310}, {"start": 2200228, "end": 2201034}, {"start": 2224248, "end": 2225406}, {"start": 2267832, "end": 2268654}]}, {"count": 6, "rank": 0.08, "text": "quantum device", "timestamps": [{"start": 209012, "end": 210190}, {"start": 307204, "end": 308270}, {"start": 416696, "end": 417694}, {"start": 929800, "end": 930594}, {"start": 1773784, "end": 1774734}, {"start": 1876812, "end": 1877506}]}, {"count": 1, "rank": 0.08, "text": "quantum computing division", "timestamps": [{"start": 1509076, "end": 1510314}]}, {"count": 2, "rank": 0.07, "text": "bigger quantum devices", "timestamps": [{"start": 441152, "end": 443370}, {"start": 506468, "end": 507898}]}, {"count": 1, "rank": 0.07, "text": "quantum application", "timestamps": [{"start": 1082172, "end": 1083240}]}, {"count": 1, "rank": 0.07, "text": "different quantum providers", "timestamps": [{"start": 1214472, "end": 1216210}]}, {"count": 3, "rank": 0.07, "text": "quantum processors", "timestamps": [{"start": 1222408, "end": 1223214}, {"start": 1245904, "end": 1246934}, {"start": 1287180, "end": 1288570}]}, {"count": 4, "rank": 0.06, "text": "quantum gates", "timestamps": [{"start": 330988, "end": 331682}, {"start": 652308, "end": 653390}, {"start": 1964872, "end": 1965890}, {"start": 1967016, "end": 1967742}]}, {"count": 1, "rank": 0.06, "text": "current quantum computer", "timestamps": [{"start": 592608, "end": 593866}]}, {"count": 1, "rank": 0.06, "text": "quantum machine learning", "timestamps": [{"start": 1548672, "end": 1549900}]}, {"count": 1, "rank": 0.06, "text": "quantum annular", "timestamps": [{"start": 1784722, "end": 1785666}]}, {"count": 1, "rank": 0.06, "text": "quantum phenomenon", "timestamps": [{"start": 180988, "end": 182034}]}, {"count": 1, "rank": 0.06, "text": "cuttingedge technology", "timestamps": [{"start": 1401040, "end": 1402410}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}