{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/240f0185-c48e-4f4a-96c9-123d4c7aa9b7", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["andre santos", "anymore", "automatewithpython", "bookeepers solutions", "can", "conf fourty two", "confcom", "conquer", "dont", "productivity", "python developer", "repetitive tasks", "rpa", "smarter", "tasks", "unlock", "work smarter"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "98e1ede6-a06a-4e25-941d-aa861d593ff6", "status": "completed", "error": null, "text": "Hello. Hello people. My name is Andrea. I'm from Brazil and I have been working with Python for over five years and with RPA for over two years. I work at a company here in Brazil that provides accounting and tax services. My job here is to help my colleagues to reduce their time spent on repetitive tasks. I will divide my presentation into two parts. The first one is a sequence of slides, and the second one I will bring you a real case of a task automated by a bot. So first of all, I make a disclaimer here for the english speakers. I apologize for the accent sometimes, and I will try to make myself clear enough and make this presentation at least understandable for you. Okay? So imagine that you can apply this to any system in your company, be it an rep like SAP system or any other internal system in your company, or even a web application. We will see how to do this. So RPA stands for robotic process. Automation is the use of technology to handle repetitive tasks, freeing up human workers for more complex responsibilities. Let's move on. Why Python is a popular choice for RPA Python has a simple syntax, extensive libraries, and a huge community support. Some of benefits of using RPA in a day to work are time efficiency, error reduction, and cost savings. For time efficiency, one of the primary advantages of RPA is its ability to accelerate tasks, freeing up valuable time for employees to focus on more strategic and value added activities. By automating repetitive tasks, employees can channel their energy towards more meaningful work. There is reduction too, and cost savings. Implementing RPA can resulting in substantial cost savings for any organizations. How RPA automates repetitive tasks in three main ways. Automated workflows it has efficient data handling and for the result of this increase or productivity, will you see here some examples of RPA applications in some industries? Okay, financing, healthcare, retail, chimeshafue in financing, automating, transaction processing, report generation, and compliance tasks is some of the tasks that be automated by a bot. To illustrate the practical application of RPA in Python, let's consider a case study involving an invoice in processing. Let's imagine a following scenario. A company has receives an invoice via email daily, okay? So the accounts payable team manually extracts relevant information such as invoice number, date, and total amount from each invoice. So with that data, integers it into the accounting system or an excel worksheet or whatever. So this is a classical repetitive tasks, tasks that can be automated by a bot, by an RPA solution. We can build an RPA solution with Python, of course, that checks the email inbox that open the PDF file in that email from that person that sent to us the invoice here and apply some OCR techniques to extract data from this PEDF and save this information in whatever place we want. Okay, so this is one of example of how an RPA solution can help us in our daily work here. Some libraries for RPA development in Python, some of them is Pyautogi, selenium board, numpy pandas and among others. Okay, let's go to my computer screen to see a real case of a task by automated by a bot. Okay, let's do this. What I need to do here, I need to search some codes from this excel worksheet in application desktop and bring back the description from each code and save it here. I will do this manually one or two times. So this is my application desktop. I click here and I need to click here. This is what I have to do. So I put this code here and search as a result this bring me this description and receive and control v. Okay I will do this again for the second one search. Okay, there is another description here, control c, control v. So here I have five codes but imagine if I have 100 codes, 1000 codes, and to do this again and again and again and again. So this is a tasks that a bot can help me a lot. I wrote this code in Python that do that for me. Okay, this code import an excel file with the codes I need to consult, access a desktop application, query one code at a time, extract the description and save it into my Excel file. Okay, so let's see this in action. I will import my Excel file here. So hands up the bot, execute these steps for me. Okay, here it search the first code, get the description, save it into my Excel file. So search the second one, get the description, save it in my excel, search the third and do this again and again and again and again. Okay, so this is a huge benefit because some tasks like that can be automated by RPA solution. That's saving my time. That's the real benefit. Okay, so let's see the result here. Okay, all the description saved here. Okay, so let's go back to my presentation. Let's drag to here in a conclusion. An RPA solution in Python offers so many benefits for any company, for any organization. By automating repetitive tasks, RPA liberates employees from repetitive work, allowing them to focus on strategic initiatives that drive business growth. Okay, thank you. Thank you so much for this opportunity. I hope this overview has provided you some insights into the world of RPA and its potential to help our daily work. Okay. And special thanks for the conf, for the two organizers. Okay, thank you. Thank you. Bye.", "words": [], "utterances": null, "confidence": 0.922040896767467, "audio_duration": 840.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Andrea: RPA stands for robotic process. Automation is the use of technology to handle repetitive tasks. Some of benefits of using RPA in a day to work are time efficiency, error reduction, and cost savings. Why Python is a popular choice for RPA.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "RPA Python", "timestamps": [{"start": 153140, "end": 157914}]}, {"count": 1, "rank": 0.09, "text": "RPA applications", "timestamps": [{"start": 271742, "end": 273268}]}, {"count": 5, "rank": 0.09, "text": "RPA solution", "timestamps": [{"start": 373630, "end": 375000}, {"start": 380242, "end": 381608}, {"start": 432482, "end": 433704}, {"start": 722014, "end": 723400}, {"start": 771982, "end": 773320}]}, {"count": 6, "rank": 0.09, "text": "repetitive tasks", "timestamps": [{"start": 49760, "end": 51550}, {"start": 135570, "end": 137190}, {"start": 209658, "end": 211258}, {"start": 244284, "end": 245760}, {"start": 365200, "end": 366976}, {"start": 787384, "end": 788936}]}, {"count": 1, "rank": 0.08, "text": "RPA development", "timestamps": [{"start": 443106, "end": 444184}]}, {"count": 1, "rank": 0.07, "text": "compliance tasks", "timestamps": [{"start": 292294, "end": 293680}]}, {"count": 1, "rank": 0.07, "text": "repetitive work", "timestamps": [{"start": 792322, "end": 793710}]}, {"count": 2, "rank": 0.06, "text": "application desktop", "timestamps": [{"start": 492400, "end": 493980}, {"start": 519482, "end": 520740}]}, {"count": 2, "rank": 0.05, "text": "time efficiency", "timestamps": [{"start": 174984, "end": 176226}, {"start": 181964, "end": 183154}]}, {"count": 1, "rank": 0.05, "text": "classical repetitive tasks", "timestamps": [{"start": 364522, "end": 366976}]}, {"count": 1, "rank": 0.05, "text": "invoice number", "timestamps": [{"start": 340034, "end": 340984}]}, {"count": 1, "rank": 0.05, "text": "substantial cost savings", "timestamps": [{"start": 230364, "end": 232114}]}, {"count": 1, "rank": 0.05, "text": "valuable time", "timestamps": [{"start": 195520, "end": 196780}]}, {"count": 1, "rank": 0.05, "text": "efficient data handling", "timestamps": [{"start": 255258, "end": 257540}]}, {"count": 1, "rank": 0.05, "text": "strategic initiatives", "timestamps": [{"start": 797700, "end": 799840}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}