{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/89e9cfd1-a12b-4d72-a267-623668b6bbaf", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["advising", "by", "can", "carbon", "climatefriendly", "co", "code", "cofounder", "conf fourty two", "created", "developers", "did", "eclint", "eclintcom", "emissions", "emits", "existing", "factors", "fonts", "from", "frontend", "github", "httpsgithubcomeclinteclint", "httpswwwlinkedincompulsechangeyouronlinehabitsmitigateclimatecrisiskatarzynawojdalska", "httpswwwlinkedincompulsehaveyoueverwonderedhowmuchcarbonemissionsyourwojdalska", "images", "katarzyna wojdalska", "kg", "largeunnecessary", "libraries", "mitigates", "optimise", "published", "shows", "solutions", "sums", "these", "tips", "tricks", "unfortunately", "uses", "utilises", "website", "websites"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "1e075481-b6e5-4f97-ad26-83c94d180550", "status": "completed", "error": null, "text": "Jamaica real time feedback into the behavior of your distributed systems and observing changes, exceptions. Errors in real time allows you to not only experiment with confidence, but respond instantly to get things working again. Code hi. Today I'm going to talk about digital ecology and how to mitigate the carbon footprint of websites. Let's begin. What is digital ecology? It is a field of study about the interdependence of digital systems like the Internet and the natural environment. So, long story short, everything we do online and what we do offline with our devices generates carbon footprint. But to be clear, digital ecology is not about taking a step back. It's not stopping people from using the Internet. It's all about introducing more sustainable, greener habits and routines. You might wonder now, how does the Internet emit co2? It starts with data collection. So with servers, with data centers and the cloud. And if we think about the cloud, we might think about something white, light, bright or in the sky. But the truth is that storing data in the cloud means storing data in these large facilities called the data centers, which have to be powered up and cooled down 24 hours, seven days per week. For example, storing 100gb of data in a data center emits 0.2 fonts of co2 per year. And this is 700,000 times more than if you would be storing this data on your hard drive. Another fact is that data centers are responsible for 1% of world's electricity consumption. Next, data transferring via the infrastructure, via the telecom infrastructure. So power lines and everything here has to be powered up as well. And last but not least, end devices. So, for example, charging smartphones, the energy that is needed for that overtook the energy that is needed for charging laptops and pcs in 2020. And producing and charging smartphones is actually responsible for 1% of all global emissions. Pretty impressive. And I'm not even mentioning these natural resources that are needed for manufacturing our smartphones. So is it important? It quite is. The ICT industry stands for 4% of all greenhouse gases. And if we go back to the cloud by 2025, we predict that in the cloud we're going to be storing 100 zetabytes, which will be emitting 200 billion tones of co2 per year. What can we do about it? These are some simple techniques that you can be using in your daily life. So let's start with emails. By 2023, the predictions are that every day there's going to be 347,000,000,000 emails sent out every day. And sending one email results in existing 4 grams of co2. Another factor is that storing emails emits 19 grams of co2. So deleting emails or just sending them less really makes some sense. And one average user stores 10,000 emails on a mailbox. So deleting emails, unsubscribing to spam, and using alternative messaging tools like slack or the old sums is really important. And if we think about the size of emails, you can, for example, try to remove an image from your footer to decrease these size and thus emit less co2. When it comes to browsing, there are some alternative to Google. So to our most favorite search engine. So for example, there are search engines like Ecosia or Lilo, which are more eco friendly, let's say. And there is also the DuckDuckgo, which is much more ethical. Another factor is closing tabs, because if they still remain open, they still have a connection with the servers. If you remember the address, write it directly in the tab. Think about marking some of your favorite pages by adding bookmarks and briefing the keywords that you use. It's also important to erase from time to time your old media on social media platforms. And when it comes to devices, changing smartphones or computers left often is very good for the environment. So imagine that, for example, replacing every 6th year instead of every fourth year, your computer emits 190 kilos of co2 less. So this is quite a large change. It's also about deleting mobile apps that you don't use, about disabling mobile notifications. And for example, you can try also unplugging your router for the night. Let's go now to the main topic of today's speech. So, websites, did you know that every day 250,000 new web pages are being published and each of them generates 1.8 grams of co2, what sums up to 216 annually. And this assumes that a web page is being visited 1200 times monthly and this number, so 216 less this much as for driving almost 1000 gasoline car. So how much co2 does your website produce? Have you ever wondered that? To check it out, you can use this popular tool online called the website carbon Calculator. It is very clear about how to calculate the carbon emissions. It's very transparent, so I can strongly recommend it. And here it's enough to just copy paste your URL here and click the calculate button. So how to calculate the co2 emissions of these website? First we have to consider the data transfer of an average visit. So according to carbon calculator, the data transfer of the first visit stands only for 25% of all visits. And the data transfer of the returning visits stands for 75% and it is equal these energy of the website multiplied by 2% because already some data was cached before. So during the first visit then we have to consider the energy of the website, which is equal to the website size multiplied by the end user traffic, and the end user traffic here is equal to almost 1. Last but not least, the emissions of zero to per one visit. So this is equal to the data transfer of an average visit multiplied by the energy emissions. And the energy emissions vary from country to country. So what this web page is using and what we are using in the tool is 442 grams/kw hour. So this is the global average of energy emissions. So to sum it up, the emissions of co2 per one visit are equal 75% multiplied by the website size, plus 25% multiplied by 2% multiplied by the websites. And this is multiplied then by the end user trapping and by the energy emissions. So what can we do to create more sustainable websites? First, let's think about the programming language. I assume that you are all coding your websites in either JavaScript or typeScript. And here, as you can see on the graph, JavaScript is a little bit better than typescript and much much better than for example Ruby, Python or of course the worst. But of course if we talk about websites, it's much better to use JavaScript or typescript than platforms like Wix or WordPress. Because then we have more control over the code. We can more easily remove some largeunnecessary parts and implement any changes. When it comes to libraries. Here you can see some of the most popular ones with their emissions. So for example, you can rethink if all of the libraries that you're adding are really needed. Because for example for load you could maybe try using just plain JavaScript, or you could use the already built in fetch instead of adding some largeunnecessary libraries when it comes to calls to external APIs, think about reducing the number of calls. So basically rethinking the logic of your call about caching data both on the frontend and on the back end side. And as I already mentioned, just using plain JavaScript or lighter libraries. When it comes to resources, there are three most important factors that you have to consider. So images, videos and fonts. When it comes to images, it's best to save them in SVG or Webpy. Webpy is a very highly compressed format and SVG is a vector format. So all of them, the file sizes of images saved in these formats are much less than if these would be saved in for example pNg. So here you can see like 95% of a difference. And here you can see again a table with the corresponding co2 emissions based on the file format for this image shown on the left side. When it comes to videos, a sibling format is Webm. So it's also a highly compressed format which I strongly recommend. And when it comes to fonts, it's of course better to use the system fonts than these hosted online. And if we think about the formats then the most popular format is TTF, but it's also the less sustainable one, so it's better to use wof two. And here you can see that by just changing these font format we can get up to -70% of co2 reductions. And of course a user will not see the difference. So all these changes will not influence the quality of your website. Talking about colors, it's really good if you could enable a dark mode of your website. And here you can see what is the energy efficiency of different colors on all emits screens hosting so every time you pick a hosting provider, take a look at the power user usage effectiveness. So Poe of the data center that your hosting provider is using, the lower the number the better. Think also about the policy of your hosting provider because some of them are using for example green employee behavior policies, they are planning to plant trees and so on and so forth. So they are doing much more than just using some less power user effective data centers. And it's of course good to use a hosting provider that uses renewable energy. And if you don't know where to look for a green existing provider, I recommend to open the green web foundation website and take a look at some options there. Last but not least, user data collection. So it's about tracking users, it's about personalized ads and collecting the data. And here is an example of USA Today which was a web page, which still is a web page, but after the EU introduced these GDPR policy, it started to run faster. So actually it was loading 91% faster, so it became these much lighter. And why should we be doing all this? So first of course we can mitigate the carbon footprint and thus we can also save electrical energy. This results also in shorter loading time, which is really essential for uses. And for example, here's a statistic that 53% of users can be lost if a website loads longer than in 3 seconds. And with shorter loading time we can improve SEO as well. So you don't have to remember all these techniques by heart. But if you want to please read this presentation once more. You can also read a book called sustainable web design. I can strongly recommend this one. It's written by Tom Greenwood. But together with my team I developed a tool called eclint. Eclint is Alvinter. It works very similar like Athlint, but what it does, it proposes possible code improvements to mitigate the carbon footprint of websites and makes them basically more sustainable. And it contains of two elements. So eclint and this is more or less like s eclint and eclint style which can be compared to for example, stylint. Hope that you know these tools and eclint style is for CSS and CSS like languages. And underneath here you can see an example of how you can be using eclint, what kind of command it was and what change did it implement. This is the list of features that we want to implement by the end of the year. And them ones marked in blue are the ones that we already implemented and the violet ones are the ones that we are still working on. And what we hope to achieve is that we can reduce with eclint the emissions even by 88%. So according to our calculations, we hope this would be doable after comparing some heavy websites to the lighter ones. And for example, so I mentioned in the beginning that every day 250,000 new websites are being published. So assuming that they would be visited 10,000 times a monthly, this would emits 54 million annually. And this is equal to driving 220,000,000 gasoline can by reducing this number by 88%, suddenly we get 26 million kilometer only. So how to get started with Eclint? First of course you have to have node installed. Then you have to install eclint, eclint style and eclint style with the recommended config. Then you have to initialize the project with the recommended config and you have to run it. So run eclint and eclint style. We are still working on IdE. So soon it is going to be even much easier to start using Eclint. And as this is an open source tool, it's completely free to use. And if you think that this project sounds interesting to you, we strongly recommend you to just text us and start collaborating. Here is the list of references and this is me Katajana. I'm the co founder and CEO of eclint. Feel free to reach out to me on LinkedIn or just text us by using the website. By using the email you can also check our LinkedIn profile and if you like what we are doing, please leave us a store on GitHub. Thank you so much for your attention.", "words": [], "utterances": null, "confidence": 0.940749982433028, "audio_duration": 1056.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Digital ecology is a field of study about the interdependence of digital systems like the Internet and the natural environment. Everything we do online and what we do offline with our devices generates carbon footprint. What can we do about it? Simple techniques that you can be using in your daily life.\n- Every day 250,000 new web pages are being published. Each of them generates 1.8 grams of co2, what sums up to 216 annually. What can we do to create more sustainable websites? Using plain JavaScript or lighter libraries.\n- Eclint proposes possible code improvements to mitigate the carbon footprint of websites and makes them basically more sustainable. We hope to reduce with eclint the emissions even by 88%. And as this is an open source tool, it's completely free to use.", "auto_highlights_result": {"status": "success", "results": [{"count": 9, "rank": 0.06, "text": "websites", "timestamps": [{"start": 53828, "end": 54634}, {"start": 369736, "end": 370770}, {"start": 526988, "end": 527986}, {"start": 539062, "end": 540090}, {"start": 546992, "end": 547654}, {"start": 562612, "end": 563358}, {"start": 883388, "end": 883970}, {"start": 943314, "end": 943846}, {"start": 951012, "end": 951466}]}, {"count": 4, "rank": 0.05, "text": "energy emissions", "timestamps": [{"start": 494928, "end": 495990}, {"start": 497056, "end": 498246}, {"start": 511028, "end": 512270}, {"start": 532668, "end": 533910}]}, {"count": 2, "rank": 0.05, "text": "data collection", "timestamps": [{"start": 94432, "end": 95270}, {"start": 791222, "end": 792214}]}, {"count": 2, "rank": 0.05, "text": "shorter loading time", "timestamps": [{"start": 833692, "end": 834742}, {"start": 847296, "end": 848458}]}, {"count": 1, "rank": 0.05, "text": "caching data", "timestamps": [{"start": 617176, "end": 618386}]}, {"count": 1, "rank": 0.05, "text": "example green employee behavior policies", "timestamps": [{"start": 755428, "end": 757610}]}, {"count": 2, "rank": 0.05, "text": "real time", "timestamps": [{"start": 5810, "end": 6414}, {"start": 13412, "end": 14094}]}, {"count": 2, "rank": 0.05, "text": "users", "timestamps": [{"start": 794758, "end": 795366}, {"start": 841232, "end": 841734}]}, {"count": 16, "rank": 0.05, "text": "eclint", "timestamps": [{"start": 872248, "end": 873166}, {"start": 873278, "end": 873886}, {"start": 889008, "end": 890022}, {"start": 892192, "end": 892550}, {"start": 892912, "end": 893414}, {"start": 899632, "end": 900166}, {"start": 907556, "end": 908202}, {"start": 933052, "end": 933810}, {"start": 980252, "end": 981154}, {"start": 985644, "end": 986322}, {"start": 986386, "end": 986994}, {"start": 987788, "end": 988366}, {"start": 999696, "end": 1000246}, {"start": 1000448, "end": 1000946}, {"start": 1012996, "end": 1014030}, {"start": 1036828, "end": 1037858}]}, {"count": 4, "rank": 0.05, "text": "data centers", "timestamps": [{"start": 96736, "end": 97574}, {"start": 111428, "end": 112458}, {"start": 136572, "end": 137726}, {"start": 768254, "end": 769570}]}, {"count": 4, "rank": 0.04, "text": "carbon footprint", "timestamps": [{"start": 52708, "end": 53562}, {"start": 72526, "end": 73534}, {"start": 827324, "end": 828450}, {"start": 882348, "end": 883122}]}, {"count": 1, "rank": 0.04, "text": "electrical energy", "timestamps": [{"start": 830460, "end": 831640}]}, {"count": 1, "rank": 0.04, "text": "renewable energy", "timestamps": [{"start": 774238, "end": 775300}]}, {"count": 1, "rank": 0.04, "text": "less power user effective data centers", "timestamps": [{"start": 765128, "end": 769570}]}, {"count": 1, "rank": 0.04, "text": "sustainable web design", "timestamps": [{"start": 862212, "end": 863410}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}