{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/d15d9f7b-6f67-44dd-8b14-eef42f38fc8b", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["arafat khan", "become", "best", "by", "canada", "come", "conf fourty two", "parts", "places", "shopify", "software developer", "traveling", "wanted"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "ab0fbd95-7457-45e8-8d11-dc11ca6d1f8f", "status": "completed", "error": null, "text": "Hi there. This is Arfad. Today I'll talk about how to be a digital nomad without losing your job. I'm going to give you a small tour, more of my life as a digital nomad, and also bring in the bigger philosophy of why I choose to live this way. So before I start this talk, let me tell you a little bit about me. I'm a production engineer at Shopify, which is like being a DevOps engineer. So I do terraform, kubernetes, system stuff, and a lot of other buzzwordy stuff. Aside from my job, during the summer, I'm a hiker, and I really, really love the mountains. So during the wanted, I am a skier and a snowboarder, and I'm also learning how to surf. And aside from that, I'm an avid traveler. So I've been to many countries, and I'm always looking for recommendations for cooler and newer places to travel to. Since this talk is about traveling, I want to mention that there's two kinds of traveling. So the first kind of traveling is the one where you have new experiences and you experience the joy and the aha. Moment of seeing something new and novel for the very first time in your life. So imagine if you're looking at the pyramids of Giza or if you're looking at the Eiffel Tower. Just the sheer bliss of, like, oh, my God, I'm seeing something new for the first time. That's amazing. And that takes your breath away. And that's usually what we think of when we think of the word traveling. We think of it as, like, seeing new things. But there's another kind of traveling. And this kind of traveling is the ability to see the same things you're always seeing, but with a different outlook. So imagine if you're in a relationship with a person for many years, and even after all these years, you learn something new about them, and you get so surprised, like, oh, my God, I still can't believe I'm learning something new about this person. Or imagine if you're going to an office and you've been doing the same drive to your office for, like, 80 years, and on this time, on this new day, instead of taking the same old drive, you took a different route, or maybe you played a new song, and somehow it becomes just a bit more joyful and cheerful because you did the same thing you do every day, but you did it with a different frame and you had a better fun doing it. So, ideally, my goal in life is to inspire people to learn to do the second kind of traveling, because if you do that, then no matter where you are and what you're doing in life, there's always an element of spontaneity and joy that comes with the newness of seeing new experiences. It's the ability to inject spontaneity and novelty in anything that you're doing. However, in the interest of time, this talk is about the first kind of traveling, where you learn to have novel experiences in your life while still trying to maintain your job, your physical health, your mental health, and you have to do all of these things without breaking a buck. Fortunately, we are in a place where we are extremely blessed with our abilities as skilled programmers, managers, DevOps engineers. We are in a unique place in history where we can use our work to work remotely. And remote work is something that's considered not only acceptable, in fact, it's even encouraged in our workforce. And it's time that we take the full advantage of this opportunity to travel and explore the world while still maintaining our jobs. So I sort of gave you the main idea that, yeah, traveling is cool, traveling is fun, it's an amazing experience, and we should all do it. But I'm also going to highlight a bigger question of why we should be doing it. So instead of giving you all my lessons in kind of like a package sort of a way, how about I give you a story? A story that I actually went through myself. And then as I followed through my own story, I would offer different lessons, which I learned by randomly stumbling upon and trying out many different things in my own life. So here it goes. So 2020, that was a very hard year for all of us. It changed my life for the better in some ways, and also for the worse in other ways. I had a roller coaster of a ride. You see, at the start of the year, I used to live in this cute little town called Ottawa. Ottawa is the capital of Canada. And I was working in the beautiful offices of Shopify in Ottawa. And I had a very fun life full of friends and coworkers. And we would. We would meet up every day, we would hang out, we would play games, we would go to parties together. We would have so many get togethers, and we would do cooking, tech conferences, everything. We would do all kinds of things. And I honestly felt so connected to people and had such a fun life. So I've been a very social person, and just the joy and the camaraderie of being around people makes me very happy now. March 2020. The COVID happens. When the COVID happened, it was quite a shocker for me. I was actually in complete denial. I was still going to my gym. I literally turned off all the news sources that were hitting me because I lived by myself and I wanted to maintain my mental health. For the first few days of work from home, I was like, this thing is going to end. This has to end. And when this ends, I'm going to go back to my office, to my friends. We're going to have these fancy lunches. We're going to chill out. We're going to make fun of this. And we all know how that turned out so well. That's life now. Different people deal with different things differently. But for me, this was a complete turnover. I was a very social person. And the feeling of being around people and vibing with people is something that's very important to me. So to revamp everything by myself was too much work. It was a shocker, but I had to adapt. So as months went on, I realized that the emotions of the shock of COVID finally faded away. And I was slowly adapting to the new lifestyle of remote work. I was very methodical, very calculated. I would take good care of my health. I would always work out. I would always be diligent with my work. And I had a very appropriate work from home set up to take care of the work stuff. Things were actually going fine for a couple of months until I woke up one day and started having serious troubles in my relationships. You see, what happened was both my dad and my sister got really sick. They had Covid and they all live in India. And meanwhile, here I was in Canada, thousands and thousands of miles away from my family. And I couldn't help them. I was completely incapable of doing anything to help and support them. And that, to me, was extremely stressful because I really want my family to be safe and healthy. And aside from that, the rest of my social circle was kind of drowning out day by day. So people were moving to different cities, people were switching jobs. So pretty soon I felt this pain of isolation like I'd never felt before. And I really wanted to get past it. I actually felt like this guy, to be honest. It's like the guy hearing, like, a bad news over the phone. That was me. I was hearing quite a few bad news over the phone. And to be honest, those were not good times for me. And that's kind of how my story starts. It starts from a rather dark places of escapism. I was having a hard time dealing with stuff. And it turned me into someone who wanted a coping mechanism to deal with stuff. And fortunately for me, there comes this ski season. So as I've told you before, I'm a good skier and skiing is my saving grace. So I used to go to these ski hills called Mothamblan. It's a beautiful ski resort in Quebec. This is an actual photo of the ski hills that I used to go to. It's a beautiful place. It's basically straight out of Narnia. And I love skiing. So at the time it was a release from all the stresses and the isolation that I was feeling. It was a two hour drive from my city of Ottawa to Motombla and back. So whenever I went skiing, I always used to stay at this hostel and I really enjoyed my time there. I even made some friends with other people. I was finally able to connect with other people, share the things that kind of made me very uncomfortable about my family's illness and those kind of things. And slowly and gradually, the emotional stability and the connection that I was missing that was actually gained back by connecting with people, with other skiers, other friends. And I think that to me was the most important thing. Not just skiing, not just the beautiful views, not just know, living in basically Narnia. It's actually meeting with people, having fun with them, making memories and connecting with them. And that helped me cope with the stress of my family stuff. Very fortunately, over the next couple of weeks, both my dad and my sister recovered from COVID They are perfectly fine and they're fine now. So that's a good thing. And I had some new friends to hang out with. So that's a great news for me. So just to keep the momentum, I actually started going to Mothamblan almost every weekend and staying over. Things are looking pretty good. And one day when I was at the hostel, they hit me that I come here so often. I really like living here and there's really no obligation for me know, take the journey back to Ottawa and go there. So at this point I'd become good friends with the people who live there. So one day I basically went to the owner of the hostel. His name was Matthew. So I'm talking to Matthew and I told know if I, if I go on booking.com and book this hostel for an entire month, it's going to cost me like $3,600. That's a lot of money for me at the time and I think that might be a little too much for me. But what happens if I just pay you straight out of pocket? However much you want, you can make a rental agreement you can take cash however much you want, and then I pay you and you let me stay for a month. And this was kind of a strange request. It's like it was two in the face. It was kind of a surprising. So told him, hey, man, take your time. Take your time. Think about this. You don't have to answer me right now. So the next day, he comes back and he says, $1,200. And that was like, bam. It's basically like one third of the price that I was seeing on booking.com. So I listened to this. I'm just ecstatic. I'm happy as a person could be. And I pack up all my stuff. I go back to auto, I pack up all my stuff. I take it all in, and next thing you know is I'm moving over and actually living in a ski resort. I set up my work desk. I set up my entire workplace and everything I negotiated with my employer that, hey, I'll be working from here, and I'll be sticking to these particular work hours and focus on my work in those work hours. And aside from that, I'll be skiing in the morning or after work and stuff like that. And those were some pretty happy times for me. So this brings us to the first rule of digital nomadism. You can literally live anywhere. Anywhere. Literally anywhere, as long as you learn how to negotiate. So I never knew in my life that you could work from a ski resort and set up a workspace there. But I randomly stumbled upon it because I was going through some dark times. And I did it for two months before the partying and the fun got the better of me and had to stop. But that's a story for another day. So over time, I learned this special technique for living in places. And I learned that I could literally start messaging random hotels, outhouses, Airbnbs, anywhere which has a house which has an empty space. I can just send them, like, a fancy email telling them a little bit about me, what I do. And I would set up a call with them once. I would be on a call with them, I would have a nice and a friendly conversation. I would tell them about my background, and I ask them like, hey, can I stay here for, like, two months? And I'll pay you in cash or whatever form that works for you. We can make a rental agreement. We can do it online, however it works for you. And this interesting thing is that most of the times, people actually get baffled because it's a strange request for places which are not used to working like a rental place. And they would give me, like, 50% to 60% off simply because I asked. And the reason they would give me that is because they would much rather have a nice tenant who takes care of the place and pays them consistently, rather than sorting through all these people every weekend, making a filter, figuring out if this is the right person or not. They would much rather give it to someone who could just take care of it and pay them money. So that's how I got a lot of discounts down the line. Now, there comes a second lesson here. And in order to understand this lesson, I have to introduce you with another story. Here it goes. When I was at my company as an intern, I knew this guy back in the day. He was a very interesting guy. He joined as an intern at my company at the age of 36. He was pretty late in starting his tech career, and I asked him about his journey, and he said that when he was younger, he spent a couple of years learning how to farm in Kenya. And then he came back to Canada. He found a very large piece of land in Surrey, in Vancouver, for the purpose of agriculture farming, and he leased it for two years to do some organic farming. Now, for those of you who are unaware of the canadian housing and the property market, Surrey is a part of Vancouver, which happens to be one of the most expensive real estate areas in Canada and quite possibly the world. So now, naturally, the question comes that if he did farming in such an expensive real estate area, how did he get the money for it? So I asked him about it, and he said, I basically looked for, like, an old farmed land, which was just, like, looking like it was deserted, it was dilapidated, it was just collecting dust. And he found the owner, and he contacted him, and he promised him that he would lease this land and make it the best organic farm in Vancouver. He's very skilled, and he wants to make this great organic farm. And the owner is always welcome to take any of the fresh produce from the farm for free. So there was a lot of back and forth between him and the owner of the land, and he ended up becoming close friends with the owner of the land. Now, the crazy part is that when he finally signed the lease, the lease was for just one dollars, because that was the minimum legal amount of lease that was permitted at the time. And that's insane, right? Imagine signing the lease of an expensive land for literally just one dollars because you become friends with the owner of the place where you're working at. And I think that kind of shows you something very important that in any business, deal in any contract. It's just a contract between two people who are willing participants. So if there's only one thing, if there's only one thing that you can take from this entire talk is that never be afraid to ask for the absurd. Whether it's like a hotel where you want to live at, whether it's an Airbnb, whether you're buying a car from a rental dealership or whatever, always ask the absurd. Just it's never be afraid to ask people for something that you want, whether you want to ask someone out on a date, whether you want to ask someone out for some help that you need. The absolute worst that someone can say is no. So become closer to people, and don't do this in sort of like a manipulative way, but more in sort of like, I got to shoot my shot. Let's see what happens. Let's see how it goes. So I'll give you an example of why this works in traveling. You see, the thing that happens in traveling is that most of the places that, the fancy places that you look out for, they actually make their money during the peak season. So most hotels, Airbnbs, hostels, they mainly make their money during weekends. So if you can go ahead and ask them, like, hey, if I were to stay here for a month, can you give me a special rate? Often they'll come up with a rate that's 50% to 60% cheaper than online booking for the entire period of the place. And oftentimes you can even negotiate them further down from the rate that they first give you. And in my history, I found places which charge like $200 a night on the weekend. But if you take them for the entire month, they'll give you one, $200. So that's like an 80% discount from the monthly price of individually booking something online. And the reasoning is actually very simple. Rather than finding every new person every other weekend, sorting through people, filtering, doing all that shebang, and then hoping that they don't ruin your place, they would much rather have a decent working professional who can just take care of the place, stays there for the entire month, and they don't have to think about it. So I've literally had calls to the Airbnbs where I told them, hey, I know that Airbnbs are for short term stay, but instead of staying here for short term, how about we make this instead of booking through Airbnbs, can we just do it like a rental agreement for a longer term? And I could stay here, and they would often offer me, like 40% of the monthly price. Anything that we be terminals that we use online, like booking.com, Airbnbs, all of those things. They're kind of middlemen. They always charge you so much. First thing you can do is you can remove the middleman. Second thing you can do is you can tell them, hey, I'm staying for a longer period, just give me a better rate. And the worst thing that could happen is people say no or not give you something you want, but at least you ask. Truth is, there are no rules. You can get the best deal just depending on how smart you are with negotiation. Now, let's start off with the third rule of digital nomadism. One of the points of friction that I always learn in the stories of people who are digital nomads is that they want to be like, they would search, they would google for how to be a digital nomad in Portugal, how to be a digital nomad in South America or something like that. And they would look at the search results and they would find these fancy places which are like, this is set up for remote work. This has a fastest wifi, this has a swimming pool, this has a massage area. This has like a spa. This has all the amenities that you could need. And you find these places, but then you would actually look at the price and it would be like $7,000 a month. So it would be like you could find like a fancy paradise of remote work. Then you look at the price, you realize this is insane, and then it kind of nudges you in the direction of just, why bother doing this? It's too expensive. And the truth is that you don't need these fancy resorts to live at. You can always find much cheaper options. If you're willing to go retro, if you're willing to go on your own, you can always find much cheaper options by yourself. So, for example, imagine if you want to move to a new city and you're looking for, say, a new apartment where you could work from. Now, if you find an apartment that does everything, but it just doesn't fit into the requirement of, like, I need a good desk, I need a good place to take calls and all those kind of things. What you can always do is that you can pair up your membership with a membership of a remote workplace office. So like a co working space. And the reason that is super helpful is because you can always have a fine place to work from, which would be your co working space, and then you can stay at any crappy place that works just enough for you to sleep. So that's kind of how I did. It's like I would find any place that's good enough for me to stay at or to sleep at, and that doesn't have to be expensive. And then I would pair it with a remote work membership, and that way you can have the best of both worlds where your place of stay doesn't have to satisfy all the constraints, but it is good enough for you just to survive. So moving on to the next part of my journey. So we learned some few good lessons from the first part of the journey. So after I was staying in Mothamla, I had some couple of really amazing experiences and I had a good time, I got to be honest. But I realized it wasn't very conducive to being productive at work. And I had to decide to move back to a more normal lifestyle where I was living in a normal household. And I wanted to experience the joys of the boring life without the ski bumps and the adventure. So I moved to Vancouver, which is another city, which is way far off in the west coast. I literally found like an Airbnb. I negotiated a month of stay for lesser price than the original price. So the original price was 1100. I negotiated up to 700. And that's pretty low for Vancouver. And Vancouver is a beautiful place that's very close to my herd. And I just wanted to stay here because I wanted to explore this beautiful city. And this is like an actual photo of Vancouver. So for those of you don't know, this was actually a large move. You see, Ottawa and Vancouver are basically a country apart. They're like 3000 km away from each other. So I had to take a long five hour flight in order to move from Ottawa all the way back to Vancouver. And I understand that some of my behavior here screams of like male tecboro energy. I get it. But I can assure you other people can do this too. And that's probably why I'm giving this talk. Anyway. So I was flying all the way across the country and I had to give up literally most of the things that I owned because I only needed the bare minimum stuff that I needed with me and I had to give away all the best of the stuff that I didn't need. So in the end, the end result was something like this photo. So this is a photo of everything I owned. When I arrived at Vancouver airport. I ended up giving away all my possessions and everything I didn't need. And in the end, all I was left with was just two bags for some nice fancy clothes. My laptop, my ski bag, which is to keep my skis and some clothes and then my ski boots, and that's it. I gave away my bike. I literally sold it. I had another bag that I gave away, and I gave away a lot of stuff that I just didn't need because I wanted to be free and travel more. So this brings us to the fourth rule of digital nomadism, which is minimalism is very hard, but it's worth it. The way I arrived at this is that I made a list. I made like a noted list of everything that I could possibly use in my journey. So whether it was a toothbrush, whether it was my laptop, whether it was my slippers, anything that I use twice or twice a day, it's very clear that I actually need it. But if it's something that I don't need, like a candle or like a yoga mat or something, I'll keep it on the list, but I'll make sure that I note that I don't actually use this thing, even though I own it. And that way I kind of came up with a list of, finally, the things that I actually use once or twice a week, twice a week, every day. And I just restricted myself to only having those things, and I just gave up all of the other things away. So you don't have to go as far as I did. You can do a much smaller version of this in your own, in which you're exploring something for, say, a week or two, and you're going for a short trip. And in the short trip, you realize what you need and what you don't need, and you just stick to the bare minimum of what you need. So this brings us to the next rule, and this is kind of a pivot here, which is that the part of making lists is important, and you can use that for any other kind of problems, too. So when I had to move to Vancouver, I was become more and more familiar with myself, what I like and I didn't like. And that made me realize that every time I'm searching for apartments, every time I'm searching for rental agreements, I can always write them down as a list problem. And this is very particular for rental agreements, but it applies to many other areas of life, too. So what I would do is I would make a list, and I would make a list of all the things I absolutely need in a place or all the things I absolutely need to own. And then I would keep refining and pruning that list over months and months and years, so it becomes much easier for me to use that list and to make it applicable. So for example, take a look at this. This is my list for what kind of apartment that I need. So here I have defined all the kind of boundary conditions that I needed, an apartment that the monthly rent could be from 900 to 1300. It has to be furnished, it has to have a decent wifi, I have to have a flexible agreement from month to month. So based on this list, I kind of made like a template email message that I always used to send to Airbnbs and to landlords. And I use these kind of lists to help me kind of find newer things and to make me realize that I become very essentialist. I follow essentialism, which is the idea that you only use the bare minimum of exactly what you need and don't focus on the extraneous information and the redundant stuff. So that is the fifth rule. Write down apartment search as an optimization problem, meaning write it down as a list and then satisfy the constraints of the list. Now this is a 6th rule. This is one of the major caveat that I didn't mention before, and the reason I didn't mention is because it's actually quite hard to talk about it, is that one thing I want to warn you people is that no matter what you do, no matter what kind of exploration you do, always do things in a legal manner. Don't skate around the legal logistics, don't ruin your career because you wanted to travel, it's not worth. So don't, don't skate around legal logistics, taxes, all that kind of stuff. So if you're within the same country, like if you're within Canada, it's actually very easy to move to different provinces as long as you're not moving to Quebec. And different states have different tax regulations, so you have to take care of those. So you have to go online, peruse those tax regulations, but over time you kind of make sense of them. If you're within a single country, it's usually much easier. But if you want to go to a foreign country, or if you want to go to another country, like say, if you want to go to Europe and you live in, say, South America or North America, different countries have different regulations and you always have to know what those regulations are. So they depend on your nationality, they depend on your passport, they depend on kind of your work background and everything. So the thing that you have to know is that a lot of countries are very okay with you traveling there for a month or two or even for 90 days. A lot of countries are okay with you traveling there, but they're not okay with you working from there. So the only way to figure this out is to just actually email the embassies. Actually ask the people who are people who work in visa agencies and stuff, and ask them like, hey, is this legally allowed for me to work from there, even for 30 days? And sometimes for some places in the world, like for the United States, it can be very messy and you might find an answer no, and there's nowhere around it, so I wouldn't risk anything just for a few fun trips. So always make sure whatever you're doing, it's legal. Talk to the visa people, talk to the state and tax regulations. Talk to your employer about all the regulations there are and the legalities of your working stuff. And always make sure that you don't skater around these things because they're important. I can't tell you exact specific thing because it depends very much because everyone is under different circumstances, so everyone has different rules. And that's why I can't talk more about this topic, but hopefully you figure this out on your own. Now, at this point in the story, I was living in Vancouver, and I've been living there for a while and I really enjoyed living there. So this is my third province in the story. And as much as I enjoyed living in the paradise of Vancouver, I couldn't resist the idea of traveling and exploring more places. So one day, as I'm going about my day, I searched through Google flights and I was searching through the all areas feature. So the way you use this feature is that in the from area you enter the city of residence, the city where you're staying at, and in the to area you enter the name of your country or the continent that you want to go to, whatever it is, whatever your destination is. So for me, the search feature kind of looked like this. In the from area I entered Vancouver, in the to area I entered Canada. So here's Vancouver and here's Canada. And what it would do is that it would show me all the cheap flights from Vancouver to other places in Canada without me having to manually type in the name of the places over and over again. And it kind of makes a large map of all the cheap places that I could actually go to. So I use this feature whenever I'm feeling a bit adventurous and I want to do a nice weekend vacation or something. So as I was doing this, I saw that the flights to Calgary back and forth were just like $100. They were super cheap. So I booked a mini weekend vacation of like a long weekend. So it was like a four day vacation. And little did I know that I would enjoy Calgary so much that I actually wanted to spend more time in Calgary. So what I did was I moved to Calgary after this experiment. I did this mini experiment. I met some amazing people, had some fun time, and then I made a permanent decision to move to Calgary. But it started off with a cheap, mini weekend vacation experiment kind of a thing. And I think you can do this, too, is that whenever we think of traveling and moving places, we always think of it as this gigantic, herculean effort of like, hey, you're going to take everything you have and just move, and you don't have to do all of it. Truth is, you can just take small vacations every now and then and just try out a different place. Because the thing about trying out different things is that you don't know what you don't know, and you don't even know that you don't know it. So that's my argument for trying out different things, and that's my argument for having cheap experimentation built into your framework of living life and traveling. So, for example, if you want to try out a new gym membership or any other kind of fitness application or kind of a cooking application, don't get the annual membership. Get like a monthly membership. Stay consistent with the monthly membership. See if it fits your goal. See if it makes you actually better in life. And then, once you're consistent with the monthly membership, get the annual membership. The idea is that you have to maximize the low cost experimentation in any different area of life. And then once you have enough good results from your cheap experimentation, you can extrapolate those results and use it to do a major move, or like a full time annual commitment to anything that you're using. So cheap experimentation is, again, your best friend, and you should try it out as much as you can. Now, I want to offer a final note. I've given you a lot of advice. I've given you a lot of different teeny, tiny tactics here and there, but I wanted to offer, like, a final note, which is kind of a warning note or a cautionary tale. And basically, it's like, as much as I love traveling, exploring the world, I must warn you that all the tricks are handed to you can sometimes be quite taxing, mentally and physically, and moving to different cities, adapting yourself to different people, different cultures, all these things can actually be quite taxing on your mental and physical health. The ability to recreate everything from scratch. It's actually at a certain point, it becomes too much work, but it's still worth it. For me, it might not be for everyone. Life for me is like a fun challenge, and sometimes the experience or the novelty of new experiences kind of wears out. So I want to show you that the way to take this talk is that it's not just about traveling to different places. It's rather having a new outlook on life. So you don't have to do everything that I did. You can just take these tiny nuggets, figure out what actually works for you, and try those things out. And when it comes to traveling, I see traveling, in essence, as the ability to see the world with different eyes. You can do it in a way which I did, which is like, I literally hopped on places like a nomad and saw different parts of the world. But you can build a new outlook of life by doing the same thing you do every day, just with a different outlook. So that's a choice you have to make. And whatever you choose, it doesn't really matter as long as you're enjoying yourself. And there's a philosophy that's very akin to my philosophy in life, and it's called ikigai. So ikigai is a japanese concept that refers to something that gives a person a sense of purpose and a meaning for life. So it looks kind of like this. So it's kind of like the intersection of the Venn diagram of the four areas. So the four areas are what you love, what you're good at, what you can be paid for, and what the world needs. The idea is to combine all of them to make something that's truly meaningful and beautiful for you, and that's the kind of life you want to live. For me, I love traveling. I think it combines all the other aspects of life that give me meaning and joy. So I feel that it's very much in alignment with my values, and I encourage other people to find that thing for themselves. It may be traveling, it may not be traveling, but whatever it is, find that thing for yourself and try to embody it. And with that, we arrive at the end of our talk. It was very nice talking to you folks, and I just wanted you to know that if you wanted to recreate a similar journey for yourself, where you want to have remote work and where you want to be kind of a nomad, explore other places. One way you could do it is by joining Shopify them. And so here's the link for Shopify. So just hop onto our careers page and apply for the job that fits you the best. And I wish you the very best of luck in everything. Thank you.", "words": [], "utterances": null, "confidence": 0.957928795930758, "audio_duration": 2336.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Arfad: Today I'll talk about how to be a digital nomad without losing your job. He says there's two kinds of traveling. One is the ability to see the same things you're always seeing, but with a different outlook. His goal in life is to inspire people to learn to do the second kind of travel.\n- We are in a unique place in history where we can use our work to work remotely. Remote work is something that's considered not only acceptable, in fact, it's even encouraged in our workforce. It's time that we take the full advantage of this opportunity to travel and explore the world while still maintaining our jobs.\n- \"I'm moving over and actually living in a ski resort. I set up my work desk. I'm happy as a person could be \" He negotiated a deal with the owner of the hostel. Those were some pretty happy times for him.\n- You can literally live anywhere. Anywhere. Literally anywhere, as long as you learn how to negotiate. I could literally start messaging random hotels, outhouses, Airbnbs, anywhere which has a house which has an empty space. Places would give me 50% to 60% off simply because I asked.\n- A man leased a large piece of land in Surrey, in Vancouver, to do organic farming. Surrey is one of the most expensive real estate areas in Canada. When he signed the lease, the lease was for just one dollars. It shows you something very important that in any business, deal in any contract.\n- Never be afraid to ask for the absurd. Whether it's like a hotel where you want to live at, whether it's an Airbnb, whether you're buying a car from a rental dealership. You can get the best deal just depending on how smart you are with negotiation.\n- You don't need these fancy resorts to live at. You can always find much cheaper options. What you can always do is to pair up your membership with a membership of a remote workplace office. And then you can stay at any crappy place that works just enough for you to sleep.\n- The fourth rule of digital nomadism is minimalism is very hard, but it's worth it. I ended up giving away all my possessions and everything I didn't need. You can do a much smaller version of this in your own. Just stick to the bare minimum of what you need.\n- Make lists of all the things you need in a place. Write down apartment search as an optimization problem. Always do things in a legal manner when traveling. Don't skate around legal logistics, taxes, all that kind of stuff.\n- CNN's John Bare says cheap experimentation is your best friend. Take small vacations every now and then and just try out a different place. Once you have enough good results from your cheap experimentation, use it to do a major move.\n- For me, traveling is about having a new outlook on life. I think it combines all the other aspects of life that give me meaning and joy. Whatever you choose, it doesn't really matter as long as you're enjoying yourself.\n- If you want to have remote work, one way to do it is by joining Shopify. Just hop onto our careers page and apply for the job that fits you best. I wish you the very best of luck in everything.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.07, "text": "Different people", "timestamps": [{"start": 477528, "end": 478102}, {"start": 2171816, "end": 2172594}]}, {"count": 4, "rank": 0.07, "text": "different things", "timestamps": [{"start": 364856, "end": 365586}, {"start": 478652, "end": 479174}, {"start": 2076952, "end": 2077394}, {"start": 2084636, "end": 2085318}]}, {"count": 1, "rank": 0.07, "text": "different places", "timestamps": [{"start": 2202928, "end": 2203574}]}, {"count": 1, "rank": 0.06, "text": "many different things", "timestamps": [{"start": 364536, "end": 365586}]}, {"count": 4, "rank": 0.06, "text": "other people", "timestamps": [{"start": 670712, "end": 671618}, {"start": 673992, "end": 674770}, {"start": 1521672, "end": 1522274}, {"start": 2295302, "end": 2295722}]}, {"count": 2, "rank": 0.06, "text": "other places", "timestamps": [{"start": 1991372, "end": 1991906}, {"start": 2320938, "end": 2321850}]}, {"count": 1, "rank": 0.06, "text": "new things", "timestamps": [{"start": 210036, "end": 210878}]}, {"count": 1, "rank": 0.05, "text": "different countries", "timestamps": [{"start": 1840970, "end": 1841842}]}, {"count": 1, "rank": 0.05, "text": "more places", "timestamps": [{"start": 1947798, "end": 1948918}]}, {"count": 1, "rank": 0.05, "text": "First thing", "timestamps": [{"start": 1263810, "end": 1264286}]}, {"count": 1, "rank": 0.05, "text": "different rules", "timestamps": [{"start": 1920808, "end": 1921726}]}, {"count": 2, "rank": 0.05, "text": "different cities", "timestamps": [{"start": 576188, "end": 576770}, {"start": 2169672, "end": 2170350}]}, {"count": 1, "rank": 0.05, "text": "different parts", "timestamps": [{"start": 2227496, "end": 2228046}]}, {"count": 1, "rank": 0.05, "text": "living life", "timestamps": [{"start": 2090288, "end": 2090794}]}, {"count": 1, "rank": 0.05, "text": "different lessons", "timestamps": [{"start": 360564, "end": 361402}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}