{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/3ad8ff08-3485-4518-8953-d6e09b081679", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["becoming", "been", "causes", "conf fourty two", "experiences", "fighting imposter syndrome", "findings", "has", "head of jd platform development", "imposters", "ive", "jaggaer", "mihailo joksimovic", "others", "thats", "years"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "e6d52486-8360-44a9-a9c0-ddc73e7c5b48", "status": "completed", "error": null, "text": "You. The imposter syndrome. Do you happen to know what's the alternative name for imposter syndrome? It's the you're not good enough syndrome. You suck. You're a cheater. You're a fraud. You're just a result of a lucky coincidence. Everything that you achieved is due to sheer luck. And basically, if anybody revealed you, you would be considered a fraud and sent to an exile, removed from the tribe. And basically, that creates feelings of anxiousness, of fear, of self doubt. That's pretty much the imposter syndrome 101. Now, the best way to deal with anything, like to deal with any unknown enemy, is to learn more about it. And that's pretty much where I see my job today. My job is to tell you a bit more about what imposters syndrome is, how it affects us, and what are some effective techniques for dealing with imposters syndrome itself. Now, one bigger issue than the syndrome itself is the fact that so many of us are not even aware of it. So many of us have no idea that it exists at all. And I generally think that's stupid. And it's stupid because just by learning more about it or just by educating yourself, you could get yourself way more prepared. And once the enemy attacks, and trust me, imposters syndrome is always there. It's always waiting for an opportunity to attack. So once it does attack, by being prepared, you can actually have your defense prepared up front. And that's way better than being attacked by an unknown enemy and going into a state of complete chaos and kind of running for your life, which is what you do when something unknown attacks you. Now, why is it called fighting the syndrome? Well, the thing is that from my findings and from spending a lot of time in therapy, what I came to learn is that it seems that you're never able to actually overcome the imposters syndrome. Like, get completely rid of it, like, to conquer it. And it's especially true if you go and read about some successful people, and if you read their autobiographies or biographies and assuming they are honest, what you usually learn is that so many of them are dealing with the exact same issues of fear, doubt, you're not good enough, whatever. But it's just, like, tenfold. The more successful you are, the more of these feelings you have. So you can't really conquer it, but you can learn some techniques and tactics for fighting it. And that's exactly what I will be talking about. Now, before we jump into what, how, whatever, I'd like to share a very recent example that I shared on my Twitter. So I let the image speak for itself. It's quite an irony, I know, but just by preparing this presentation, I has having one of the most massive, ever biggest attacks of imposter syndrome. Are you sure that you know about it? Are you sure that you can prepare enough for it? Are you sure that you know what you're talking about? What if everybody realizes that you actually have no idea? Maybe you haven't spent enough time. Maybe you haven't learned enough. All those feelings of self doubt and questioning yourself and pretty much being insecure about yourself, they all rise to the top. And it literally happened just by preparing this presentation about fighting the imposter syndrome. And another example thats, I can't say it's recent, but it's more of a recurring problem, is maybe some of you know, maybe some don't. But for a while, for two years now, I've been running a personal blog where I write everything from programming to mental health to some general life thoughts. And what's funny about it is that I would, like, spend hours or days and sometimes even weeks writing and then editing and rewriting and thinking about the article. And the moment I publish it, it. I would feel a small amount of excitement the moment I publish it. But then, God forbid if it generated some success or some positive feedback, whatever, I would get excited initially. But then my first next thought would be, what I'm going to do next. How am I going to repeat this success? How am I going to do this again? I'll never be able to do this again. This was just a lucky coincidence, and I'll never be able to do this again. And what do I do now? Maybe I should have waited. All those stupid feelings of I'm not good enough. Doubting myself, questioning myself. So, as you can see, you never actually get rid of it. And there is a but obviously, the good thing is that you can learn to deal with it. And most importantly, you can learn how to recognize the patterns, because impulse syndrome comes in specific patterns. And by recognizing those patterns, you can say, oh, okay, I see what this is. I see what this is all about. And usually it can be actually an indicator that you're on a good path, because you get those feelings of questioning yourself only when you are about to leave your comfort zone or when you're leaving your comfort zone. But the moment you leave it, they actually disappear. So it's actually just a signal that you are about to leave your comfort zone, which is usually a good thing, because you do want to leave that zone. Now, sometimes those feelings can be paralyzing. I know, but you just have to practice and push yourself pretty much, but we'll get to that eventually. Now, before going into the details, I'd also like to share a personal story of mine. And the reason why I want to share this story is because so many of us, especially in software engineering, so many of us actually go through some same issues, some same problems, questions, fears, anxieties, frustrations, whatever. And yet we never share them. This is really funny. We never share these findings with others, and by not sharing them, we feel kind of isolated. We are the only ones going through this, and the feelings of isolation leads to even more frustration or whatever. So whatever the initial feeling was, it just gets emphasized and the effects increase just by the fact that you're feeling that you're the only one going through this. So what I'm hoping to do is to show you that you're not the only one and not that you're not the only one. But probably by hearing this story, you might recognize some of the pet thats you are having yourself as well. Now, the story begins probably around ten years ago or so. Now, I was doing programming since I was six or whatever. So I just loved it. I did it my whole life. And just by the sheer fact that I was doing a lot of it, I sort of became good at it. And eventually somebody wanted to pay me to do it, which was like a win win. Somebody was paying me to do something thats I would be doing in a free time anyway. Now, when you're investing a lot of time and effort and energy into something that you're pretty much passionate about, you usually get results, and you usually get good results. Pretty much. So I was advancing my career pretty fast, and by my early to mid 20s, sort of, I was already a team lead. Well, a lead developer, a team lead, whatever. And I'm not sure you could probably call it either the best or worst thing that happened to me. It's the best thing because obviously my achievements were recognized. But it could be one of the worst things because I had no idea what I was doing by having this imposter syndrome, which I wasn't even aware of. One of the huge issues with a lot of things is not being able to name them, because once you can name something, you can also solve it. But I have no idea what imposters syndrome was. So I was feeling like I don't deserve this position. I ended up in this position by a sheer luck, especially given the fact that I was leading a team of people who were almost double age of mine, well, not double, but at least ten years older than me. So I was like, okay, I'm bossing people who are way more experienced than myself. So I assumed it was a lucky coincidence, and I had to prove myself. Obviously, it wasn't enough that I ended up there. I actually felt like, now I need to prove myself, which is stupid, because I already proved by the fact that I ended up there. But anyway, so I started putting crazy long hours into work you wouldn't believe, to which point, crazy like I would work like ten or 12 hours a day. And what I also didn't know at the time, which is something that you should probably learn, is that maybe you haven't heard of it, but there is this point of diminishing returns, because usually you invest some time and work and you get results back. It's linear, pretty much like, the more work you put, the more results you get. But there comes this point of diminishing returns where you actually start putting more effort, but the results, like the productivity starts falling down. And I had no idea about it because young experiences, pretty energetic. So I had no idea about it. So I noticed my productivity started to drop. And obviously this inner voice, the biggest characteristic of imposter syndrome, just increased its volume, turned the knob to the right completely, and it just made me feel more insecure about myself. So I did the only thing that I could do, that I only knew how to do, and that was putting more work. So I started putting even more work into that. And by putting more work, I actually got even worse results. And this came to a point which I remember quite clearly. And I woke up one morning and I literally felt physically sick about the sheer thought of going to the office for one more day. Just by thinking about going to the office and spending one more day there talking to my boss, I was having this vomit reflex, this nausea, this pain, like a physical pain, just by thinking about the office. And what I would learn later is thats what I would learn in the therapy where I eventually ended up, is that there exists a concept called mental depth, which is kind of similar to tech depth, but you just accumulate it by doing intellectual work and for example, programming, obviously, or writing or whatever. Whenever you involve your mind into something like your intellect, you are collecting this mental depth. And just like with the tech depth, if you're not maintaining it properly, it threatens to danger your mental base and eventually to make it unusable. So some of the common manifestations that some of you surely know about them are starting to think that your boss is a dick. Your organization is a perfect example of a lack of organization. Management is only thinking. Management is making stupid decisions, and if they only listen to you or to developments, things would be different. Then you start thinking that grass is probably greener on the other side, and things like that. Those are some common manifestations of mental depth, which I had no idea about. And as I said, if you keep accumulating this depth, it eventually threatens to lead to a burnout, which is pretty much what happened to myself. And yet again, I don't even think that the term burnout was even popular at the time. So I had no idea about it. So I kept accumulating this debt, which obviously culminated with me waking up one morning and feeling like I'd rather die than go to the office for one more day, honestly speaking. And I can't really remember what I did. Like, did I go or not? But what I clearly remember that soon after that, I quit my job. I even broke up with my long term girlfriend. I bought a motorcycle. I was kind of having this assumption that I haven't lived my life, that my work was limiting myself. I wanted to be a playboy. I wanted to party, live the life, which kind of, I did, actually. For a couple of months. I was partying the whole time, driving my motorcycle, living a bit of locker, pretty much, and that was cool for a while. But obviously it wasn't a cause. It was just one of the manifestations of burnout, like, getting rid of the chains. And I wanted to do everything all of a sudden. And this lasted for a couple of months. And then I started waking up again. And there's nothing crazy about these mornings, apparently. I started waking up again, and I would wake up super excited, like, yeah, let's rock the day. Let's do everything, whatever. And then by the afternoon, I would be like, my mood would completely plummet. I would be like, what's the point of everything? Why am I doing thats? Why did I quit? Whatever. And then by the evening again, my mood would completely rock it again. It was completely crazy. I would be like, yeah, let's go, let's go, let's drink, let's party, whatever. All those kinds of stupid things and this stuff that's always first. But over time, these oscillations actually started getting more and more crazy. And it came to a point again where I was literally feeling like, I just can't go through one more day like this, honestly speaking. And the funny thing about these intense emotions is that about these thoughts and memories of intense emotions is thats every time you actually remember them, you can pretty much relieve them. So every time I share this story, I kind of relieve it. And it's still the same intensity every single time. It's pretty much the same intensity as on the first days. So this is generally a funny thing about mind itself. So I eventually ended up, like my friend suggested, that maybe I should seek professional assistance. And I ended up in a therapy thinking that I'm going to solve just this single issue of oscillating mood, whatever, and this would actually convert into seven years, well over seven years of active therapy. And I can definitely tell you, going to a therapy was one of the best things ever I did for my personal life, my relationships and my career, pretty much because years there were times when there wasn't much progress. But overall I think it pushed me to do something that some things that I would never even consider doing because of the self doubt. So obviously I learned that what was happening to me was a burnout, quite a massive one. And honestly speaking, if you never felt this, like, if you never felt physically sick about going to a job, I would absolutely advise you to do everything to prevent thats because the feeling is awful. What I also learned has that a lot of us, especially in software engineering or in any kind of art, I would pretty much say like anybody doing any kind of art creational work, could suffer from this imposters syndrome and from perfectionism. Perfectionism is a really big thing among developers. And I'll give you a really quick self test to test if you have the perfectionist. Thats so just think about it. Have you ever brought a piece of code that was perfectly solving the problem that it was supposed to solve, that was done in time, whatever. And yet, since you haven't hit the deadline, you actually decided to rewrite it. And you kept rewriting it until you hit the deadline. If this ever happened to you, and I'm pretty sure that at least for most of you did, you most certainly have at least perfectionist traits, if not complete perfectionism. And this could be good. Perfectionism could be good because it forces you to improve yourself. But on the other hand, it can be really exhausting because you never can finish the things and it can be really a burden on your mind. And finally, obviously, the third thing I learned is that there is this concept of imposter syndrome, which I had no idea about and which is pretty much what I'm going to cover now, right now. Funny thing about imposters syndrome itself is that the term was coined somewhere in late seventy s. It was probably known before, but the official term was introduced in late seventy s. And it was actually a result of a study that was run with around 150 highly successful women, believe it or not. And what you have to understand is these are the women who are highly successful in their work. They were highly accomplished. They were recognized for their successes, and yet by interviewing and studying how they feel, all of them on a higher or a lower scale, but all of them express some feelings of self doubt, feeling like imposters, feeling like frauds, feeling like they're all having to wear a mask the whole day. And if they remove this mask, pretty much everybody would reveal what kind of frauds they are and things like that. And this is really funny, because obviously they were highly respected for what they were doing, and yet they had complete feelings of self doubt, which just obviously tells you that no matter how successful you are, well, actually, the more successful you are, the more intense feelings of imposter are. Now, the study later has expanded and it was concluded that it's completely gender neutral. So it doesn't have anything to do with genders. Everybody have these feelings. And as I said, the more successful you are, the more intense these emotions and feelings of imposter are. Now, just in case you can't even identify it, I'll give you some ideas of what some of the feelings of imposter could be. So, for example, one very common example that I keep hearing and seeing and feeling occasionally is the job change. So many of us advance through our career, especially in the same company, and yet we sometimes tend to stay in the same company because we feel thats we feel pretty much lucky, right? And we are feeling that our successes are due to the fact that we have been here for a long time, that if you tried changing the job, it would turn out that we are not as good as we think and stuff like that. So what I would like to encourage you now is to go to a discord channel like hashtag python. And I'd like you to give it a quick thought, like what are some feelings of imposters that you've experiences? Try to identify them. Try to write about them. I encourage you to write about them because by sharing, we should help others feel the same. And while you are doing that, I'll get a quick sip of water, if you don't mind. I had to get a sip of coffee as well. So I hope you brought some things. If not, feel free to write them at any time during this presentation. I will be more than happy to discuss it with you once the presentation is done. Apologies. So a natural question would become like, okay, we all have it, we all feel it, but why? What is the reason that we have these thoughts, right? And what I came to learn and conclude, both through therapy and through reading and through doing some thinking and writing, obviously, is that, well, this is not my conclusion, but most of the things and most of the manifestations of human beings are due to evolution, believe it or not, pretty much lots of stuff is all about making you survive and reproduce. And some of you don't like it, I understand, but that's how it seems to be. Now, what's the use of feeling like a fraud, right? What's the use of feeling paralyzed? To do anything, to move, to change job, to change a partner, to start something new? Right? What could be a benefit to this? What could be a benefit to feeling like a fraud? And I'll give you sort of a counterexample, which I found really interesting. There was a study, lab study, controlled lab study done in a lab mice. I don't really know the name of the study, but I know that it happened run with a lab mice. And they pretty much put electrodes to brains of mice. And they wanted to see what happens when they stimulated the brain parts that are in charge of releasing dopamine, the neurotransmitter thats eventually makes you feel good about, makes you feel satisfied, happy, whatever. So they run this study, and they made these mice by external stimulation, obviously, by using the currents to actually stimulate their brain, they made them feel good all the time. They made them feel happy and satisfied all the time. And you might be surprised to years that most or all of these mice thats felt good and happy and satisfied all the time, eventually died from starvation. Like all of them died from starvation because just by feeling good all the time, they didn't have a need to actually go and search for the food, or to go and reproduce, or to go find the food, whatever. They just felt good and they starved themselves to death. Which could be, on one hand, could be really weird to hear, because we all think that we are all aiming towards this zen like feeling whatever, which is stupid, to be honest, but that's a different story. But this should tell you that the aim should not be to feel good all the time. And the reason why you feel pain and doubt and whatever is. It's a complex process, but most of it is actually a natural mechanism to make you move. And that's what I want you. If there is one thing thats I want you to get out of this presentation is that you really need to change your perspective about all those, what we call negative emotions like imposter syndrome after all, because they are others, to actually push you to change or to push you to keep doing something, whatever. Because feeling of a hunger actually pushes you to go find the food so that you don't die from starvation. So most of the time, if you feel like an imposter in your career, that's most likely a signal that you're doing a good job, but you're interpreting it wrongly because if you sucked at your job, you wouldn't feel like a fraud, right? Or a cheater or whatever. So you're most likely feeling like sucker because you're actually good at your job. So next time you feel the imposters syndrome and next time you identify this inner voice asking you like, are you sure about thats? Or are you sure that's good? Or are you sure that you can change the job or break up or start a new relationship, wherever thats exactly means. That means that you are about to move out from your comfort zone. And every time you move out of your comfort zone, that's actually a good thing. Trust me. Now one might ask, and rightfully so, but what if I'm paralyzed by these thoughts, right? What if I'm completely paralyzed by these thoughts of impulses that I can't even move? So I obviously see a signal that what I want to do is good, but what if I can't make thats move, right? And that's exactly what you should. Well, that's exactly what I'm going to talk about now. Like some of the techniques that you can use, and by using them, you should be able to better approach the issue, obviously. But in the worst case, you should always seek a therapy, right? Like a professional assistance. So let's talk about the imposter syndrome fighting tools. Now, the first tool in our toolbox is the easiest one, believe it or not, and it's acknowledgment. So what I really want you to acknowledge is that we all have it. We all had it and we will all have it forever. So imposters syndrome is not going anywhere. It's others. It will be with you. And you should really treat it as a mechanism that tells you whether you are on a more or less righteous path or not. So acknowledge it. Everybody has it. Everybody lives with it. So you're not isolated. We are all there. And I'm really hoping that some of you shared something on the Discord channel. If not, now's the time to show everybody that we are in the same boat, right? So, acknowledgement. The next thing which I really found useful and comforting is reading biographies or autobiographies because nobody really reads biographies or writes biographies for that purpose, about the people who were unsuccessful or know, like your average Joe from the neighborhood. So biographies are usually written about people who actually did something like good or bad doesn't matter, but they did something which was worth sharing. And what you will learn if you read at least honest biographies. Is that all? I won't say some. I'll say like, well, 99.99% of these people actually felt quite intense feelings of impulsive, felt like frauds, like whatever they all did. The only thing that distinguishes them is how they dealt with it, which are some techniques. Some of them use some positive things, some use negative things like alcohol and stuff. But overall they all felt it and they all were searching and using some techniques to fight with it. Now, the technique that I personally think is most useful and yet most difficult to implement is discipline. Believe it or not, discipline, from my point of view, is absolutely the number one tool for beating any procrastination, any laziness, any feelings of imposter. And it's actually really simple. And I'll give you a perfect example. So whenever I'm about to start writing new article, for example, or whenever I'm about to involve myself in fixing some incident or whatever, like anything that is unknown to myself, whenever I think about going that route, involving myself in it, I would feel like, can I do it? Should I do it? And there's this procrastination and feelings of doubt. Whatever, discipline is the best antidote. Because just by committing yourself to doing it daily, regularly, like for example, I'm going to write every day from 09:00 a.m. To 10:00 a.m. I'm going to fix incidents every single day from 12:00 p.m. To 02:00 p.m.. Whatever. Just by being disciplined and making yourself committed to it, you actually don't like yes, you will feel these feelings of imposter, but still you just have to do it. It's like going to a job. You don't have to feel like doing it, you just have to do it. That's pretty much. So it's easier said. Thats done. I agree. But you should really consider it has making yourself disciplined. So it's not about becoming motivated, it's about being disciplined. So commit yourself to, if it's a job change, commit yourself to every single day from, I don't know, 06:00 p.m. To 07:00 p.m. I will send one job application or if it's about writing every day from 06:00 p.m. To 07:00 p.m. I'm going to write whatever it is, but I'm going to write even if it's just bullshit, I'm still going to write it from 06:00 p.m. To 07:00 p.m. And trust me, the results are amazing just by being disciplined about thats. Now a next tool which is quite underappreciated and yet awesome is occasionally reviewing your successes. And this is really funny because we sometimes tend to forget the good things that we achieved and we always focus on things that we haven't achieved, which is good because it keeps pushing you to do more. But on the other hand it's bad because sometimes you just completely forget what you achieved at all and you really sometimes need to feel good about what you already achieved. So one of the things that I'm doing is I used to journal Daily but I slowed it down a bit. So I'm journaling maybe a couple of couple of times a week. I'm using by the way, day one application which is amazing. It's a free app, it's an awesome tool for journaling. But point is, just occasionally write good things that you achieved. Like today, I don't know, brought this or I sent this many applications or I fixed this many incidents or bugs, whatever. Just write down your successes and schedule time like once a month, once a quarter, whatever. Schedule time to actually review your successes. Because you would be surprised how much you are achieving and how much you're forgetting that you are achieving because you're focusing what you haven't achieved yet. And another one, almost the last technique, the last but not the least pretty much is doing something that you suck at honestly. And this is definitely one that's easier written than done. But what's really interesting about doing things thats we suck at is seeing how we improve. I'll give you an example. I wrote an article about this actually with the same name, like do something that you suck at. And I took it as a challenge to try playing guitar and I always did suck. And just by assuming that I suck, I never did it again. But I wanted to try playing guitar again. And what is funny is that I has obviously all these feelings about I will never learn it, I will never be able to do it whatever. And that's still true. But what's really funny is when you see yourself having these feelings of doubt, of anxiousness, of questioning yourself, and yet when you do it and when you see yourself improve, like go from .0 point of no results to points of some results, and when you observe that you still have these same feelings of imposter, you can actually feel thats no matter, you can improve. That's when you can feel great about it and the imposter feelings will still be there. So I think thats one of the best antidotes for generally beating anything is doing things that you think you suck at. You get those beginner results and you learn a lot about yourself, which you probably forgot from the time that you were a kid. So take it as a challenge and if you feel brave enough, write it to a python channel, do something that you suck at and tell us what it is. And finally, obviously there is just no replacement for the ultimate king of fighting the imposters or anything. That's therapy. So as I said, I highly suggest it. I've been doing rational emotional behavior therapy like crept ive also years positive experiences with gestalt, psychodrama and I don't know what there is, but whatever it is, give it a shot and if you can afford it, it can be one of the best things that you did for yourself recently. Just take my word for it. And we pretty much came to the end. I just like to share a couple of books in case you are not feeling like doing something that you suck at or going for a therapy. So I have four books here. I would obviously suggest a lot more, but these four are nitpicks, so to say. So, first one is tools of titans by Tim Ferriss. It's a summary of, I don't know, he interviewed a bunch of people, but this is a summary of, I think 150 or 100 people, highly successful people. And he summarized pretty much the interview with their daily rituals, how they go through life, how they handle the feelings of imposters. So just by seeing some people that you definitely heard or know about, how they deal with it and what they do, I think it's pretty powerful thing to have in your toolbox. Second book, extreme ownership. Amazing book about owing everything that you do pretty much from how you dress to how you lead the team. Absolutely amazing book. Changed a lot of my perspectives and gave me some really amazing tools. So highly suggested give it a shot. Amazing book. If you're feeling for something more complex and more in depth. There is just no replacement for thinking fast and slow. It's just a bible, literally a Bible. And pretty complex book about how we feel and how we process things and how we make conclusions and how to say if you engross yourself in this book, what you will get to learn is that our thinking process is just incredibly flawed and there are just some crazy things that you just won't believe but and yet they happen again. Don't underestimate this book. It's really complex book. It took me around four months, I think, to read it and it deserves time and processing. So take it in a bite sized session, so to say. And finally, if you're a person who struggles with discipline or forming habits or moving from a .0 to point to moving, overcoming that static motion, whatever, getting that initial movement, others is just no replacement for atomic habits. It's an amazing book. It tells you how habits are created and what are some techniques that you can do to help yourself create some if you don't have them already. So four books, absolutely highly recommended by myself and many people around me. Go check them on Goodreads, go purchase them and let me know what you think. And with that, I'd like to thank you very much for watching this, for attending this conference. It was an amazing pleasure to talk about this. And since this is the first time I'm doing this lecture about this topic, you can find this QR code on the right hand side of the screen. If you scan it with your mobile phone, it will take you to a Google form where it's like a 1 minute survey. You would do me an amazing favor if you let me know how I did, what you think about the presentation and what are some of the things that I could improve. High appreciate it. I would really be thankful if you do it and that's it. I'll join you on the Discord channel and let's discuss more if there is anything more to be discussed. Thank you very much and see ya. Bye.", "words": [], "utterances": null, "confidence": 0.951960528544803, "audio_duration": 2391.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Imposters syndrome creates feelings of anxiousness, of fear, of self doubt. The more successful you are, the more of these feelings you have. You can't conquer it, but you can learn some techniques and tactics for fighting it.\n- Just by preparing this presentation, I has having one of the most massive, ever biggest attacks of imposter syndrome. All those feelings of self doubt and questioning yourself and pretty much being insecure about yourself. But obviously, the good thing is that you can learn to deal with it.\n- Software engineers go through some same issues, some same problems, questions, fears, anxieties, frustrations, whatever. But we never share these findings with others, and by not sharing them, we feel kind of isolated. I hope to show you that you're not the only one.\n- A lot of us, especially in software engineering or in any kind of art, could suffer from this imposters syndrome and from perfectionism. The more successful you are, the more intense these emotions and feelings of imposter are. Try to identify them. I encourage you to write about them.\n- Most of the things and most of the manifestations of human beings are due to evolution. What's the use of feeling like a fraud? Most of it is actually a natural mechanism to make you move. But this should tell you that the aim should not be to feel good all the time.\n- Most of the time, if you feel like an imposter in your career, that's most likely a signal that you're doing a good job. That means that you are about to move out of your comfort zone. But in the worst case, you should always seek a therapy.\n- We all have imposter syndrome and we will all have it forever. The first tool in our toolbox is the easiest one, believe it or not, and it's acknowledgment. The technique that I personally think is most useful and yet most difficult to implement is discipline.\n- The next technique is occasionally reviewing your successes. The last one is doing something that you suck at honestly. You would be surprised how much you are achieving. And finally, obviously there is just no replacement for the ultimate king of fighting the imposters. That's therapy.\n- Four books to consider if you are not feeling like doing something that you suck at or going for a therapy. Tim Ferriss, extreme ownership. There is just no replacement for thinking fast and slow. Four books, absolutely highly recommended by myself and many people around me.\n- You can find this QR code on the right hand side of the screen. If you scan it with your mobile phone, it will take you to a Google form where it's like a 1 minute survey. I'll join you on the Discord channel and let's discuss more if there is anything more to be discussed.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.07, "text": "good things", "timestamps": [{"start": 1938188, "end": 1938742}, {"start": 1981180, "end": 1981654}]}, {"count": 10, "rank": 0.07, "text": "imposter syndrome", "timestamps": [{"start": 26572, "end": 28070}, {"start": 31980, "end": 33510}, {"start": 66712, "end": 68062}, {"start": 228908, "end": 230230}, {"start": 257348, "end": 258746}, {"start": 552176, "end": 553206}, {"start": 663396, "end": 664458}, {"start": 1131164, "end": 1132690}, {"start": 1560388, "end": 1561226}, {"start": 1669000, "end": 1670094}]}, {"count": 1, "rank": 0.06, "text": "good enough syndrome", "timestamps": [{"start": 36236, "end": 37602}]}, {"count": 1, "rank": 0.06, "text": "stupid things", "timestamps": [{"start": 926584, "end": 927202}]}, {"count": 1, "rank": 0.06, "text": "negative things", "timestamps": [{"start": 1783036, "end": 1783830}]}, {"count": 3, "rank": 0.06, "text": "Funny thing", "timestamps": [{"start": 947648, "end": 948074}, {"start": 973064, "end": 974034}, {"start": 1139790, "end": 1140810}]}, {"count": 1, "rank": 0.05, "text": "good results", "timestamps": [{"start": 518616, "end": 519374}]}, {"count": 1, "rank": 0.05, "text": "complete feelings", "timestamps": [{"start": 1216168, "end": 1216926}]}, {"count": 4, "rank": 0.05, "text": "more work", "timestamps": [{"start": 634188, "end": 634534}, {"start": 679132, "end": 679494}, {"start": 680652, "end": 681190}, {"start": 683276, "end": 683910}]}, {"count": 1, "rank": 0.05, "text": "enough time", "timestamps": [{"start": 241958, "end": 242522}]}, {"count": 2, "rank": 0.05, "text": "schedule time", "timestamps": [{"start": 1992848, "end": 1994090}, {"start": 1997440, "end": 1998410}]}, {"count": 1, "rank": 0.05, "text": "impulse syndrome", "timestamps": [{"start": 359716, "end": 360714}]}, {"count": 1, "rank": 0.05, "text": "more effort", "timestamps": [{"start": 642496, "end": 643126}]}, {"count": 9, "rank": 0.04, "text": "imposters syndrome", "timestamps": [{"start": 87180, "end": 88134}, {"start": 93984, "end": 94966}, {"start": 122088, "end": 123006}, {"start": 164084, "end": 164874}, {"start": 564468, "end": 565294}, {"start": 1063496, "end": 1064446}, {"start": 1141440, "end": 1142550}, {"start": 1600528, "end": 1601494}, {"start": 1690896, "end": 1691926}]}, {"count": 1, "rank": 0.04, "text": "imposter syndrome fighting tools", "timestamps": [{"start": 1669000, "end": 1670974}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}