{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/8317c239-333f-4b85-8f2e-995f6ff7ec20", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["big", "boomertechgroup", "can", "companies", "conf fourty two", "corporate", "derris boomer", "fortune companies", "internet", "jobs", "opportunities", "skills", "softwareasaservicesaas", "startups", "technologies", "technology", "technology trends", "these", "thingsiot", "trends", "workers"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "95000988-a048-4929-aed1-7f44edaaaa7c", "status": "completed", "error": null, "text": "You. Hello, chaos Engineering. This is Derek Boomer. And today I will present to you five technology trends and how they can affect you for startups and for companies that are in these Fortune 500. I want to thank, first of all, Mark Polikowski for having me tonight. And I also want to thank the folks in chaos engineering in general. Thank you guys for having me as a speaker. So I'm going to start this presentation again. We're going to cover some hot tech topics out there for technology companies as far as technology themselves. Again, my name is Derris Boomer. Here's my information to contact me and my website. I will post my presentation on my website and I'll make sure it's available to you guys also from the conference. So again, tonight's agenda, I'm going to talk about AI, AI, IoT machine learning, software as a service, and I'll also talk about big data. So here are some trends, these that I wanted to kind of speak about before I go into each detail. For AI, we've been seeing this for the last decade becoming more and more apparent than business on the consumer side. It's definitely jumped leaps and bounds. Think about what's in your house. You have Google now has devices like alexa in your home. You have smart homes now, smart thermostats, and all types of things happening on the consumer side. There are more things happening on the business side than the consumer side. And we'll get into that in just some detail. For IoT that's been growing, think about how many devices are now enabled within your home, within your business. They're getting IP addresses. So that trend is going to continue here in the near future. Machine learning, we'll talk about that to some degree what that means and how that's going to continue to be a hot topic for people, especially in the career market. I'll talk about SaaS and how that's changed the planet in regards to the Internet and with cloud computing and with the Internet as a whole. The last thing I'm going to cover is the topic of big data. And we're going to kind of go into why that's really big in a hot job market as well. Now, I have here a graph, and this graph talks about total job openings by skill area for the last twelve months. This was a survey done the end of 2020. It was posted on Forbes magazine, thought it was a pretty interesting graph. First of all, it shows you here that the software dev that's happening, that's number one in software development technologies, no matter what they are whether it be Apple based, pc based, whatever it is, that's a hot commodity for a skills for jobs. The thing I thought was kind of cool also that I'm going to talk to you guys tonight about cloud technologies, AI, machine learning, and NLP. Those are definitely growing. Cloud is still number two on this list. Number three is security. It. Automation is getting big as well. At the very bottom here, it did have fintech, parallel computing and quantum computing. So it's a small field, but it's growing. So if you're looking to jump on something new from scratch, definitely look into quantum computing and parallel computing as well. So the first thing we're going to cover tonight is artificial intelligence. And this is not the movie with the robots. We're not going to get into robots per se, but we'll talk a little bit about what is AI, what is machine learning, what is deep learning? And I want to go into these about the consumer side. Think about as a consumer, how does AI affect your life today, if at all? And it probably does in more ways than you think about it. I have a smartphone. I'm an Apple guy. So if I speak to my assistant, we all know her name. I won't say it because she'll come on. It can help me with my different applications within my smartphone. And if you're using an Alexa in your house or any other Android based device, you can use those visual assistants. Well, that's an AI, right? If I can tell my AI to create a new calendar event for tomorrow night, it's using voice enablement to do that process. For me, that's getting to be a hot thing from the voice perspective. But think about AI within your other parts of your life. It's in your car or if it's in your gaming device, you're seeing AI all over the place. If you're going into, let's say you're going into your different types of television access, if you're using Hulu or if you're using some other company, they're using some AI to figure out what you like and give you more of the same thing, right? And that's an AI being done behind the scenes to say, hey, Derris likes this kind of a movie, but he doesn't like these kind of a movie. And that's an AI in that perspective. On the business side of this, think about if you're calling up a company to complain about some consumer thing that you're having an issue with on a product, and you'll get some kind of a telephone prompt to click of this number and do that and do this. Well, now you can just sometimes just say it out loud and it'll recognize what you're saying and say, hey, I'm looking for a hardware issue. I'm looking for a software issue. I want to speak to a person that's some natural language, things happening where they're going to hear your voice and give you a prompt to go to the next part. That's AI in the background. Think about you on a website and certain sites lets you go into a bot to ask questions. Let's say you're going to a dealership's website or you want to ask about a part you want to purchase. It's going to ask you some questions in that little bot and point you in the right direction to get that resolved for you. As an example, AI. We'll cover some more of this AI in detail and some other topics here. But the hot jobs here on the far right, which is data analytics, NLP engineer, UX developer, data scientist, big developer, software engineers. The hot focus areas on the far left here, gamification, for example, and I'm not referring to you creating video games. I'm talking about gamification and other business sectors. Things such as I want to have some training done for my store, I'm a retail store company and we want to have gamification to train our people how to sell better or how to process their payroll better. Whatever the case, they can use the gamification process with AI to make it a better experience for the user. Think about manufacturing, entertainment, education, training, customer service. Again, these are focus areas that are hot out there for AI. It will continue on these consumer side as well as on the business side in regards to coding languages. If you're a developer, these are some hot things that are happening out there code wise. You need to learn these skill sets to be really good on the hot jobs that I talked about earlier. I'm going to move on to IoT and in regards to Internet of things. As we all know, we have devices that are all receiving ip addresses nowadays and they're getting more and more robust. Think about your home life. You can have your appliances, your refrigerator, your washer, your dryer. They have a Wifi connection. They can call out to the manufacturer and see that they're broken. Or if there's an issue with your dryer, you can put it up to a telephone and it'll make a certain beeping noise. In the old world, new world, it can just dial into itself. It can dial out itself on the Wifi and talk to the manufacturer direct. That's a pretty cool thing for your home line. On the flip side, for the business end of this, I've had clients who are manufacturers of products and they have an assembly line in these manufacturing warehouses. And within that they'll have different devices in that assembly line that has a Wifi enabled connection and they can monitor when there's going to be an issue. They can be proactive to this device. They can have it tell you how far they're going with their productivity. Right. If I wanted to have, let's say, 19 different manufacturing plants across the globe, I can now track down to the line item level that, hey, in Singapore, line 14 is down for the next 6 hours, right? And it told me that because it's being monitored through an IoT interface of some type, if I'm over in Canada, that hey, it's a holiday and we're turning things off today, perhaps that's the best time to have maintenance for that device. Well, having these devices enabled through the Internet lets these companies be able to manage these things a lot easier and be more proactive. The hot jobs in these space would be Iot hackers. You can learn to make security better for these companies with their IoT devices. Support technicians. If you're a robot coordinator, of course, UI UX designers. And if you're an essay solution architect, there are hot jobs in these market. And mind you, this is the multi billion dollar industry that's going to continue to grow focus areas again, manufacturing consumer goods. Think about wearables. I have a client where they have these Google glasses that they can utilize on their processes and have that enabled through the Internet. Think about smart buildings, your automobiles, of course. Think about your teslas and all those good things on the bottom here. Smart cities. That's becoming more and more of a need within the entire country of the US where these cities want to have their devices enabled to make things better. As an example, if you have street lights or street lamps, traffic lights that are enabled through an IoT perspective, if it's a manhole cover that has a monitor on it, if it's a meter of some type, these things that can be Iot connected back to the manhole cover example that each manhole has a sensor that lets us know if it's been opened or not. From security perspective, if it's a building that has certain doors or windows connected, you can figure out what's happening. If it's their HVAc system in that building. From a climate control perspective. You can have an IoT component to that as well. I'm going to move on to machine learning as the next topic here. Now for machine learning, this is about having an AI that can spot a trend. And then think about how it's going to tell you to make this a better trend or in a better experience. And I'll give you an example. Think about if you have a smartphone on your person and you're driving every day the same route to work. And for the next six weeks, we do the exact same route every single week. And during this route, we stop and get coffee at Starbucks, or we stop every Wednesday to get gas filling at the same gas station. In my example, at some point my smartphone is going to realize, hey, I'm seeing a trend here. That Derrick always stops on Wednesday to get gas. He always stops for coffee at this intersection. At some point, my AI may say in my telephone, hey, you buy Starbucks, you want to go get something? Or it may say, hey, you didn't get gas today. Well, let's say I'm going to the gym every Saturday at 07:00 in the morning for the last seven weekends. And now this weekend, it's 08:00 and it goes, hey, you missed the gym. Do you want to go? That's machine learning. In my example, that it's seeing a trend of how I operate, how I do things, and how I move. The gps isn't involved, and it can tell me a trend and make my life better. Hey, tomorrow's Saturday, Jim. Hey, today's Wednesday. Gasoline tomorrow. Should I change your route to work today? That's the beauty of machine learning in my personal life. On the business side of this, you have companies who want to figure out, again how to have trend analysis and have these machine learning algorithms make these life better for their employees and or make a better process in general. Think about things such as these virtual assistant virtual agents. Think about biometrics. Think about learning platforms. Think about speech recognition. All of these things are a part of this. And the hot jobs in this space would be the following. Machine learning engineers, computer scientists, AI programmers. There's an array of jobs that are out there in this space, and it's only going to continue to grow year in and year out. I'm going to move on to the topic of SaaS and again, going back to the Internet and cloud based information. This is the model that we're all seeing, right, where I can now purchase a certain software package. I can pay for it monthly or annually, and it's a much cheaper cost to me as a consumer because now I can access this software, this platform from any device that I have, whether it be a tablet or a smartphone or traditional pc or laptop, I have access to this at all times. The best model of this is to think about Microsoft office on your phone, it's on your tablet, it's on your laptop. You purchased an actual license to use that off of MS office on the cloud, and you can now access MS Word and PowerPoint, all those good things from anywhere you want on your device. On the flip side, for business, we're seeing that same model being utilized over and over again. A good example of that would be salesforce.com. If you're having a sales team with your company on the consumer side, think about the Xbox Live. You can now purchase these games and pay for them monthly. And that kind of a model for that process for yourself. Think about smartsheets to track your projects in your company. So this SaaS model is being utilized all over the place, whether it be AWS. And that trend will continue for certain. The hot jobs in this space, I will say on the far right here, these lead software developers, SaaS specialists, software engineers, software support engineers. It's a big thing happening. It's going to continue. And it's in two focus areas, right? Whether it's be business to consumer. Again, back to the Xbox ideology or MS office, business to business. Think about Salesforce.com and their competitors. Think about companies like Shopify, Zoom, Slack, HubSpot, Atlasian. If you're a Slack user, you can have that stream utilized for your business. If you're some club in your town, you can use slack for that. You know, again, this is platform specific, but there are technologies in the background that will enable this. So if you're a developer, if you're a person that's going to roll this out, if you're going to support it as an administrator, this space is not going to slow down anytime soon. Our last topic in my speech for tonight is big data. And I said to you guys earlier that when we're saying big data, we're referring to like large amounts of data. Think about if you were a company that was collecting data since 1924 and now it's 2021 and they want to go back and see these history of their company and how they use this data in that example of historical data in large amounts versus, hey, we're the hottest companies selling this software product and we have so many customers and we want to track that customer in great detail where they came from. These demographics, how often is being utilized? We're doing an upgrade for the software that can become a lot of data really fast. So in the big data perspective, you want to have that skill set to try to go and take this data, have it analyzed, but more importantly, pull out certain KPIs or certain things that are metrics of information that can be vital to your organization. And I'll give you can example, I had a client where again, they're a manufacturer of goods and their consumer database, right? That sales information about their consumers, their history, what they've purchased in the last two decades, that was a battle for their business because they want to get more repeat customers. On the flip side, if they're looking to purchase some demographics data from someone from the outside and figure out how to market to new companies, to new people, that could be a lot of data as well. So my point to you is that big data, it encumbers our lives in so many different ways. Beyond that business side of it, think about yourself as a consumer. You have cable company or you have all of your data with your satellite company. They know who you are, they know what channels that you like to watch. They know what time you watch tv all the time. Well, somewhere in these background that data is being pulled and they're going to look at it in the future to figure out how to serve you better as a consumer. In this example, going back to these slide deck on the client side, that big data, again, if you're a data scientist who's going to out there and manipulate what's happening, what they have in their data sets, if you're a developer in these space, if you're working on the software side of this or if you're a traditional DBA, at any rate, these are hot jobs and you're going to see this continually happening where big data is going to be a big part of life, it's not going to stop. So those are the five hot technologies. As a recap for those who may have come up with a phone call late, we covered these following technologies, which was AI IoT, machine learning, SaaS and big data. So again, if you don't have that skill set already, you can always go and learn that. You can go back to school, you can take courses, you can read books, and that's going to give you a better skill set in the open marketplace. Lastly, I want to give you guys one more value point before I stop this presentation. And the value point is to go out there and work for certain companies. If you don't have that skill set already there are companies who were consulting companies across the globe that are the big five or the big six, whatever you want to call them. In this example, I'm showing you guys about Deloitte, PwC, Ernst and Young, KPMG and Accenture. And the beauty about these three companies is that these companies, they're going to provide for you three things. If you go work for them, whether you're a w two employee or you're one of their consultants who's a 1099, they're going to give you a check each week. That's great. But the other two things is if you're a junior level person or intermediate level person, you can go to these companies and work for these and receive on the job training. And that's vital because now you can actually execute what you've learned in these technologies. Number three, they're going to provide you access to more than one kind of an actual client, meaning you can change business sectors in different states or cities, and they can expose you to so much. So my value point to you guys. If you're not an independent consultant already or you don't have your own business or whatever the case may be, you're trying to get into these hot topics of jobs that are out there. Don't be afraid to work with these kinds of companies and get up your skill set a little bit better. So, again, these are the hot jobs that are out there that they're looking for. In general, a data scientist, report writers, trainers, project managers, QA analysts, solution architects. These are going to be in hot demand all the time. So if you're looking to align yourself to those five technologies, these companies are all pushing that day in and day out. Here goes my references for this presentation as far as what I pulled some data from. Again, I'm Derek Boomer. That's going to conclude tonight's presentation. I thank all of you for your time and your efforts, for listening to me for the last few minutes. And again, I want to thank Mark so much for having me on for these conference. Again, guys, thanks so much. Enjoy your time on the conference. Take it easy.", "words": [], "utterances": null, "confidence": 0.949933794555148, "audio_duration": 1101.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Today I will present to you five technology trends and how they can affect you for startups and for companies that are in these Fortune 500. I'm going to talk about AI, AI, IoT machine learning, software as a service, and I'll also talk about big data.\n- The last thing I'm going to cover is the topic of big data. And we're going to kind of go into why that's really big in a hot job market. Cloud technologies, AI, machine learning, and NLP are definitely growing.\n- How does AI affect your life today? And it probably does in more ways than you think about it. Think about AI within your other parts of your life. It will continue on these consumer side as well as on the business side in regards to coding languages.\n- I'm going to move on to IoT and in regards to Internet of things. Having these devices enabled through the Internet lets these companies be able to manage these things a lot easier and be more proactive. The hot jobs in these space would be Iot hackers.\n- I'm going to move on to machine learning as the next topic here. This is about having an AI that can spot a trend. And then think about how it's going to tell you to make this a better trend or in a better experience. The hot jobs in this space would be the following.\n- SaaS is the model that we're all seeing, where I can now purchase a certain software package. Whether it's be business to consumer or business to business, this trend will continue. The hot jobs in this space are software developers, SaaS specialists, software engineers.\n- Our last topic in my speech for tonight is big data. Think about if you were a company that was collecting data since 1924 and now it's 2021. You want to have that skill set to take this data and pull out certain KPIs. These are hot jobs and you're going to see this continually happening.\n- There are companies who were consulting companies across the globe that are the big five or the big six. A data scientist, report writers, trainers, project managers, QA analysts, solution architects are going to be in hot demand. Don't be afraid to work with these kinds of companies and get up your skill set a little bit better.\n- Derek Boomer: I thank all of you for your time and your efforts, for listening to me for the last few minutes. Enjoy your time on the conference. Take it easy.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.06, "text": "certain things", "timestamps": [{"start": 869496, "end": 869954}]}, {"count": 1, "rank": 0.06, "text": "more things", "timestamps": [{"start": 107268, "end": 107822}]}, {"count": 1, "rank": 0.06, "text": "certain companies", "timestamps": [{"start": 989820, "end": 990470}]}, {"count": 1, "rank": 0.06, "text": "new companies", "timestamps": [{"start": 897136, "end": 897850}]}, {"count": 1, "rank": 0.06, "text": "technology companies", "timestamps": [{"start": 54612, "end": 55566}]}, {"count": 9, "rank": 0.06, "text": "big data", "timestamps": [{"start": 77992, "end": 78638}, {"start": 142768, "end": 143434}, {"start": 818360, "end": 819122}, {"start": 821656, "end": 822580}, {"start": 859204, "end": 859662}, {"start": 902244, "end": 903054}, {"start": 935692, "end": 936310}, {"start": 951952, "end": 952362}, {"start": 968728, "end": 969346}]}, {"count": 8, "rank": 0.05, "text": "hot jobs", "timestamps": [{"start": 334092, "end": 334786}, {"start": 389404, "end": 389950}, {"start": 488588, "end": 489186}, {"start": 503028, "end": 503594}, {"start": 679148, "end": 679618}, {"start": 766072, "end": 766606}, {"start": 948608, "end": 949350}, {"start": 1059588, "end": 1059978}]}, {"count": 2, "rank": 0.05, "text": "software engineers", "timestamps": [{"start": 342150, "end": 343206}, {"start": 772990, "end": 774078}]}, {"count": 1, "rank": 0.05, "text": "Machine learning engineers", "timestamps": [{"start": 681090, "end": 682466}]}, {"count": 1, "rank": 0.05, "text": "software support engineers", "timestamps": [{"start": 774174, "end": 775870}]}, {"count": 1, "rank": 0.05, "text": "cable company", "timestamps": [{"start": 911812, "end": 912462}]}, {"count": 1, "rank": 0.05, "text": "software development technologies", "timestamps": [{"start": 169992, "end": 171710}]}, {"count": 1, "rank": 0.05, "text": "other business sectors", "timestamps": [{"start": 352576, "end": 353878}]}, {"count": 1, "rank": 0.05, "text": "different devices", "timestamps": [{"start": 440860, "end": 441702}]}, {"count": 11, "rank": 0.05, "text": "machine learning", "timestamps": [{"start": 74030, "end": 74914}, {"start": 124696, "end": 125490}, {"start": 184226, "end": 184822}, {"start": 217128, "end": 217938}, {"start": 575464, "end": 576034}, {"start": 577708, "end": 578760}, {"start": 634338, "end": 634982}, {"start": 651872, "end": 652570}, {"start": 660452, "end": 661198}, {"start": 681090, "end": 681782}, {"start": 966922, "end": 968002}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}