{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/0dc61267-4665-4ab9-b32f-2f06d64b6bdd", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["avito", "coldstart", "conf fourty two", "experiences", "head of seller experience product", "igor sedachev", "marketplaces", "problem", "secrets", "strategies", "unlock"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "cbff9e2b-cb42-48d9-8ace-ec67cab714da", "status": "completed", "error": null, "text": "Hi everyone. Today we are going to speak about cold start problem in social marketplaces about balancing supply and demand. And let's start with definitions. What is social marketplace? What's the difference with the normal one? Well, if we open any book and we try to google it, we'll find out something like that. It's a blend of ecommerce and social media that allows fetching content and using it for ecommerce needs. And actually, from this major words, we need only the first couple. So it's a blend of ecommerce and social media. So it's the marketplace when you can post some kind of a content and then you can buy some goods, virtual or real one. So when you're building it as a startup or as a mature product, you always have to think about two major things. One is how to build a marketplace and the second, how to build a media. And they got some effects between each other. So what is the cold start problem and why we're so focused on it, why it's so important in building marketplaces? Actually, if we open any book about the building marketplaces, we'll find out that there is three major maturity levels of marketplaces. It's a cold start when you got nothing, you got no supply, you got no demand, and you have to solve this chicken and egg problem. What to start with, supply or demand? Then you move to the growth stage. When you try to balance your value proposition and incentives, budget out compete other players, and if everything goes so well that you're a major player, you start in the dominance stage when you got the market share, more than 50%, and your target is to gradually capture remaining demand until you reach the full situation. Why the call start is so important because it's a starting phase. So you cannot build marketplace avoiding this stage. And actually most of the startups, most of the new products and new features, they are dying in this stage. If you pass through it, it's really easier to work with growth and the dominance. So it's the core of building the marketplaces, as I said, two major things, media and ecommerce. And they are not invented by Internet producers, by product managers, et cetera. These two activities, these two types of organizations, they coexist for a long time. So let's talk about the history and how they coexistent in a short way to understand how they interact right now, first of all, let's assume that we are in pre Internet times somewhere in the beginning of the or in the middle of the 20th century, and we got some kind of a seller that going to sell some kind of goods. Let's say we are trying to sell the microphone. So we need to do two simultaneous things. The first, it's the marketing and you have to go to offline media to explain to audience that your microphone is good, how it works, why you need to buy it, why it's better than competitors. Or if you just invented the microphone, what is the product is why you are going to use it. And second thing, you have to think about the distribution. Okay? Somehow you persuaded your audience that they need the microphone. They still have to go to offline store, they still have to exchange money to the microphone or order the delivery and all the things. So the offline store, it's the major distribution players and then they got audience. So people have to look through ads, so some PR articles, some different kind of content there, and then they have to go to store and then they have to perform the transactions. And actually media and offline source, they wasn't so aware about the audience, about how they behave, et cetera. Then Internet came and we all starting living in the new world where the traditional media is changed to the social ones and the offline stores is changed to the online stores. For the seller, it's quite the same system. You still have to think about the marketing, you still have to think about the distribution. It's still the different places. So you have to work with both of them. But the main difference there, that social media and online stores started collecting preferences. So they started to know their audience much better. Social media knows what you are like and what you dislike, what kind of content you interact with better and what you are not. And online stores, they know your preferences, they know what you bought, what you looked at, maybe you added to the chart and then you're not bought it somehow. So everything started moving around the data about the predictions, about the recommendations. So what is the social marketplace? It's the thing that try to blend both content and media part with the distribution part, because all the preferences can be combined and they can know the users extremely well. They know about the media preferences, they know about the distribution preferences. And actually for the seller it's better because you interact with one organization. So you give them the idea of your product, you create the content and it's everything like one involved all in one shop. So this is the commercial idea that we can not only make money on distribution, not only make money on the content, but make all the money here. So all the marketing spent and all the distribution spent of the seller can go to one organization. So it's really a good thing to grow. And actually everyone is trying to blend and trying to move from the one thing to another. Because if we see the market landscape, we see that the traditional media that own the marketing budgets, they trying to move to the distribution part. So they're trying to move here from the left part to the right part of the scheme because they, for example, started working based on the performance. So you're not paying them for the views or for the number of users. You start in paying for the number of orders created by some ad or some placement, et cetera. Actually it's small, but it's still a move to distribution part. So to understand the transaction, to understand what content gives you better conversion to transactions, not only to the views. And the second example, it's ecommerce. Like the traditional ones, they only sold goods right now. They start thinking about the content, rating and reviews, likes, some content produced by the users, et cetera, everything that can move them up on this scheme to got more like media or media ish than the traditional ones, to combine all business models in one. As I said, when you are building the social marketplace, you have to think about the both words. So you have to be focused on building a good media and you have to be focused on building a good ecommerce. So both things are extremely important to survive your cold start phase and to go through it to the growth phase. So let's start with media focus areas. First of all, when you think about the content, it's all about the orchards. So who is going to produce your content? What's their ideas, how they are going to interact with your platform? Why? Why do they need to work with you? Why do they need to work with you? Not what to the others. Maybe they want to earn money. Maybe they want just the bigger audience. They want to be famous, et cetera. Maybe they already create some kind of a content, but they don't know where to store it. And you can offer them good storage and then maybe reuse it later. So the first of all, you have to understand perfectly who is your authors, what their needs, how it works, et cetera. So it's the first part of your strategy to describe this one. Then as any media, it's the content. What kind of content you are going to work with. Would it be texts or pictures or videos or everything combined, something like the stories, how they're going to produce it? Do they need the special devices for it? Or they can use their phones, or they can voiceovers, et cetera. So what kind of content is. It's not only about the business strategies, because when you start thinking about the content types, you, for example, start shaping your technical strategy, how you're going to store it, do you need the bigger storage or the smaller ones? How much you're going to cost, how much you're going to spend to acquire and to store the content by one author. If you're going to build a video hostage video things, it's much more storage. So it will cost you much more than, for example, if you're working with texts or pictures or you are going to create something on the fly. Right now we are waiting for the AR and VR revolution and new devices. It's much more to store there than the video things. The third thing after the content is distribution, how we are going to move the content from the author to the audience. Shell audience, just subscribe orders or you're going to create a recommendation system or you don't need the subscription. You just ask the interested of the audience and then you push the content there like the TikTok does, et cetera. So this is the major things about the distribution, because again, it's shaping your business strategy, it's shaping your product strategy, and you're shaping your technical strategy. If you're going to create the best in class recommendation systems, first of all, you have to get some data somewhere and then you have to create this machine learning algorithm to create these recommendations. If you're in a cold star phase, how you are going to do it, you still don't have any alters and you still don't have any audience. This is the major things to think about. And the last one, but not the least the audience. Why should they use your social marketplace, how you're going to incentivize them, how you're going to attract them, what kind of user journey, what kind of value they got from your content and how you're going to present yourself for the audience. Segmentations, these four major focus areas. When we think about the media part of the social marketplaces, you have to have answers and descriptions for all the major four parts. And actually you have to prove all the things. So it's a hypothesis. So you have to test it. You have to understand your audience better until you got the perfect strategies to work with later. The second major part, it's marketplaces. And for marketplace in the cold start phase, there is three major focus areas. It's incentives, its flywheels and its density. Let's start with the major one, with incentives. Actually you have to think about the potential user CGM in the real world, because right now they already do something, they already produce some content or not, they already live their life, they already buy some products. And you have to understand in what part of their lives your product will be fit in, what moment of life there is the peak value for them, how you are going to interact with them in terms of the marketing, how you're going to catch them, what would be the wow moment, how it affects with it. And when we speak about the CGM, it's not only about drawing the process and understanding the audience, it's about the creation, the value proposition that is relative to competition. So it's not just the value proposition will give you the money or will give you the audience likes, et cetera. We always have to think what is the competitor's proposition? And when they say about the social marketplaces, it can be anything. It can be reading a book, it can be playing with children, it can be going to a walk. Everything that consumes time, that is time that not spent on your product. So when you create this potential user of CGM, you have to ask yourself, what would be my value proposition for them relative to the competition and the last part of the incentives? It's the right segment. And in my understanding, the key here is to start with the segment that are somehow underserved by the current players and by the competitors. So maybe you can create the video marketplace for those that cannot using the YouTube and TikTok. I don't know why. Maybe they don't have the media literacy, so they don't know how to create a video or they don't have the proper device and you can create the machine. Learning that, creating a video from the voice. So I just call the phone, say some words and then video appears. This is the segment that is underserved by the current players. It's really the cool thing about the incentives, because when you're trying to compete with the current audience, it's extremely difficult to persuade them to switch. Let's say you're calling the major YouTube blogger with the major money coming from the YouTube big audience and say, well, we are startup, we don't have any audience right now, but we really like you and we want you to move from YouTube or at least to copy your content to our small and unknown company and unknown product. Actually, I think that would be some kind of problems with this conversation. If you find out someone who is not on any big platform right now and who is creating his content with you and growing with you, actually it's not only about the attracting them, it's about the retention. Because when they started growing with your platform and they created the fortune together with you, you really stick with them. They are emotionally stick and they are like economically stick with your product. After we understood the incentives for all groups of people, it's really important to think about the flywheels. When we speak about the content of any type, usually supply more important than demand because supply sticks longer on your platform. You can reuse it in different things, in different ways. You can test different ways of interacting with the content. So for example, different distribution mentioned on the previous slides for the same piece of content. You can reuse it, recut it somehow. If you somewhere create a demand but you have zero supply, you just burn your money and your efforts. So the major things it's to start with supply. If you are going to start with demand, you have to find the right explanation to yourself and to your team why you are going it and trying to test it before. After you understand how you're going to get the supply. Actually to create a proper flywheel, you have to create the multiple gross loops stacked upon each other. So what do I mean here? Let's say we understood that we find out the core audience and the core type of content and they uploaded the first piece of it, the first video, let's say maybe we can motivate them to share it outside the platform and to invite some audience, maybe friends, maybe family, maybe business partners, et cetera. The process should be extremely easy for them and the motivation from the incentives part should be clear and clear for them. Let's say we created this first growth loop and we attracted some kind of audience that trying to interact with the content. We have to think about the second growth loops stacked on top of the first one. Maybe it's a sharing, maybe it's some kind of a competition or a challenge. So when you see the video, you have to recreate it by your own. We have to give some tools to do it easily, et cetera. So the more growth loops we stacked upon each other, the better fly will swing up. Why? It's important because we have to build the network effects. All marketplaces are based on the idea that the more audience gives you more value of the product. If you take YouTube, everyone is creating the video. You can create video on anything there. So even those who use YouTube for free, they not pay anything and they produce not much views. They still produce the value for YouTube because it fits for the recommendations, it's improving for the search engines. So you have to think about what would be the network effects after I invented and started interacting with the first types of audience, with the first customers. And when we think about the network effects, here comes the third major things. It's density. Because when you took any kind of marketplace, almost any, it's not the same unified thing as we can see here in the picture. There is some different regions in this city, and some of them are quite dense and some of them are not. So each marketplace, it's a combination of isolated submarkets. If we speak about the content, the first one is a language. If you are creating content that needed to be understanded, like it's a text or a video with voiceover, et cetera, or some memes with text, it has to be understanded. So you got the submarket based on the language. The second type, for example, is the thematic. So if you are going to create some content about the cars, it is. If I'm not interested in cars, it would not be my content. If you are going to create some content about, I don't know, the math or the chemistry or anything else. This one, the submarket. And you have to understand its size. And you have to understand, are you dense in this particular market? So, for example, english videos about the chemistry, it's quite well articulated submarket. And if you got new suppliers and new content creators, which is creating the videos about the chemistry, but in Japanese, they are not creating density for the submarket, they're creating for the different ones. So you cannot measure it on average. You have to measure the density on each submarkets and to achieve it on the first phase, when we are on the cold start, we don't have much audience there. It's really useful and really easy to focus on some selected submarkets and experiences there. So try new things there and see is it work or not? And after you find some good mechanics about the content, about the orders, about the distribution or the audience, you then after you test it on some small things, you can move it and scale it to grow markets around it. This thing, you have to understand it so you can create the same product in terms of features and values, how they upload content, how they like it, how they comment it, et cetera. And it can be universal. But when we speak about the marketing, when we speak about the partnership, how we are going to attract the audience, how we are going to incentivize them, this is right place to think about the submarkets and to focus your marketing and your partnerships efforts. Well, if you want me to conclude? How to survive the cold start phase. When you're building the social marketplaces, there is three major things. First, find right incentives. Until you got right incentives for your audience, it's useless. Then after you find right incentive, this kind of incentive have to start the flywheels start and produce spinning. So you have to think about the features, you have to think about some characteristics of your product that not only intensifies people to come there, but to attract new users and to create growth for you that is not driven by the paid marketing, but driven by the users itself. And at the end, you have to increase density by these flywheels in focus submarkets. And one by one, you can close the markets on the density level that you're okay with, that your possible investors, okay with your team, et cetera. And then it started growing by itself. So, thank you.", "words": [], "utterances": null, "confidence": 0.946015189836443, "audio_duration": 1250.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Today we are going to speak about cold start problem in social marketplaces about balancing supply and demand. It's a blend of ecommerce and social media that allows fetching content and using it for ecommerce needs. If you pass through it, it's really easier to work with growth and the dominance.\n- Social marketplace tries to blend both content and media part with the distribution part. All the preferences can be combined and they can know the users extremely well. Everyone is trying to blend and move from the one thing to another.\n- Who is going to produce your content? What's their ideas, how they are going to interact with your platform. Third thing after the content is distribution. Why should they use your social marketplace? How you're going to incentivize them. Segmentations, these four major focus areas.\n- Usually supply more important than demand because supply sticks longer on your platform. To create a proper flywheel, you have to create multiple gross loops stacked upon each other. It's important because we have to build the network effects.\n- Each marketplace is a combination of isolated submarkets. The first one is a language. The second type is the thematic. And you have to understand its size. You have to measure the density on each submarket. This is the right place to focus your marketing and partnerships efforts.\n- When you're building the social marketplaces, there is three major things. First, find right incentives. Then increase density by these flywheels in focus submarkets. And one by one, you can close the markets. And then it started growing by itself.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.07, "text": "new content creators", "timestamps": [{"start": 1110004, "end": 1111310}]}, {"count": 1, "rank": 0.06, "text": "new things", "timestamps": [{"start": 1143856, "end": 1144362}]}, {"count": 2, "rank": 0.06, "text": "media part", "timestamps": [{"start": 319672, "end": 320546}, {"start": 649488, "end": 650234}]}, {"count": 4, "rank": 0.06, "text": "social media", "timestamps": [{"start": 43788, "end": 44342}, {"start": 55012, "end": 55950}, {"start": 281276, "end": 281942}, {"start": 288730, "end": 289542}]}, {"count": 1, "rank": 0.06, "text": "different things", "timestamps": [{"start": 880892, "end": 882790}]}, {"count": 4, "rank": 0.06, "text": "social marketplaces", "timestamps": [{"start": 28028, "end": 29090}, {"start": 650608, "end": 652006}, {"start": 741872, "end": 742822}, {"start": 1195744, "end": 1196886}]}, {"count": 2, "rank": 0.06, "text": "building marketplaces", "timestamps": [{"start": 83388, "end": 84738}, {"start": 87788, "end": 88722}]}, {"count": 1, "rank": 0.06, "text": "much audience", "timestamps": [{"start": 1133628, "end": 1134930}]}, {"count": 3, "rank": 0.05, "text": "distribution part", "timestamps": [{"start": 321128, "end": 322194}, {"start": 380108, "end": 381062}, {"start": 401152, "end": 402150}]}, {"count": 1, "rank": 0.05, "text": "Shell audience", "timestamps": [{"start": 575430, "end": 576254}]}, {"count": 2, "rank": 0.05, "text": "cold start problem", "timestamps": [{"start": 26796, "end": 27718}, {"start": 79276, "end": 80294}]}, {"count": 1, "rank": 0.05, "text": "new users", "timestamps": [{"start": 1223246, "end": 1223806}]}, {"count": 1, "rank": 0.05, "text": "media focus areas", "timestamps": [{"start": 457188, "end": 458410}]}, {"count": 1, "rank": 0.05, "text": "offline media", "timestamps": [{"start": 194288, "end": 195194}]}, {"count": 1, "rank": 0.05, "text": "more value", "timestamps": [{"start": 994000, "end": 994698}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}