{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/a7cb7ac6-9ecc-4b3e-b31e-556175d3bdc0", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["accelerated accessibility", "believes", "bottom", "brings", "business", "cam beaudoin", "care", "companies", "conf fourty two", "conversation", "disabilities", "facts", "leaders", "persons"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "4906073b-f4ad-4052-bda3-b9e648067111", "status": "completed", "error": null, "text": "Um, hello, everyone at Conf 42. My name is Cambodwai and I am so excited to be speaking with you today. Today we're going to be talking about how to build a sustainable accessibility program without wasting a ton of time and money. And really, that this is a smart business conversation. Let's get started here. Look, I'll be the first to say disability and accessibility. Disability, inclusion. It's hard, right? Even that word disability has some weight to it, some connotation, and it may make people feel uncomfortable on the inside. I want to say that's okay. That's normal. It's not a bad word. I think that's something that we all kind of get stuck on, right? We just shouldn't even know if we should say the word disability. But the truth is, it describes somebody, whether it's acquired over time, something like a stroke or a car accident. Disabilities may be acquired in many ways, or it's something that you're bored with. Maybe you had the cord wrapped around your neck as a child when you were born, or you were born with an extra chromosome. It's part of someone's identity. It's kind of like being short or preferring video captions or having glasses, which, by the way, is a disability as well. It's okay to feel awkward or cautious or maybe even ashamed when you're thinking your private thoughts around disabilities. That's normal. We don't talk enough about it, and we don't want to offend people in our daily lives. We don't want to say the wrong thing. And that, my friends, means it comes from a good place. Ultimately, though, it is that self consciousness that keeps us from asking the right questions and therefore creating an unconscious bias and exclusions towards people with disabilities. Plus, nobody in our society really talks about disabilities, right? We normally don't learn it from our parents. We don't talk about it at school, we don't go to university and have classes on it. And plus, our HR departments don't talk about it either. So my goal for this presentation is to help two types of people. Number one, if you are brand new to accessibility, if you've never heard of disability inclusion before, I want to spark some curiosity inside you. I want to talk to you about what the future could hold and what maybe becoming a champion inside your organization would entail, and the possibilities that could come from that as well. Number two, if you already know a little bit of accessibility, if that's something that your organization has already started, or if you yourself are a champion inside that organization, I want to teach you a little bit of implementation techniques and how to accelerate your plans going forward. I want to know what's holding you back from creating a successful program. Let's get started. All right. In and over the next 45 to 60 minutes, my goal is to get you to believe that a proper accessibility program is the key to being a differentiator in your market. And I'm going to show you how we can do that with a framework that will make it straightforward and simple to understand, easy to achieve that result. And now I'm really lucky. In the past nine years, I've had some amazing opportunities to research and run and practice accessibility programs within large organizations like IBM, to speak at conferences, major accessibility conferences, even like CSUN, and go and help large organizations as well coach their teams and employees who are already in the accessibility programs like VMware. So I've been hosting a weekly podcast, Vodcast called Normalize it, which speaks to the business of disability, inclusion and accessibility. And I teach and coach people on the same topics as well. But I started off much like everybody else, right? I was ignorant, totally ignorant towards what accessibility is, even how to spell it right? Because everything for me started with the handshake. Back when I was at IBM, I was brought in as a junior developer to go work on an accessibility project. We had a large banking organization who had hired us to do something. Right, the typical analogy, nobody gets fired for hiring IBM, right? In this project we had the client who was doing a lot of analysis and a lot of testing for accessibility. We wanted to get on top of that because it was unacceptable for us to be releasing a product that had bugs contained with it. There was a little bit of embarrassment. So I was brought in and I read something called the web content accessibility guidelines, the wikag for short. And this thing, when printed out, comes out to about an inch thick. It's not a small document. I read this, I was going through, I learned about it, and I started to build accessibility into our product. I started to fix those defects that the organization thought were the first ones to fix. What was interesting, though, is I'd never actually met an end user who would benefit from my work around accessibility. That wasn't until I met my friend Tom. Now it's important to know that Tom is blind, and he travels around different IBM offices to go and teach people about accessibility. When he finally arrived at the Toronto office, my boss, who was a suave, kind of ex salesperson type, have you ever had a boss like that, right? Walks around the office with a popped collar. I know you have. I know you have. And he walked up to Tom and his a type personality and stuck his hand in Tom's face and said, hi, tom. My name is Jim. And there was this stare down that happened because my boss, Jim, had his hand stretched out, and Tom didn't even know that hand was outstretched. I think I died of embarrassment. I ran back to my desk and I walked, opened up YouTube, and typed in how to shake a blind person's hand. And it was really at that moment that I realized that this is all about people. Our products, our tools, the things that we build, the things that we work on are really only out there to benefit people, right? We want our product and service and technology and apps and all these things to be used by as many people as possible. It doesn't make any sense for us to build something that only works for a certain subsection of the population. And by the way, if you ever want to know how to meet somebody or greet somebody who's blind, you can just say, can I shake your hand? And that'll cue them up to extend their hand, and a connection has been made. And if I could just make people see, if I could just make people realize that people with disabilities care real people, right? Then we would start to do this automatically. If we could take out that uncomfortableness, that discomfort in thinking about disabilities, then this, all of a sudden would start to become natural. So the lesson here is that it's okay to talk about disability, it's okay to ask questions, it's okay to be wrong, and it's also okay to learn. So at that time, I started to work on a framework, because in Canada, here, we are still so much very compliant and regulatory based in Canada. If you work in Canada, or if you sell products to Canada, you must comply with something called AOTA, the Accessibility Frontiers with Disabilities act. I'll get into a few more details as we go through the presentation, but I was starting to be invited to all clients who had regulatory buy in. That means airlines, that means banks, that means insurance companies, transportation organizations, things like that. They were starting to look for an accessibility tilt to their projects. So this actually carried me throughout my IBM career. I started to build a framework on how to apply a repeatable process towards accessibility. So here are the three secrets to accessibility success. Number one, stop the guesswork. How to make accessibility simple to understand, quick to adopt, and easy to implement in as little as eight weeks. So what does that mean? What if you were confident to take the next step on your journey? And took out all the guesswork that comes with starting a new initiative and were just given the right tools and the right vehicle to get moving in the right direction. That's step number one. Number two, make you say, wow. How a culture of dignity and delight keeps your best talent and employees. What if you implemented all the best outcomes from companies like Intuit and Netflix, PepsiCo, Walt Disney, VMware, Capital one, Accenture, Slack, Mattel. Yes, even Barbie has accessibility features and recognizes that disability inclusion matters. Really, the list goes on and on and on. And you create an organization that focuses on disabilities inclusion and gives people right. People and clients, employees that truly great experience. Get your people to say wow. Number three, a $13 trillion market. That's right, trillion with a t. How the world's best companies are leveraging accessibility and winning because of it. What if you could establish a unique marketing position that grows revenue and makes you stand out from the crowd? Because your competitors are not doing this, by the way, and it could highlight some of the best efforts that you've made and opens you up to an entirely new market. All right, secret number one, let's stop the guesswork. How do we make accessibility simple to understand, quick to adopt, and easy to implement in as little as eight weeks? All right, so remember I told you a little bit about that framework that I developed while I was at IBM and started consulting with other organizations? Well, how do we start to apply this in a repeatable way? So, take out your pens and paper, because I'm going to walk you through this framework. I call it the accelerated 180 framework, and it's going to help you out with a bit more of a step by step process. All right. First, though, got to take a few steps back. Whenever I show this slide, people always ask me, like, why do you have pictures of two senior citizens on there? Well, as we go through life, we start to acquire disabilities right where we need glasses. Arthritis sets in. We're not as mobile. We're confined to our homes. Or maybe we have cognitive impairments or disabilities that start to accumulate over time. This is normal. This is natural. This is part of being human. So when I was the accessibility lead for IBM Canada, I was working on a project for bank of Montreal, BMO apparent Canada. And accessibility was always kind of approached in a haphazard kind of way, an ad hoc kind of way. BMO blanket Montreal, at the time, had purchased an accessibility audit for some of their programs, some of their applications. And can you imagine if you're a developer and all of a sudden you get slammed with an excel file that has 800 defects on it, and they just didn't know how to figure it out. There was no implementation, there was no process, there was no structure in how to tackle that and how to work on it as well. And it sucked. I went to the 33rd CSUN Assistive Technology conference. That's down in, well, that was in San Diego, now it's in Anaheim in 2018. And I actually spoke at that conference as well on colorblindness. But what's really interesting is that gathering of so many other accessibility professionals I got to meet and chat with, talk to learn from chief accessibility officers, from some of these large organizations that I previously talked about, including though, like Microsoft and Hilton, Slack, Adobe and Walmart. And these are all organizations that are leading the charge for accessibility programs inside their organization. And it's amazing. There are a lot of similarities between all these organizations and how they tackle and apply accessibility. One of them, for example, is this hub and spoke model where you have a centralized team for accessibility in the organization, and they tend to, in quotes, loan out their professionals to different parts of the organization. Now, that works really well for large organizations, maybe that's not you, but even for smaller organizations, having one, two or three champions who can go and consult and are passionate about accessibility, are passionate about helping people and disability inclusion, and they could be brought into other projects throughout the organization, be it for HR or development or procurement or any of these other types of processes. And what's nice about this is that once you start to study and research all these different patterns, a path and a plan tends to be laid out in front of you. So what is the framework itself? So let's go through some of these, and I'll talk about each point as I go through. So, number one, if you're going to apply accessibility inside your organization, you need to know your current situation. Right? What are the laws and regulatory considerations for your projects? I talked a little bit before about AOTA accessibility frontiers with Disabilities act. If you do business in the province of Ontario, up here in Canada, you must be accessible. Furthermore, there is the Accessible Canada act, the ACA, which is really coming into effect in 2035, and that's going to have a much higher prerogative for accessibility throughout the country. Next up, having an assessment, a maturity model assessment, to understand every part of the business, every part of the organization, to understand where they are in terms of accessibility. Now, you may only be focused on products, and that's okay. Are there checks and balances? Are there gates involved in checking the accessibility for each part of your process. That is all kind of considered in a maturity model. Identify DEi initiatives. Now it's pretty amazing when I start to talk about DEi, that this is the perfect place for accessibility to sit inside. Many people even will change DeI to idea Ida, and the a includes accessibility in that conversation. It's 2023. If your organization doesn't have a DEI initiative, they're way behind the pack. Like, we've got to get moving on that first. This current situation starts to form the framework, starts to form the baseline towards what you can be working towards, because there's no sense in shooting out in all different parts of procurement. Let's go find some tools. Let's go do these tests and audits if you don't even know where you currently are. Next up, where's the destination? Where are you trying to go? Let's define that future state so you can understand exactly where your organization wants to go and where it should be. Now, every single country in the world has different laws around accessibility. I talked to them a little bit earlier on when I talked about laws and regulatory if you're in the US, which you most likely are, section 508 is something that you need to pay attention to, as well as the ADA, the Americans with Disabilities act. These both outline certain criteria and regulations and guidelines as to how to make your software, your technology, and your organization accessible for more users. You should be deciding on stakeholder reporting as well. And I really believe that this is where a lot of people get stuck. They don't realize that stakeholders, executives, c suite people, they need buy in and they need reporting. They need to know what's the business benefits of it as well. So you should be deciding on that early on and getting feedback from that leadership team to understand what they want to know about what they care about as well. And also building that coalition. You can find people inside your organization, peers and colleagues and allies to help you as you're moving forward in the organization, to get your team members and the rest of your organization to realize that they're not alone in doing this. And finally, secure that buy in. Prepare that executive presentation. Don't just go in there blindly. Pull in and get buy in a little bit beforehand. Go for a soft close. Have conversations with your leader, your engineering team, your directors, your vps of product engineering, maybe even HR, to kind of understand and get an idea of where that presentation will land and who care the best people to apply that for. And this, by the way, can be applied anywhere. There's no sense in starting an initiative. If you don't get a little bit of prior buy in before that, you want to make sure you gather your timelines. Be very realistic. Smaller organizations are a lot more agile, as we know. You don't need meetings to start meetings. As anyone who's in a larger conversation knows, your timeline really needs to be thought out. Well, I usually plan for a six to 18 month rollout whenever I'm talking about this framework, and that is tends to be a nice idea. But it's really important to know as well, accessibility work is never done. Finally, start to focus on a single measurable outcome that you can do. There's no sense in calling and saying that we're going to make the entire organization accessible. That's very difficult to do. That is not really even a final goal. We can really hone in on one specific part of the organization. We can say in twelve months our HR department will incorporate accessible hiring practices. Or maybe our CI CD continuous integration deployment pipeline will include some automated tools to check for accessibility, and we're going to reduce that defect count from whatever, 300 down to 80 within the next six months. That is a measurable, attainable goal. I know what you're probably thinking. This sounds pretty expensive, right? For time and money to implement. And not going to lie, that's probably correct. Every project, every new initiative costs time and money. But I want to talk to you about the alternative. What if you didn't do this? What if you didn't apply this? What if you didn't start to consider this now? Have you ever heard of Target? Of course you have. If you're in the US large box store, right? Sells lots of products. In 2008, they received a class action lawsuit because blind users couldn't use screen reader technology, and they claimed that they wanted to acquire the same information and engage in the same transaction as are available to cited use guests with substantially equivalent ease. Now that's a pretty loaded statement. Basically what it means is that we want equivalent access. We don't want barriers or blockers or any kind of blocks to access the same things, right? Even the checkout wasn't possible. You can imagine you're trying to buy something, you add things to the cart, and then finally, just before you're ready to purchase something, you hit the submit button, you hit the buy now button, and that buy now button doesn't work. That's how frustrating would that be? So the suit against Target was first filed early in 2006, and that Baltimore based National Federation of the Blind, which claimed that Target contained thousands. That's right. Thousands of access barriers, making it difficult, if not impossible, for blind customers to use. That's bad. It was a $6 million lawsuit. That can get pretty expensive. So what was the action here? They built an accessibility program. Without this plan, without this rollout, none of this would have worked if they just started to audit and figure this out. Well, you don't even know where you are. You're not involving the community. You're not getting feedback from users who will benefit from that fix. The program manager, who, by the way, I met at that CSUN conference in 2018, he was talking about how he had to hold off lawyers on one side, had to hold off lawmakers on the other side, had to hold off his managers and his stakeholders on the other side because he didn't want to just do a bunch of stuff. He wanted to roll this out with thought and clarity, because without a functional plan, they never would have achieved success. And now Target goes and speaks at CSUN. Target goes and talks about their progress towards a more accessible, equitable, inclusive organization. And now, look, they're even using it as a benefit. Up on screen here, I've got their bullseye view, which is their corporate website, and it talks about how Target's inclusive costumes are back with double the Halloween fun. This is reality. This is real life. Here, look. They now have an accessibility plan. They're committed to a web content accessibility guidelines, a Wakag standard. They work with advocacy groups, they work with people who are users of their products. They have an accessibility center of excellence, they have an accommodation policy, and they're an inclusive work environment, which, by the way, talk about a little bit more about that afterwards. Secret number two, make you say, wow, how a culture of dignity and delight keeps your best talent and employees and clients. So I used to not know about or care about people with disabilities, either. All right, I'll be the first to admit that. Before 2014, before I joined IBM, before I started to pay attention to this, I was totally ignorant towards the world of disabilities as well. I didn't have any family members who had a disability. I'm colorblind, but I never really thought of that as a disability either. But with just a few adjustments and few small changes to my mindset and approach to accessibility, I didn't only make this easy, but I made it fun as well. Right? If I could just get into the habit of questioning what I did before I released something, just for a moment, thought of if I was in a wheelchair, would I be able to access this if I had a heavy cognitive load which, by the way, I don't talk about it very much in this presentation, but in other presentations, I remind everybody that we've all experienced a disability at some point. If you're walking outside when the sun's shining down on your phone and you can't read it, yeah. You've become temporarily disabled to booking a flight or checking your transit times, things like that. Or if you've had a heavy cognitive load, you're worried about things at home. You just had a baby. You haven't slept very much, by the way. They've even done tests to show that you can be drunk. And that's pretty much equivalent to the mental state of someone who is extremely tired. So you have no doubt been disabled at some point before. So what if we could just think of people like that? What if we could just acknowledge that one day we will all also be permanently disabled through just age related disabilities and we can start thinking about that a little bit earlier. Why would it be a problem to think about something at the end? I mean, that's really where a lot of our problems start. When at the end of the project, we're going to go submit code, we think our project is done. Then all of a sudden accessibility comes in and says, well, you didn't do this, you didn't fix that. That's a feel bad. So lessons to you all, think about this a little bit earlier in your projects, in your processes, and in your deliverables, because then you won't have to worry about this so much at the end. Look, if we can just get people excited about doing the right thing, then disability, inclusion, accessibility becomes natural, it becomes simple and becomes easy. So really we're talking about breaking and fixing. There care only two reasons that people and companies fail at accessibility. That's it. Number one is attitude, number two is expertise. That's it. So what I do when I go and help organizations, I help them decouple this negative attitude towards accessibility, right? And again, a lot of these are just natural thoughts. This is boring, right? Developers say, I just want to do my own thing. Stop trying to tell me how to write my code. This takes too much work. It's not going to work. And especially this is difficult when a developer takes designs, takes patterns from a designer, and those haven't been made accessible either. And the tester comes back and says, hey, you didn't make this work. He's like, I didn't even make this. I'm just following what was given to me, right? We don't talk about those disabilities and thoughts of like who cares about this doesn't really benefit anybody. Instead, we need to decouple and break all those have conversations around what that negativity is so that people realize that they're not alone in those thoughts. And I start to attach it to positive ideas of opportunity, things around social justice. We want to live in a world where justice is right. We want to live in a fair and equitable environment, fair and equitable organizations and society as well, right? Many people who care about accessibility, many people who think about this a little bit earlier and are accessible professionals do this because they feel like they take a stand. This is the right way to do things. This is the best way to do things. And it is simply the right thing to do. Right. We can build a better code base. If you're more an engineer or product person, if you are building something with a standard which is following the HTML standard is 99% of the problem. That's it. If you start to follow that standard to the t and not add create buttons that are made of divs and things like that, you care going to create naturally a better code base and a better product for people with disabilities to use, right? And not thinking about only that I'm doing this for someone other, that we're doing this for ourselves, our future selves. If we want to continue banking using the same applications that we're currently using or run and use the products or services that we currently use, we got to start thinking about this a little bit earlier as well. Number two, around that expertise, removing those knowledge barriers. Accessibility can usually and often think of this as this ambiguous, amorphous, nebulous kind of target. I don't know where to go. I'm not sure exactly where to proceed with this. I don't know where to get the knowledge. I don't know where to get answers. This person is telling me one thing, this person is telling me something else. What do I do? Right? I'll admit this work is complicated and it can be nebulous, ambiguous as well. So we need to attach that to knowing exactly where to get that knowledge. Building internal knowledge bases involving people with disabilities to get their proper feedback on the products that you're building. Because then you'll understand exactly what it's like to have somebody use your product. It'll start to make you think, because we need to start to make this availability. You need to know exactly where to go, who to listen to, where to get more information. So around that idea of clarity, getting clarity of exactly where to go next is really, really important. And again, I know what you're probably thinking, again, okay, but who is an example of someone who builds this at scale? Well, intuit, they own turbotax, credit karma, Mint, QuickBooks, Mailchimp. Right? 100 million customers, both individuals and organizations. Small businesses, self employed individuals, not a small company. This, what we're talking about here, is the same problem that Intuit was facing back in 2015. So the chief diversity, equity and inclusion officer, she even has in her statement, which is right on the Intuit website, underrepresented groups. And that is exactly what people with disabilities are. It's really difficult when you have a statement such as this and such a strong inclusion statement on your website to not care about accessibility. I would challenge you. I would challenge you to go and look at your corporate company website and see if there's anything on inclusion there. I will bet you there is. I'll bet you there's a diversity group. I'll bet you there's groups for families or things like that. It's 2023. Organizations are paying attention to this. Accessibility goes hand in hand with DEi. So what did they do? The global accessibility and inclusion design leader for Intuit, his name is Ted Drake. He needed this built in a certain way. First, they built it into their tech, they put gates into their processes so code can't be released. They included it into their design systems, into how they write text on there. And as you can see here, they have this even posted on their website as well. I love this accessibility inclusion. And if you look at the four links below, we've got accessible content, we've got alt text, antiracist language. Inclusive content readability is down there as well. These are all guidelines on how to create better experiences for, again, clients and employees alike. They built it into their culture, which speaks to this. And again, now all this culture of belonging and all this culture of evolution is all on their website, available to read. And they've made it public. They've made this absolutely public on how to make their organization better. They went from three people caring about accessibility to now over 1200 accessibility champions inside that organization. It's really hard to not care about accessibility when everywhere you look, there's someone else who cares about accessibility. That's called pervasive and that's called a pervasive organizational change. It's pretty cool, too. Intuit made it okay to talk about up on screen, I've got a picture of the Intuit CEO, Sassan Gudarsi, and he talks about the mission to power prosperity around the world and doing things for their customers, that network of 1200 accessibility champions, it really goes beyond compliance. What we're really talking about here is the future of work. What kind of organizations do we want to be a part of in the future? Do we want to help build? Look, they didn't say we want to give wealth or increase wealth or things like that. They talked about powering prosperity. And prosperity means different things to different people. And he didn't say just to some customers or a small segment of the population. He said our customers, all customers. Accessibility is part of the daily conversation across the company at Intuit, says Ted Drake. And when you can start to have this, you can start to really start to change the way that your organization evolves. And by the way, they're not perfect. Accessibility, like everything else, it doesn't matter what you're doing, whether you're implementing a new Javascript framework and stuff like this, the work is never done and we need to stop thinking about this is a one and done exercise. They recently hired an intern who is deaf, and he talked about how there were no captions on any of the onboarding videos. Well, they got that fixed. And this is valuable feedback, having that conversation and not being afraid to give that conversation. This really is a two way street. All right, secret number three, this is a $13 trillion global market and how the world's best companies are leveraging accessibility and winning because of it. All right. I used to also think that accessibility was just a nice to have. Even when I just got started and I was doing some of the development, I was fixing those bugs. Many people would come to me and say, this is just nice to have. There's no business benefits to considering accessibility. And at that time I didn't really see any other company either. Large know, maybe there's some nonprofits doing this, or maybe there's the organizations like the Canadian National Institute of the Blind, the CNIB. Maybe they cared about it. But why does that matter to large organizations? Well, once I started to learn more about these opportunities, once I started to dig in a little bit deeper, I found that there's lots of organizations who were doing this and they were winning clients because of it too. They were using this as a differentiator on how to use a marketing term or how to set themselves apart. By the way, the US Office of Disabilities Employment Policy categorizes persons with disabilities as the third largest market segment in the US, after Hispanics and African Americans. The discretionary income for persons of working age with disabilities is $21 billion. And that's greater than the african american and hispanic segments combined. Now that's a market opportunity. We can be differentiators. We can stand apart from the crowd, and this becomes a positive feedback loop that works for us and defends us also in the future against legal battles. And by the way, if you're an individual contributor, maybe you don't manage a team, maybe you don't really have any bind with the stakeholders. That's okay. You're part of this conversation too. You yourself can make this part of your own work. Become that differentiator, become essential. I've survived layoffs because I've cared about accessibility and I was the only one who did. I was that expert and that became my differentiator. That's how I became essential. So distinguish and differentiate. Market growth opportunities do exist for people who care and organizations who care about accessibility. They care access to a broader market. One in seven people have disabilities around the world. This is not a small number. They have access to innovation and talent. Also talent retention. If your best talent understands that they belong in the organization and there may be people who you don't even know have disabilities inside your organization, someone may be sitting next to you right now and they care. Neurodiverse, that may be you as well. When your organization cares about people, when they start to incorporate these types of things, naturally your best talent will want to stay and you'll attract better people as well. Once you start to fix things like the job application process, there is opportunities to identify lost revenue. Selling into government requires something called a VPAT. If you sell a product, a voluntary product accessibility template, this is just a self assessment, a self testament to the facts that you've assessed your product for accessibility and you can sell towards government now. Also, higher education is now requiring a VPAT in many snares as well and larger organizations. I know the bank that I just left recently, they would ask for a VPAT as well. You're not allowed to apply to become a vendor towards this organization unless you have that in hand. We talked about this a little bit about some of the risks around compliance and brings like that, but really understanding that risk assessment, what are the laws, what are the penalties, what are the fines involved? If you do not comply, this starts to hurt your bottom line. But finally though, and this is my favorite one, plan your success story, right? Your opposition, your competitors are not doing this. Stand apart from the crowd and like I said before, use this to focus on your career as well. You're probably know this probably isn't worth the effort. There's no business gains for accessibility. There's a small company that puts a lot of effort towards accessibility. Microsoft probably heard of them before. Satya Nadella, the CEO of Microsoft. His son was severely disabled with cerebral palsy when he became CEO. This truly was a top down driver from the top to care about accessibility. As a result, Microsoft president Brad Smith prioritized accessibility across all products. He funded the AI for Accessibility program as part of Microsoft's AI for good initiative. That is a $25 million investment over five years. That is not a small chunk of change. Look at this. What the heck is this thing? This is the Microsoft adaptive controller. And you start to see these cool little brings that come out of Microsoft. Bryce Johnson is an employee. He invented this controller, and if you want to know a little bit about this, it's almost looks like a tablet. It's got two large buttons on it, a and b buttons, a dpad, but there's a bunch of icons near the top. And what that is, is those are all inputs you can plug in, plug and play devices of your own assistive technology. There's buttons and tabs, sip puff devices just like they sound, eye tracking. They can all go in there and create the inputs for Microsoft. For the Xbox. That's really cool. They've got seeing AI, which uses computer vision, can speak the text as soon as it appears on screen, can even identify color. They've got automatic captions for teams. They've got accessibility checkers on all Microsoft 365 products. Accessibility features an edge. I know a lot of people are like, who uses edge? But fact is, when you start to think about an organization like Microsoft implementing accessibility into all their products, they've got a differentiator. I'm just going to show a quick video. This is a Microsoft video. My name is Grover. Sean. My name is Ian. I'm Taylor. My name is Owen, and I am nine and a half years old. So Owen was born with a rare genetic disorder called Escobar syndrome. He's had 33 surgeries to date. I love video games, my friends, my family, and again, video games. It's his way of interacting with his friends when he can't physically otherwise do it. What I like about the adaptive controller is now everyone's companies. You can just say, all right, that's that button. That's that button. That's that button. Perfect. One of the biggest fears early on is how will Owen be viewed by the other kids? He's not different when he plays. No matter how your body is or how fast you are, you can play. It's a really good thing to have in this world, right? When everybody plays, we all win. This is beyond compliance, my friends. This is differentiating yourselves from your competitors. I've got a friend at Microsoft. He's the director of product accessibility up here in Canada. His name is Dave Dame and he himself is disabled. He has cerebral palsy and he says, we will all become disabled one day. Just some of us got here first. So, quick summary here, three secrets to accessibility success. Number one, stop the guesswork. Let's plan for and develop for accessibility. Let's create a roadmap towards accessibility success. Make it simple to understand, quick to adopt and easy to implement. Number two, make you say wow. Create delightful experiences for both customers and employees. And finally, number three, it's a $13 trillion global market. Create and stand out from the crowd. The world's best companies are already leveraging accessibility, and they care winning because of it. Nobody wants to be excluded from anything. I want you to take a moment here to think about a time that you were excluded. Maybe it was in the past, it was a party back in the days. Maybe it was an event that you really wanted to go to and you're told you weren't supposed to. Maybe it was a promotion. That's a big one. And I think if we don't consciously think about the exclusions that we create in our own environments, our own products and tools, services, job descriptions, employment opportunities, then we can leave people behind. And nobody wants to do that. I know nobody wants to do that. One in seven people around the world have a disability. And this is from the World Health Organization. And this includes people who wear glasses, who have anxiety, who have long Covid, have experienced trauma, mental health conditions, who have experienced a stroke, who have Alzheimer's, who have heart disease. It's veterans who have PTSD. It's amputees. People, of course, who are born blind, who have become blind over time, people who born with hearing loss or develop hearing loss over time as well. This means that in a group of 100 people, 15 or so care going to have a disability. Something to think about. My name is Cambodwain. I am a disability inclusion and accessibility expert. If you want more information, feel free to scan the QR code up on screen. Right now we can continue the conversation. I help socially responsible people in organizations become leaders in inclusivity by building sustainable accessibility strategies for employees and customers with disabilities alike. You can enhance your brand reputation, increase your customer loyalty and retention, and avoid costly legal consequences, all while gaining a competitive advantage and access to a growing $16 trillion global market. I do a lot of stuff on LinkedIn. Follow me on LinkedIn. That's where I do most of my posting. You can also come listen to my podcast. If you scan the QR code, all the information is there. And with that, thank you so much. Have a great day.", "words": [], "utterances": null, "confidence": 0.954250147037828, "audio_duration": 2595.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Cambodwai: Today we're going to be talking about how to build a sustainable accessibility program without wasting a ton of time and money. He says self consciousness keeps us from asking the right questions and creating an unconscious bias and exclusions towards people with disabilities.\n- A proper accessibility program is the key to being a differentiator in your market. I'm going to show you how we can do that with a framework that will make it straightforward and simple to understand. Normalize it speaks to the business of disability, inclusion and accessibility.\n- If you're going to apply accessibility inside your organization, you need to know your current situation. What are the laws and regulatory considerations for your projects? Identify DEi initiatives. Next up, having an assessment, a maturity model assessment.\n- In 2008, Target received a class action lawsuit because blind users couldn't use screen reader technology. They built an accessibility program. Without this plan, none of this would have worked. A culture of dignity and delight keeps your best talent and employees and clients.\n- Accessibility can usually and often think of this as this ambiguous, amorphous, nebulous target. Building internal knowledge bases involving people with disabilities to get their proper feedback on the products that you're building. Organizations are paying attention to this. What are organizations doing to be a part of the future prosperity?\n- The US Office of Disabilities Employment Policy categorizes persons with disabilities as the third largest market segment in the US. Market growth opportunities do exist for people who care and organizations who care about accessibility. Become that differentiator, become essential.\n- Microsoft president Brad Smith prioritized accessibility across all products. He funded the AI for Accessibility program as part of Microsoft's AI for good initiative. The world's best companies are already leveraging accessibility, and they care winning because of it. Three secrets to accessibility success.\n- That's where I do most of my posting. You can also come listen to my podcast. If you scan the QR code, all the information is there. Have a great day.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.07, "text": "product accessibility", "timestamps": [{"start": 2151974, "end": 2153226}, {"start": 2411252, "end": 2412218}]}, {"count": 3, "rank": 0.07, "text": "accessibility programs", "timestamps": [{"start": 237618, "end": 238886}, {"start": 252548, "end": 253546}, {"start": 745216, "end": 746518}]}, {"count": 1, "rank": 0.07, "text": "accessibility work", "timestamps": [{"start": 1070600, "end": 1071554}]}, {"count": 3, "rank": 0.07, "text": "accessibility success", "timestamps": [{"start": 509028, "end": 510094}, {"start": 2427788, "end": 2428550}, {"start": 2435436, "end": 2436502}]}, {"count": 2, "rank": 0.07, "text": "accessibility features", "timestamps": [{"start": 555684, "end": 556874}, {"start": 2316984, "end": 2317838}]}, {"count": 1, "rank": 0.07, "text": "accessibility checkers", "timestamps": [{"start": 2312932, "end": 2313786}]}, {"count": 1, "rank": 0.07, "text": "major accessibility conferences", "timestamps": [{"start": 243494, "end": 245062}]}, {"count": 1, "rank": 0.06, "text": "sustainable accessibility strategies", "timestamps": [{"start": 2564020, "end": 2565946}]}, {"count": 1, "rank": 0.06, "text": "chief accessibility officers", "timestamps": [{"start": 732652, "end": 734098}]}, {"count": 1, "rank": 0.06, "text": "AOTA accessibility frontiers", "timestamps": [{"start": 829676, "end": 831746}]}, {"count": 5, "rank": 0.06, "text": "Many people", "timestamps": [{"start": 412548, "end": 412974}, {"start": 889664, "end": 890282}, {"start": 1560916, "end": 1561662}, {"start": 1563514, "end": 1564014}, {"start": 1976126, "end": 1976594}]}, {"count": 1, "rank": 0.06, "text": "different people", "timestamps": [{"start": 1899568, "end": 1900362}]}, {"count": 1, "rank": 0.06, "text": "better people", "timestamps": [{"start": 2138850, "end": 2139554}]}, {"count": 1, "rank": 0.06, "text": "real people", "timestamps": [{"start": 440240, "end": 440986}]}, {"count": 5, "rank": 0.05, "text": "large organizations", "timestamps": [{"start": 239408, "end": 240726}, {"start": 248736, "end": 249606}, {"start": 734860, "end": 735858}, {"start": 774584, "end": 775758}, {"start": 1998608, "end": 1999850}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}