{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/ea9912a9-49e6-4950-86f3-efa2886f8bff", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["amber vanderburg", "be", "but", "can", "competitive", "conf fourty two", "founder", "individuals", "limits", "ninja", "organizations", "proactive", "product", "steps", "teams", "the pathwayz group", "unlock", "youre"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "ea3cf970-1186-4bf4-9604-b8260a214bdc", "status": "completed", "error": null, "text": "Are actually going to start off today with a little bit of a game. I'm going to give you about 15 seconds to go around your house and find two major items. See, the first item is going to be something in your household that begins with the first letter of your first name. The second item that you're going to grab is going to be an item that begins with the first letter of your last name. Ready? Go. Okay, let me share the items that I brought with me. See, my first name is Amber, and so I brought an apple because both begin with the letter a. My last name, amber Vanderburg, which is actually Dutch, and it means from the castle. And V was a little bit tricky for me, but I found a vinyl record. So I have an apple for Ember and a vinyl record. Amber Vanderburg. And this is just a fun way to really get to know one another. See, I've worked with teams from all over the world. I'm actually the owner of a company called the Pathwayz Group, and we work with teams all over the world, helping in effective leadership training and team building and strategic human resources. And one thing that we found, especially in this remote time, is that many are suffering from a little bit of screen fatigue. And this is a very practical and fun way that we can get our team members up, moving around and also keeping them engaged, and then also being able to bring back the personality and the relationship aspect of youre meetings. See, it's so important that we are so intentional about building those relationships and having that personal communication beyond professional gap. And this is one game that I really encourage you to use within your meetings to continue to be intentional in building that relationship. Whether it be a fun game like this or a show and tell or telling funny stories or dressing up, these are fun and, dare I say, innovative ways to bring back the personality and the relationship side of our meetings. So I guess we've done innovative problem solving in the first, oh, I guess, minute of this presentation. But being innovative, and you see, innovation really comes down to problem solving. And it's so important in our innovation methods to first identify what type of problem that we're solving. See, if youre looking for an answer, you're probably going to find an answer. But if you're not asking the right questions and clearly identifying what types of problems that you're solving, then the answer that you seek might not be the solution. The answer that you get might not be the solution that you're seeking. So it's really important that we first get specific so that we can get strategic in our innovation methods. We don't want to be innovative just for innovation's sake, we want to be innovative. That way we can be strategic and be creative in our problem solving. What I founder with, working with teams all over the world, is that there are three major types of problems that many teams will solve. The first is to fix or repair can existing system, process or product. And it's in these scenarios that we are fixing something that is existing and that is the type of problem that we're solving that I would really encourage your team to do a causal analysis and really get down to the root cause of what that problem actually is that way. Again, youre can be specific so that you can be strategic in your innovation efforts. So the first type of problem is to fix an existing product, system or process. The next is to improve or build upon an existing product, system or service. And in these scenarios, your innovation methods are going to be a little bit different from fixing a problem. Here you're actually improving upon a problem or you're improving upon a product. And so in these scenarios, I highly suggest a bit of value engineering and identifying what about your product is great now that you can improve upon. And it's in these scenarios that we oftentimes seek to be more innovative and improve upon our products so that we can stay competitive, so that we can stay relevant and we can stay engaged with our target audience. It's for reasons like this that we have an iPhone 5678, ninja ten. We have variations. As our technology is improving, we are seeking to be more innovative so that we can improve youre products to, again, stay relevant and to stay engaged. This method and this product and this process is going to be a little bit different than fixing an existing problem. So the first is to fix an existing problem. The second is to improve upon an existing product or service. And then the third is to create something totally new. And it's in these scenarios that I think of great inventors like Edison and Tesla and Disney that created something totally new and that were very innovative within their own efforts. And so again, it's very important that we identify the types of problems that we are solving and really bring a purpose to our innovation. That way we can be strategic in our innovation efforts. And this really boils down to asking the right questions so that we can identify the problems that we are solving. And this comes in a few different ways. First, I'm very specific in the way that I am asking my question. This isn't a dramatic shift. It's a slight pivot. I'll give you an example. What is five plus five? The answer is ten. But what if I ask the question this way? What two numbers equal ten? By asking this question just slightly differently, I've opened up the doors to more possible answers. Yes, there is five plus five, but there's also six plus four. Seven plus three. Ninja plus one. There's a variety of different answers that we can bring to the table, depending on the way that we ask the question. And then also, I encourage your team to ask a series of whys and whats, and asking it at least three to five times to really get down to the root cause. Again, it's so important that we have a purpose behind our innovation. The more and more I work with teams, I find that the biggest oversight to innovation efforts really is in the beginning and identifying exactly what problem you are solving. So it's important to first identify the problem that youre are solving, and then after you have identified the problem that youre solving, it is so important that we can create an environment where people can truly thrive. Now, this comes from building a type of balance within your team, and balance is going to come in a few different ways. First, it's important that we try to create an environment and take on a challenge that will allow us to enter into our flow state. Now, flow is a concept by a psychologist named Mihai Shishek. Mihai. I think I said that right? And he writes about this concept of flow, meaning that it is important that we try to find a level of challenge that meets our current ability. So if I have a current ability of running a mile, then taking on a challenge of running 15 miles is probably going to be very frustrating for me. It's going to be a little bit disheartening, and I will more than likely not be into my flow state. More than likely, I'll probably give up at some point in that project because it is significantly above my current level. In the same regard, if I am used to running 10 miles and then I run a half a mile, then more than likely I'll become a little bit bored and disengaged and disinterested and not really enter into that flow state either. The key is to find something that takes into consideration our current ability and then challenges us just a little bit higher so that we are challenged and we do feel that challenge, but it also is within our ability. And so that is how we can enter in, really, through our biggest flow state. So it's important, whenever we are creating our environment, that we create an environment that will allow people to enter in through their flow state. The next balance that we can seek within our teams is to create a balance within our existing systems and really creating an environment that has a balance within our framework. And this just means having a balance within the constraints. So we want to clearly identify the goal, we want to clearly identify the problem, and then also clearly identify the framework in which we are working. It is very critical for our leaders to identify the what and the why, and then provide opportunity for ownership within the how, within the processes and the methods and the projects and the roles within that framework. So having an open framework with no constraints at all is actually limiting for creativity. True creativity actually thrives with some constraints, and so it's important that we take that time to identify the framework. Of course, in the same regard, if we go on the other end and provide so many constraints, that can be very frustrating to our team members as well. And so what I would recommend for your team is to clearly identify that what and that why and then clearly outline what the framework is and what those constraints are, and then provide opportunity for ownership within the how. So provide. Seek balance within flow. Also seek balance within your framework. Finally, seek balance within your feedback loops. Now, many of you are within our developers and are within the development industry, and so you know a lot about feedback loops, and especially in youre ideation phase, it is very critical that we are mindful of a balance within the span of time within our feedback loops. So if you are in a brainstorming session and every idea is shut down before it is even fully said, if everything is being criticized directly every single time, then that can actually create an environment where team members are less likely to share their ideas and are less likely to enter into that flow state and less likely to share their most innovative ideas. And so it's important that we have a balance that we are taking in a lot of ideas, that we are, especially in this ideation phase, that we are listening to those ideas, and then having that feedback loop of analyzing the idea after it has been fully, after it's been formated, after it's been vocalized to a certain degree. So it's important that we have a balance within those feedback loops of providing feedback. Yes, we don't want an idea, a single idea, to go all the way through completion and then having a feedback loop, but saying, oh, let's actually analyze this. No, let's still analyze this in the ideation phase, but let's not squash every idea as soon as it is being said. So seeking that balance between getting all the ideas out and then having a balance within the feedback loop. So that's just another area that it's really important to have a balance in your feedback loops to create an environment where people can truly thrive, especially specifically in that ideation phase. So create that environment where people can truly thrive. Now, I began this session by talking about adding the personality and the relationship back into our meetings, especially within our virtual work right now and our remote work teams. And it is so critical that we have a relationship with our teams and that we can truly assess our team dynamics. See, creativity and innovation actually goes through ebbs and flows of individual thought and having time for self reflection and to spend time by yourself. But it also requires time for us to collaborate with other individuals and to work within a team. It is not a one or the other. It is actually both working together. And so it's important that we take the time to assess our different team dynamics, especially within those innovation teams. And you can assess your team dynamics in a few different ways. So I'm going to give you a couple of different activities that we use within our remote teams that youre can actually pause the video right now and you can do, or you can save till later and you can actually do within your team. Now, whenever I am working within a team that is within a brick and mortar institution, everyone is together and physically close. Then I'll have people stand on different sides of the room. We'll stand up, we'll sit down, but we can do something very similar within remote teams. And we can do this through conference calling and through Zoom calls. And the first activity that I do is very simple. See, I'll ask my team members while everyone is in a gallery setting on zoom. If they are youre comfortable. If they're very comfortable with confrontation, to lean towards the right side of the screen. If they are not comfortable at all with confrontation, lean more towards the left side of the screen. And then in a snapshot, I can get a clear idea of my team dynamics, of a very specific aspect of my team dynamics. Other questions I'll ask is, if you prefer phone calls and zoom meetings, go to the right side of your screen. If you prefer teams and emails, go to the left side of your screen. If you are more of a morning person, go to the right side. If you're more of an evening person, go to the left side. If you prefer public praise, go to the right side. If you prefer personal praise, go to the left side. Right. And so I'll go through a series of these questions, naturally very specific towards the actual project that you are working on. But as a leader, this is really powerful. And as a team member, this is really important to know. If most of my team prefers emails and I'm calling on the phone every time, then that might be a source of maybe some frustration or some tension. Or if I'm scheduling all of my meetings in the morning and everyone is more evening people or late afternoon people, then this is a quick snapshot that I can use to help be very intentional in my leadership and time as a team member within my team. And so this can be a really great, very simple, less than a minute to get can idea of the team dynamics within your innovation team and within your organization. That's a really quick way that youre can get those ideas. A second activity that I use within my team requires a little bit more than leaning left and right. See, in this activity, I am going to ask that everybody grab a piece of paper and a writing utensil and I'm going to leave it up to youre to be a good steward of your time. But in this activity, I ask team members to draw as many circle item objects as they can in 90 seconds. So it's very quick. You have a minute and a half to draw as many circle item objects as you can. Ready? Go. All right. If you pause the video and did it right, then well done. If you save this until later, then yeah, I really do encourage you to do that activity. It can be very exhilarating. And one thing that I do within teams is I then ask the team members to, if they would like they can share their results, whether that be on slack, they can share them on Microsoft Teams, Google teams, they can share their results. There are some teams that feel more comfortable just sharing the number of I drew eleven objects. Most people will share what they drew and my bold team members will actually share the pictures. So definitely look at the comfort level of your team members generally there's actually a little bit of all three of sharing the number, sharing what you actually drew and then sharing the pictures. There's a couple of different insights that you can get about youre team dynamics in this activity. See, more than likely you'll have some members of your team that actually drew a lot of different circle objects and they may have drawn 1520 different objects. And more than likely those objects that were drawn are going to be very simple, very quick and not have a lot of detail to them. And in the same regard, there are some people on your team that might have only drawn six, seven, eight different objects, but more than likely, they will be a little bit more detail oriented. And so it's in this dynamic, again, in less than two minutes, more than likely, you can get a snapshot on the ideation process of your different teams, members of those that can think of a lot of different ideas, but maybe not all of the details, all in that moment. And then there are some people that will think more of the details first, including those details even within a time constraint, and there isn't one that is better than the other. It's actually really important that you have both within the team. And so that's a really powerful activity. Again, less than two minutes that I do within teams to get a really clear insight about the type of ideation that my teams members will more than likely bring to the table as we are doing a little bit more in depth ideation for the actual problem that we are solving. This is just a fun activity that we can do within our teams today. The third major activity that I do within teams to really get an assessment of team dynamics is to have my team members pull out an index card or a note card, and on one side write the strengths or the areas of strength that they believe that they can bring to the team. So these are specific to the project, and these are areas that they believe that they will be an asset to the team. And so they write that on one side of the card, and then on the opposite side of the card, I ask team members to write a strength that they really hope that somebody else in the team has. Right. So what's a strength that you really hope there's somebody else on my team that can bring to this table? I'll give you an example using myself. See, my ideation is drawing 20 different circle item objects, but none of them have much detail at all. See, I am more of a visionary type person. I can see the forest, but I don't always see the trees. And so I long for somebody on my teams to help provide that balance of someone that is more detail oriented, that is really good at the follow through, and asking those questions to get really down to those details. And so I always write on the backside that I really long for someone that is detail oriented. And it's in these note cards that you can get a good idea of ways that team members will more than likely complement each other in the same regard areas in which there might be tension and there might be conflict. And it's from these types of team dynamic assessments that I then move in to proactive conversations. Now, proactive conversations is just a very simple conversation in which I go into any teams at the beginning of a project, at the beginning of a new team, or whenever I'm taking on a new client and the conversation goes like this, at some point in this project I'm going to fail you. At some point in this relationship, there's going to be tension, there's going to be heat. And so while the emotions are low now, if you've done, say, the note card, if you've done the note card where you have the strengths and weaknesses on both sides, or the strengths and the strengths you hope someone else has on both sides, then you can even be specific and say, our emotions are low now. But I know at some point my lack of attention to some details is probably going to frustrate you and you not always seeing the big picture and the big vision is maybe going to frustrate me, but the emotions are low now. So let us proactively discuss how we're going to handle that situation whenever it arises. Let us set up a script of how we are going to handle that situation. And this is a really powerful conversation because it does a couple of things. First, it normalizes conflict, which is so important, oftentimes conflict in teams is avoided because we don't want to admit that there was a problem. But by having a proactive conversation, we have already said not only is this normal, it's actually expected within our team. And the second thing is that it is expected and we already have a game plan. We know how we are going to handle conflict whenever it arises. See if you are providing opportunities for ownership within your team. With these opportunities for ownership within your team, there's also greater opportunity for conflict. See, innovation and healthy teams engage in healthy conflict. And with a greater opportunity for conflict comes a greater opportunity for conversations over complacency. Say that again. With an opportunity for ownership comes a greater opportunity for conflict. With an opportunity for conflict comes a greater opportunity for conversations over complacency. And so it's so critical in these times that we equip and prepare our teams to be successful to engage in that healthy conflict. A few years ago, I was actually an academy football coach or soccer coach for the Adidas game day academies and Paris Saint Germain academies in Bengalur, India. To coach widely the first generation of athletes on both an elite and a grassroots level. I coached about a dozen teams, mostly boys with a few girls. And as I joined the team, I noticed that many of our players would come and they would stand on a line, kick a ball, wait for instruction, and they would come to our sessions. They would stand on a line, kick a ball, wait for direction. They would stand on the line, kick a ball, wait for feedback. And while this may have been the most efficient way to teach a skill in a game scenario, it was a disaster. Oftentimes our players would come to sessions and they would stand in a line, they would come to games and they would kick the ball perfectly, exactly the way that we taught them. And then before the play was even over, they would turn to the sideline, to the coach for further direction and feedback. See, they had mastered the task, but they didn't quite understand how it applied to the overall game scenario. And so we were able to transform the way that we were training our players. And so, rather than stand on the line, kick a ball, wait for instruction, we provided challenges. So from here, kick the ball to knock down those three cones, because in order to do that, you're going to have to kick with power and precision. So how are you going to kick the ball with power and precision? Because in a game scenario, whenever you pass, whenever you kick, whenever you shoot, you're also going to have to kick the ball with power and precision. And so youre players tried to find the best way to kick the ball. And from this I saw some of the most heated debates I'd ever seen amongst seven year olds trying to decide if the best way to kick the ball was with the in foot or with the laces. In reality, both ways were right. And so our players were able to expand the tools in their toolbox to be successful footballers. And it was so important for our players to then have proactive conversations because they knew that now they were no longer just standing in line, kicking a ball, waiting for instruction. They were engaging in conversations rather than complacency, and they were having healthy conflict because they were given more opportunities for ownership within their methods and their processes and their projects and their roles. We did that by identifying the what and the why and giving opportunities for ownership within the how. And it's so important that we do that within our teams today. Going to give you one more activity that I use within teams and organizations. See, I challenge teams to get a piece of paper and draw eight boxes. So draw one line horizontally and then three lines vertically. I'm going to give you a challenge. See, again, you can pause the video now, or you can do this with your team after this session, but I challenge you to set your phone, set your watch to beep every 15 or 20 seconds, depending on what level of challenge youre want to take on. So you have your eight boxes, and I challenge you to draw a different picture of a dog. All right, draw a different picture of a dog. See, I was working for a veterinarian clinic, and they had a dog as a mascot, except the dog was not smiling. It actually looked like it was frowning a little bit. But the customers, they did not like the frowning dog, but they loved the fact that it was a dog, and they loved the fact that the dog had floppy teams. And so I'm going to give you two minutes, 15 seconds per box to draw a picture of a dog on each box. As the timer beeps after 15 seconds, you immediately move to the next box and you draw another dog for 15 seconds. As soon as it beeps again, you go to the next box, and we do this over and over and over again till we have eight boxes ready. Go. Okay, either you pause the video or you so welcome back. If you pause the video or youre doing this at the end of the session. See, in this situation, we now have eight different pictures of dogs. I will use different scenarios depending on the problem that we're solving here. We are fixing a problem so we know exactly the purpose behind our innovation. But you can use this for design. You can use this especially on front end development of designing new products, coming up with effective ways to solve different problems. You can use the a box challenge, usually within my teams. I will then challenge team members to place their pictures or their a box within a slack channel or within a collaborative channel, so that you can then start threads to make comments on what you liked about certain aspects of different boxes. And you can pick out the best parts of different ideation phases and come up with a better product altogether. And again, it's a very simple way to come up with a lot of different ideas. Depending on the dynamic of the team. I will sometimes give this challenge, give my teams members what we are going to be brainstorming about a couple of days before, because there are some people in teams that like to mole on the ideas a little bit longer. That way they can come to the table with those well thought out ideas while there are other people that come to the table, and they are better at coming up with a lot of ideas very quickly on their feet. And so I will sometimes send that email out early for team members that want to spend a little bit more time thinking about those different challenges that they want to take on, and then we'll take all of the ideas, put them in a collaborative channel, whether that be Slack or Microsoft Teams or whatever collaboration software that you use or method that you use to share all those ideas all at once. And that's a really simple way that you can again, first identify the problem, be very clear in identifying the problem, and then being strategic in creating an environment where people can be their most innovative self and then also take into account the relationship side of innovation within teams. See, relationships are so critical within those team dynamics, because if you can achieve youre dreams all on your own, then youre probably not dreaming big enough. It all comes back to relationships. If you want to do something bigger than yourself, then you have to include more than yourself. And we are in a very unique and exciting time right now. You see, in decades past, in recent decades past, our creativity was really born out of opportunity. But in this season, our creativity will be born out of necessity. We have a new season of innovation and creativity within our teams. Albert Einstein wrote that you can't solve a problem on the same level that it was created. You have to rise up above it to the next level. So come on, let's rise up.", "words": [], "utterances": null, "confidence": 0.950180804780872, "audio_duration": 2112.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Are actually going to start off today with a little bit of a game. I'm going to give you about 15 seconds to go around your house and find two major items. The first item is something that begins with the first letter of your first name. The second item that you're going to grab is a vinyl record. This is just a fun way to really get to know one another.\n- Being innovative really comes down to problem solving. It's so important in our innovation methods to first identify what type of problem that we're solving. We don't want to be innovative just for innovation's sake. That way we can be strategic and be creative.\n- The next balance that we can seek within our teams is to create a balance within our existing systems. Having an open framework with no constraints at all is actually limiting for creativity. True creativity actually thrives with some constraints. Finally, seek balance within your feedback loops.\n- It is so critical that we have a relationship with our teams and that we can truly assess our team dynamics. You can assess your team dynamics in a few different ways. Here are some activities that we use within our remote teams.\n- With an opportunity for ownership within your team, there's also greater opportunity for conflict. Innovation and healthy teams engage in healthy conflict. With a greater chance for conflict comes a greater opportunity to have conversations over complacency.\n- I challenge teams to get a piece of paper and draw eight boxes. I will give you two minutes, 15 seconds per box to draw a picture of a dog on each box. Then challenge team members to place their pictures or their a box within a slack channel or within a collaborative channel. It all comes back to relationships.", "auto_highlights_result": {"status": "success", "results": [{"count": 13, "rank": 0.09, "text": "team members", "timestamps": [{"start": 132092, "end": 132678}, {"start": 745008, "end": 745578}, {"start": 818072, "end": 818994}, {"start": 1004068, "end": 1004880}, {"start": 1150420, "end": 1151360}, {"start": 1187468, "end": 1188038}, {"start": 1212906, "end": 1213486}, {"start": 1218808, "end": 1219620}, {"start": 1343232, "end": 1343818}, {"start": 1368696, "end": 1369346}, {"start": 1432876, "end": 1433526}, {"start": 1943846, "end": 1944410}, {"start": 2006388, "end": 2006910}]}, {"count": 9, "rank": 0.08, "text": "team dynamics", "timestamps": [{"start": 923752, "end": 924930}, {"start": 956388, "end": 957834}, {"start": 962116, "end": 962874}, {"start": 1027052, "end": 1028150}, {"start": 1031068, "end": 1032130}, {"start": 1112308, "end": 1113490}, {"start": 1230956, "end": 1232162}, {"start": 1340816, "end": 1341750}, {"start": 2055892, "end": 2056714}]}, {"count": 1, "rank": 0.08, "text": "many teams", "timestamps": [{"start": 263176, "end": 263886}]}, {"count": 1, "rank": 0.08, "text": "healthy teams", "timestamps": [{"start": 1588432, "end": 1589302}]}, {"count": 2, "rank": 0.08, "text": "remote teams", "timestamps": [{"start": 969192, "end": 970254}, {"start": 995150, "end": 996086}]}, {"count": 1, "rank": 0.08, "text": "Google teams", "timestamps": [{"start": 1198278, "end": 1199302}]}, {"count": 1, "rank": 0.08, "text": "floppy teams", "timestamps": [{"start": 1873336, "end": 1874690}]}, {"count": 1, "rank": 0.08, "text": "team dynamic assessments", "timestamps": [{"start": 1448096, "end": 1449826}]}, {"count": 1, "rank": 0.06, "text": "different problems", "timestamps": [{"start": 1937218, "end": 1938130}]}, {"count": 2, "rank": 0.06, "text": "different ideas", "timestamps": [{"start": 1289292, "end": 1290354}, {"start": 1970808, "end": 1971890}]}, {"count": 1, "rank": 0.06, "text": "different sides", "timestamps": [{"start": 989228, "end": 989746}]}, {"count": 1, "rank": 0.06, "text": "different team dynamics", "timestamps": [{"start": 955876, "end": 957834}]}, {"count": 1, "rank": 0.06, "text": "different activities", "timestamps": [{"start": 967128, "end": 967854}]}, {"count": 1, "rank": 0.06, "text": "different boxes", "timestamps": [{"start": 1958836, "end": 1959866}]}, {"count": 1, "rank": 0.06, "text": "different teams", "timestamps": [{"start": 1285756, "end": 1286262}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}