{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/4ea8d9b9-26c6-4540-aa46-e1bdcdace835", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["can", "conf fourty two", "datadriven", "from", "insights", "lets", "mapping", "process", "product", "product manager", "quoc cuong nguyen", "resonates", "revolut", "spotify", "transform", "uber", "unlocking", "unveils"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "80d482e5-27ab-414e-848d-68bac934f38e", "status": "completed", "error": null, "text": "Hi everyone. My name is Gong. I'm a product manager at Spotify and today I'm really happy to be here to discuss product discovery and in particular a data driven approach to product discovery. So my talk will be divided into three main parts. Firstly, I will discuss, based on my experience, how we can leverage data in product discovery. Secondly, we will look into a few examples where companies like Netflix or Spotify were able to leverage the data that they collect in order to further strengthen their product mode. And finally, we will also look into factors in order for us to run data driven product discovery effectively. So without further ado, let's jump right in with the first part, how we can use data in product discovery. So product discovery is essentially a decision making process, which means it requires data as inputs in order for us to make informed decision. I think all product teams will agree with me on the importance of data in product management and more particularly in product discovery. We all want to leverage data as much as possible. So the question is how can we do that effectively? So I could argue that one of the biggest challenges for product teams when they look for answers to these questions is the abundance of data. To the extent that we are all overloaded with data in the digital world nowadays. Take established large scale products for example. We are probably looking at like millions of data attributes and billions of data points being collected every single day. So it can easily feel overwhelming for product teams not knowing which data is relevant and important in order for us to identify which problems and subsequently which solutions to work on during the product discovery process. So how can this be avoided? To answer this question, lets take a step back and look into the definition of the product discovery. So I recognize that different organizations might have slightly different understanding of product discovery. So to make it easier for us in this talk, I could define product discovery as a process of identifying key problems and their optimal solutions in order to achieve the desired outcome. So it all starts with the desired outcomes and we need to work from there in order to identify which data is relevant and important for us during the product discovery process. So lets discuss this further in the next slide. So Im quoting Tyriasautorrus, the author of Continuous Discovery Habit. Good discovery starts with a clear desired outcome. So what I would like to add here is that even though it is important to have clear desired outcomes, it is often just a starting point for the product teams. And this is because for product teams nowadays, more often than not, we are given desired business outcomes, not desired product outcomes. So whats the difference between these two? So again, im quoting Teresa here, a business outcome is a metric that moves the business forward, while the product outcomes helps us understand if the product is moving the business forward. Some examples of the business outcome include to grow the user base, to grow the revenue, to grow the profit, or to increase the retention. So business outcomes are lacking indicators. Once you are able to measure it, it is often too late to do anything about it. And this is why it is critical for product teams to be able to define desired product outcomes based on the desired business outcomes that they are given. For example, if the desired business outcomes is to grow the revenue, some potential desired product outcomes could be like existing customer will buy more, or existing customer will be willing to pay more for the same product, or new customers from new countries will start buying products or new customers from new segments will start buying products. So defining desired product outcomes based on the desired business outcomes is a major step toward effective product discovery. And this is because product outcomes are often leading indicators which enables product team to learn about the impacts and reiterate in quick cycle feedback. More importantly, product outcomes are most within the influence of the product teams. So once the desired product outcomes are defined, product teams should also make sure to translate those outcomes into appropriate product metrics. And this is to ensure that we can measure the current situation as well as validating any future impact of your work. So one tip, I have to select the right metrics to optimize for to select those metrics based on the product life cycle. And this is of course in addition to the desired business outcome that we were given. So if your product is still in its early phase, the focus is usually on the retention. This is because you want to ensure that the users can perceive the value of your product before doing anything else. Subsequently, the product metrics could be on the churn rate, on the daily active user, weekly active user ratio, or on the user engagement. So once a job business has achieved their product market fit, the focus of the business usually shifts towards scaling the business. So for product teams, metrics like sign ups, conversion or customer acquisition costs become more relevant now. And this is because it will provide valuable insights into how effective it is in terms of your customer acquisition strategy and how effective it is for you to convert them into engaged users. So for established businesses, the focus now would be on the revenue and profitability. Consequently, for product teams, you can track metrics like average revenue per user, customer lifetime value, or free to pay conversions. These metrics tell you whether the product and the business is financially sustainable and whether we can extract value for the business. So now that we have identified all the product metrics, do we think we have all the data we need in order to run the product discovery? Maybe not quite yet. So, with product metrics, we often measure quantitative data like clicks, reactions or source query, and they tell you a lot about the what of the user behavior. However, they also do not tell you about the why behind those actions like motivations, frustrations or emotions of the users. And this is where the qualitative data will come into play. So, user interviews, usability tests or customer support interactions are really good examples of qualitative data that help us understand the user perspective. They comprehend the quantitative data that are being collected automatically from our product in order for us to have a full picture of users when doing product discovery. So now that we have discussed how we can leverage data in product discovery, let's take a closer look at some examples of companies like Netflix or Spotify were able to leverage the enormous amount of data that they collect in order to further strengthen their product mode. So content is the most important product of Netflix, and they have really disrupted the entertainment industry by leveraging a vast amount of data to inform their decision on personalization and the content acquisition strategy. So Netflix invests heavily into personalization in order to improve user engagement and retention. For example, on the film recommendations, best layouts or thumbnail images were decided based on individual user behavior, and on this effort create a tremendous value. It is estimated that an uplift of $1 billion in revenue was created thanks to these improved retentions. Another way Netflix uses data is to guide their content acquisition, that is, to decide which title to acquire or to produce. So they have an enormous amount of data on user viewing habits, preference or user behavior, which then can be used for them to identify the gaps in their current offering and then make strategic investments in producing original series or acquiring existing content. So as a result, they were able to produce or acquire widely successful series that I'm sure all of us have heard of, like House of Cards, Stranger Things, and Orange is a new black. Quite similar to Netflix actually. Spotify is also famous for the ability to leverage a vast amount of data that they can collect on user listening habits, preference and user behavior to identify and build highly engaging features to make users come back for more so their widely successful features. Discovery Weekly is a prime example of personalization in action. So every Monday, users will receive a brand new playlist of songs that Spotify things that you will love based on your history. Its like you are having a dj personally DJ actually, who knows your music test better than you do. Spotifys data driven approach actually goes way beyond the personalized playlist. They use data to inform their overall product strategy and their content offerings. For example, they notice that users are manually creating different playlists for different activities, for example, like work out. So they decided to create automatic playlists catering to those needs. And Spotify does not give this data and insights for themselves. They actually use it to empower the artists on the platforms. For example, in the Spotify for artists app, those insights are being used for artists to better understand their fans and which lead to better targeted marketing and tour planning. Now that we are moving on to the final part of this presentation, let's discuss the factors required in order to effectively run a data driven product discovery. But first, let's quickly go through the common mistakes or the challenges when it comes to leveraging data in product discovery, the first mistake is to focus on the wrong metrics. We actually talk about this a lot at the very beginning of this presentation, so it is critical to prioritize metrics that actually align with the desired outcomes. The second mistake is actually being too reliant on data to the extent that data becomes a blocker instead of a leverage. This is particularly critical for product teams working on early stage products where data is usually limited. All the product teams should be comfortable making decisions with imperfect information that are required to build truly remarkable products. So one challenge I would like to highlight here is the potentially low quality of data. So when we use data, make sure that the data is accurate and of high quality because inaccurate data can lead to misthalted measurements which subsequently lead to sub optimal product decisions, keeping those are mistakes and challenges in mind. Lets discuss the factors required in order for us to effectively run a data driven product discovery. The foundational factors is to have clear goals and metrics in mind. Basically, you need a sharp vision for your product and define success metric based on that vision. This subsequently will enable you to select the appropriate data, point to measures and to check the progress. The second factor that I would like to highlight here is actually to ensure that you had the right tool sets in order to transform the raw data that you collect into valuable insights. They could be like bi platforms, could be user research tools or a B testing framework. Not only that you have the right data and valuable insights attend, you also need to ensure that you are promoting a data driven culture so that data is valued not only within your product team, but across the organization. Factor number four is about experimentation. The beauty of data is that it enables you to quantify the impact of the experimentation, validating your assumptions which later optimize product decision during the product discovery process. Last but not least is about the data hygiene. A robust data collection and validation process will ensure the accuracy and the consistency of the raw data and subsequently the high quality of your insights during the product discovery process. And this brings me to the end of my presentation today. Thank you very much for your attention and if you have any questions, please share with me over the email. Thank you and have a nice day.", "words": [], "utterances": null, "confidence": 0.922166757679181, "audio_duration": 868.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Gong is a product manager at Spotify. He will discuss how we can leverage data in product discovery. We will also look into factors in order for us to run data driven product discovery effectively.\n- Product discovery is essentially a decision making process. It requires data as inputs in order for us to make informed decision. Good discovery starts with a clear desired outcome. Once the desired product outcomes are defined, product teams should translate those outcomes into appropriate product metrics.\n- Netflix invests heavily into personalization in order to improve user engagement and retention. Spotify is also famous for the ability to leverage a vast amount of data that they can collect on user listening habits, preference and user behavior. They use data to inform their overall product strategy and their content offerings.\n- The first mistake is to focus on the wrong metrics. The second mistake is actually being too reliant on data to the extent that data becomes a blocker instead of a leverage. When we use data, make sure that the data is accurate and of high quality.\n- Lets discuss the factors required in order for us to effectively run a data driven product discovery. The foundational factors is to have clear goals and metrics in mind. A robust data collection and validation process will ensure the accuracy and the consistency of the raw data.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.12, "text": "data driven product discovery", "timestamps": [{"start": 68186, "end": 69818}, {"start": 685134, "end": 687086}, {"start": 762862, "end": 764758}]}, {"count": 5, "rank": 0.11, "text": "desired product outcomes", "timestamps": [{"start": 212998, "end": 214462}, {"start": 255534, "end": 257230}, {"start": 268046, "end": 269494}, {"start": 287628, "end": 289092}, {"start": 314872, "end": 315976}]}, {"count": 8, "rank": 0.11, "text": "product outcomes", "timestamps": [{"start": 213462, "end": 214462}, {"start": 224330, "end": 225338}, {"start": 256150, "end": 257230}, {"start": 268646, "end": 269494}, {"start": 288068, "end": 289092}, {"start": 297344, "end": 298528}, {"start": 309784, "end": 310920}, {"start": 315248, "end": 315976}]}, {"count": 21, "rank": 0.11, "text": "product discovery", "timestamps": [{"start": 33946, "end": 34970}, {"start": 38410, "end": 39654}, {"start": 49090, "end": 50294}, {"start": 68938, "end": 69818}, {"start": 76370, "end": 77614}, {"start": 78522, "end": 79490}, {"start": 95382, "end": 96526}, {"start": 143960, "end": 144696}, {"start": 152664, "end": 153884}, {"start": 158928, "end": 159960}, {"start": 163480, "end": 164548}, {"start": 181468, "end": 182156}, {"start": 293900, "end": 295140}, {"start": 438410, "end": 439514}, {"start": 484774, "end": 485902}, {"start": 489118, "end": 490318}, {"start": 685806, "end": 687086}, {"start": 692950, "end": 694174}, {"start": 763518, "end": 764758}, {"start": 836180, "end": 836916}, {"start": 854534, "end": 855246}]}, {"count": 4, "rank": 0.11, "text": "product metrics", "timestamps": [{"start": 323248, "end": 324396}, {"start": 364482, "end": 365282}, {"start": 434370, "end": 435450}, {"start": 441962, "end": 443018}]}, {"count": 12, "rank": 0.11, "text": "product teams", "timestamps": [{"start": 89462, "end": 90198}, {"start": 107974, "end": 108702}, {"start": 133414, "end": 134358}, {"start": 204182, "end": 205134}, {"start": 207422, "end": 207950}, {"start": 252902, "end": 253582}, {"start": 312960, "end": 313784}, {"start": 317344, "end": 318280}, {"start": 382864, "end": 383856}, {"start": 413442, "end": 414362}, {"start": 719150, "end": 719774}, {"start": 726230, "end": 726878}]}, {"count": 1, "rank": 0.1, "text": "product decision", "timestamps": [{"start": 834700, "end": 835508}]}, {"count": 1, "rank": 0.1, "text": "effective product discovery", "timestamps": [{"start": 293300, "end": 295140}]}, {"count": 1, "rank": 0.1, "text": "appropriate product metrics", "timestamps": [{"start": 322632, "end": 324396}]}, {"count": 1, "rank": 0.1, "text": "product management", "timestamps": [{"start": 92678, "end": 93694}]}, {"count": 1, "rank": 0.09, "text": "large scale products", "timestamps": [{"start": 121446, "end": 122326}]}, {"count": 1, "rank": 0.09, "text": "early stage products", "timestamps": [{"start": 720486, "end": 722094}]}, {"count": 1, "rank": 0.09, "text": "sub optimal product decisions", "timestamps": [{"start": 751684, "end": 753664}]}, {"count": 1, "rank": 0.09, "text": "data points", "timestamps": [{"start": 128190, "end": 128822}]}, {"count": 2, "rank": 0.09, "text": "qualitative data", "timestamps": [{"start": 462364, "end": 463340}, {"start": 471100, "end": 472404}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}