{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/7b463a4b-40fa-4641-9a17-167a2837f68c", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["andrew", "andrew benoit", "battles", "building", "buyin", "career", "chaos", "company", "conf fourty two", "documents", "focused", "has", "hes", "including", "internet", "keeps", "leaders", "overcoming", "resources", "sales leader gm advisor", "seen", "software", "years"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "9b2febf6-a369-49a0-9984-1a455012a648", "status": "completed", "error": null, "text": "Hi. Thank for taking the time to listen to my talk about how to sell chaos engineering tooling into your company. My name is Andrew Benoit and prior to serving as a Gotomarket advisor for early phase startups, I spent about a decade working for companies like Datadog, Gremlin, harness, and Codecuff, and working with customers to solve their reliability problems. Now, if you'd like to connect after the conversation, please feel free to add me on LinkedIn in or you can reach out to me at the email address that I have listed below. Now, the goals for our session are pretty simple. I want to make it as easy as possible for you to understand how to get the maximum value out of your sales rep. Turn him from a thorn in your side, potentially into an actual asset. I want to coach you on how to lobby internally to your peers, understand when someone's truly a supporter or a blocker, and how to proceed accordingly. I want to teach you how to avoid a lot of the mistakes that I've seen project leaders make in trying to get approval for budgetary spend and resources. And lastly, I've kind of noticed a lot of the people that I've worked with that were volunteered to lead the initiative are quite often not understanding that they're being viewed as a potential leader for the future. Your organization is trying to see how you serve as a public face, and they're trying to see that you understand the business value of the decisions that you make on behalf of the company. So I want to give you everything that you need to make a really cohesive ROI statement to your leadership team. So that should an advancement opportunity come up in the future, they view you in as good of a light as possible and you're able to get that position. Now let's kick things off with the fun part, the sales rep owner's manual. And I use this verbiage very intentionally because I want to make it clear, if you had a couple of calls with a vendor, congratulations. From our perspective, you pretty much own us. Now, I know salespeople get a bad rap, and I get it. Look at this guy in this image. He looks like the bad guy in every 80s movie. But there are a ton of misconceptions about how salespeople are trained and how we're incentivized. And I'm hoping that bringing light to these will make you all feel much more comfortable in working with us. For one, enterprise sales keeps in highly complex enterprise software sales are some of the more seasoned sales reps you're going to work with. They're responsible for bringing millions of dollars of revenue a year, and these jobs are really hard to get in the sales world, and we are not trained to never take no for an answer. Time and resources are limited. Reps can have dozens of demo requests a month, and only a small fraction of those meetings ever actually go anywhere because it's simply not a fit. The timing isn't right and it doesn't make sense to waste anybody's time. Every week, sales teams have forecast calls with their leaders and effectively have to explain in front of the whole team how their activities are leading to revenue generation goals. They're expected to be able to explain in great detail the technical fit, why the customer choose their own solution over others, who's involved in the process, and what the timeline is. For example, if this goofy looking guy here tries to close every project, but every week it's clear in his forecast calls that he's just elongating engagements that don't have any likelihood of closing because the technical fit isn't there or he can't confirm a timeline or that budget is available. Well, he's not going to have much fun in those forecast calls, and his sales leader isn't going to give him much in terms of assistance for those engagements. He's on his own and probably going to be looking for a new job pretty soon. But if he has a timeline, the compelling event can establish valid technical use case that differentiate versus competitors, and it's clear there's significant budget. If those use cases be proven out well, the sales leadership team is going to give him and you effectively carte blanche on what you need to 100% realize the value to make you comfortable in your spend meetings to discuss and in some case negotiate roadmap for their executives one on one technical sessions with end users. The world's going to effectively be your oyster, and you'll also likely get access to their leadership team. So if that rep, for example, leaves for another opportunity, or you're just not establishing the rapport that you're looking for, you'll have a backdoor and you won't have to start all over. If you have a legitimate project and you've shared all the information you need, you should feel 100% empowered to ask them for their full effort too. For example, you shouldn't have to ever write notes in a meeting. Ask them to take notes and summarize every meeting, including who attended from each team, what has discussed, and what the mutually agreed upon next keeps are. And that word mutual is important. Review those emails and feel free to object in a reply if it doesn't seen that you're in alignment. To avoid any long running confusion, nip it right there in the bud. And lastly, as we're about to dive into more deeply in some of these later slides, meet in person at the office whenever possible. There's a very good reason why they're asking to do so, and it is in your benefit. Now let's start on that topic. Why does your sales rep always want to meet? Live zooms and calls are so much more convenient. Why not just do that? Well, here's why. In the aftermath of last financial crisis, a group called the CBB was flabbergasted as to how, with such low budgets and high scrutiny, some sales keeps were pretty much performing just as well as before. One of the many key realizations they made was that high performing reps in modern software purchasing cycles understand that decisions are seldom made on a top down basis anymore, in part because ceos, ctos, et cetera, they don't want to be accountable if the purchase doesn't work out. But they likely also haven't been hands on keeps for years. So more than anything, they value highly the opinions of their subordinates. Very much so. What this means purchases have become very complex election like processes which in an enterprise organization can, including dozens and dozens of constituents with several differing personas. High performing sales keeps know how to identify and engage with each of these seven personas, and it's one of their most important jobs to help you do so. And that's really hard to do so on a Zoom call with cameras off, or heck, even on. Let's remember, what's being said is usually a fraction as important as how it's said, and not being able to see how it's being perceived by those in the room is a huge handicap for sales reps as they work to really help you understand how important each topic concern is. After all, haven't we all really been on those calls with a loud voice? Isn't really asking questions that the whole group finds important. By being there in the office live with you during these meetings, your sales rep is going to be able to help you validate your hypotheses on who belongs in each of these seven personas and how to approach them, and how to nurture them into being allies in a fraction of the time that you're going to spend without their help. Now, before we dive into each of these personas, you'll notice I have three circled has mobilizers. Why that's important is mobilizers are the personas that have the most significant influence in your company, likely due to their position, perceived expertise, or their ability to really rally support from their colleagues. They're proactive in identifying leading strategic initiatives and opportunities for improvement. They're skilled at building alliances and gaining buyin from stakeholders all across your company. They've done this before and most importantly, they're known for getting things done. They overcome obstacles, and they have a reputation for making sure that their initiatives that they support stay on track. Now let's briefly dive through each of these personas and talk why some are mobilizers, why some aren't, and some extra nuance you might want us to consider. Now, we'll start with a go getter. They're someone that's enthusiastic about driving change. They're willing to take risks, and they're persuasive with their colleagues in pushing for new ideas. If you and your rep can get them the insights and data they need to show the benefits of change, they'll get things done for you. This is similar to the climber, but the reason the climber isn't immobilizer is their motivation tends to be on more personal advancement rather than what's good for the company. And let's face it, it's not really a secret internally or with leadership. They're, as a result, less likely to take risks that would really hurt their upward progress, even slightly so. And oftentimes they don't have nearly the internal influence that go getters have. Some of you, as we proceed, might be a little surprised that I have skeptics circled. I mean, after all, blocker isn't and aren't those kind of similar? So while both blockers and skeptics may exhibit resistance to change, blockers tend to be more dogmatic, you could say, in their opposition, and they may actively work against progress for you. Whereas skeptics, they're a little bit more open minded. They approach change with caution, but they're open to dialogue and persuasion. So has. Long as you get them the information they need to support why they should support you, you're going to find that they're the most valuable purchase in your process. They'll get everybody almost unilaterally to really agree with you. Now, with blockers, it's important to approach with caution, depending on how much power they have. Internet. If you do engage, though, address their concerns and points with serious empathy and work to identifying common ground and mutually beneficial paths forward. Don't do anything that's going to risk putting you in their crosshairs. So you all might realize now, why don't I have friends circled here? I mean, who doesn't need friends in this world? While friends may support you and have some role in the process, in this purpose of this framework, friends don't really have the seniority or influence to push your initiative forward. Spending a ton of time with your friends when you're lobbying, it can be a real distraction, as even if they vote yes, their vote won't be nearly as important as that of a mobilizer Persona with more power. So the last mobilizer Persona we want to address is the teacher. Teachers have a wealth of experience and expertise, and they're pumped to share with their peers what they're looking into. They're open to new ideas, and they love staying up to date and engaging in conversation about current trends. Much like the other mobilizer personas, they're highly regarded in the organization. If you give them the data they need to understand why this should be a priority for them, they're going to support you. So, as we conclude this slide, I want to share that the biggest mistake I see by far is sales keeps and project leaders avoiding the skeptic and just hoping they'll go away and instead spending that time with friends. I mean, we all like hearing yes, hearing no. It can be a little bit disarming. The problem with that, and I've seen this in dozens and dozens of engagements, is the skeptics in your they're going to get a vote. And if you jumped around them and spent months and months proving out value has, I've done with several prospects, months and months of proving out value, all that work went down the drain. Because in the last minute, some of these skeptics, which we actually persuaded later, after several more months and coming to work with us and being on our side, those skeptics delayed the project because they felt like they were skirted around. So if there's one thing I want you to take from this slide, please have it be this. Do not avoid the skeptic. Don't chase years, chase the confrontation, and with empathy and logic and reasoning, overcome why they should be on your side. Now, let's continue the conversation on the most important points I have in this presentation. Your goal, as you look to gain internal support should not, and I repeat, should not be to build a chaos engineering practice. After all, you could have a chaos engineering practice and not do things right, which, as we all know, could result in a pretty monumental negative for your company. Your goal is to make improvements that drive your business forward. Focus on measurable and achievable outcomes that your confident fault injection, as I like to call it, will actually help you with things like increasing availability by x percent, reducing downtime, or meantime to resolution. I'd actually really recommend not using the term chaos at all. Let me tell you a little story about why so one engagement a few years back was the very technical and impressive group of engineers. These guys and gals were brilliant and they had pull and had a super impressive POC where we found tons of bugs that would have made it for production. However, they also loved the term chaos. Absolutely loved it. They even had t shirts. Unfortunately, during the approval process, we found out that pretty much none of their executives did. Why? Chaos engineering, thanks to marketing, has become a really, really loaded term. There are so many misconceptions about chaos engineering that distract stakeholders from what you're trying to achieve, and in their case, that ambiguity resulted in the six month delay in actually getting funding approved. In fact, even Netflix doesn't use the term chaos engineering anymore for this reason. On that note is this. The next couple slides are going to detail rather than make it its whole individual initiative and risk creating the perception, this is a whole new thing that your teams have to do. I'd really recommend viewing and presenting fault injection as a critical adjoining portion of other initiatives that are already perceived as highly important. And the reason for this is simple. There are a ton of things your company should do, but in reality, let's be honest, time is scarce. Only the most important things are actually going to get done, and also a side benefit. By going into these more high priority initiatives that are already established, you're going to get access to a lot more mobilizers that maybe you wouldn't have met or interacted with before, and you're going to have a great opportunity to making sure that everything is fully understood and that you actually get budget as a part of their line items. Let's start with the biggest one in my experience, the cloud migration. The IDC estimates that orgs are going to spend over trillion dollars this year on cloud initiatives and support services, and this is estimated to go up by about 15% each year. If you're in a major enterprise organization, it's highly, highly likely that this is your highest visibility and highest priority initiative at your company. If things don't go well, your leadership team and your company's stock value not going to have a fun time. Rather than assuming that things are going to work as expected and rushing things out the door this is a perfect opportunity for you and your sales rep to highlight how critical fault injection can be in valuing that your resilience, scalability, performance and recovery strategies work as planned before you risk costly and embarrassing downtime. And the earlier you find these issues, the easier and less expensive it'll be to fix them. Is your leadership team really willing to risk messing up one of their most important initiatives? I'd wager probably not, if you frame it this way. Now, I'll start off this next slide with a bit of a self deprecating reality I had recently in my three years of selling fault injection, I'm pretty sure I made more money for Datadog than I made in my three years actually working for them. I've been in countless game days with brilliant engineers, but I'd still need a few dozen more fingers and toes to count how often we thought things were performance expected, as long as certain metrics weren't surpassed only to learn that, yeah, things still weren't fine because we weren't collecting nearly enough metrics to truly understand when things would go haywire. And we only knew that because we tested before we went live. And that's nothing to be ashamed of. It's actually to be expected, especially when using brand new cloud and container services that your teams have never used before. Jobs are hard if you aren't validating on a repeated basis that alerting thresholds don't need to be adjusted with new releases, and you're not collecting all the metrics that you need to truly understand the impact of specific performance issues, especially when oftentimes those additional metrics are free and just need to be configured. Are you really getting the most out of your observability spend? Couldn't you just make a minor change and get a lot more value? Another couple of use cases I've seen be really valuable to tie onto are making Dr. Not a disaster and education budgets. So many of the banks that I worked with, I effectively found they realized that their engineers were not meeting Dr. Protocols and standards. They weren't testing to see that things worked has expected by using a cloud and platform agnostic fault injection tool, you're good to go. It makes it way easier if we have things that we want people to do, we want to make it as easy as possible to do that and using updated tooling and modern tooling can be a great way to make disaster recovery way less painful. So it's actually done. In education budgets, I actually sold an almost six figure deal to a customer that didn't even actually plan on making chaos engineering mainstream across their different teams. They actually wanted to use it with their interns, hundreds and hundreds of interns every summer. They wanted to effectively show them how all the different components and the systems are going to work work. So they had no plans to even go on production or even use on a large scale. They just found it as a key part of their education curriculum. Moving forward now, on top of tying to other high priority initiatives, this slide also shows a fairly easy way to show value by quantifying how much adding another nine can have on your bottom line. In this fictitious example, I use $5,000 as the cost of downtime per hour, despite my research showing that the average for major enterprise orgs is as high as 9000. My reason for doing so as we all know, these numbers can get a bit squirrely sometimes. If you get too aggressive on these estimations and a block or a skeptic comes in the fold, you really risk losing credibility. However, if you're conservative in your estimates and can still show a huge savings, that's pretty powerful. This is admittedly pretty simple, but if you'd like a more comprehensive calculator complete with far more information and variables, I definitely recommend checking out the new harness chaos engineering ROI calculator that I worked on was over there. And while you're at it, feel free to tell um and the chaos native team that I say hey. The next thing I really want to emphasize is the importance of coming up with an implementation plan. The reason being is fairly simple. Your leaders are going to want to seen that you've put serious thought in this. The last thing they want is more shelfware. Be sure to include what applications and years you'd like to start with and what the business impact would be if they participate, what metrics are used to track success and what internal resources will you need. Also, what adjustments to incentive structures need to be made to incentivize participation. Also, the more you know about your use cases, the better likelihood that you'll be able to negotiate an advantageous deal with a vendor. While most I've seen are charging on a per service level basis with x amount of tests per service included, if you have a ton of services but only want to test them a fraction of the amount that's included, it's highly likely that you'll be able to negotiate a heavy discount and greatly reduce the likelihood of only using a small portion of your entitlements. So, to conclude our time together, remember your sales rep when used correctly, and as long as you don't feed them after midnight or get them wet can actually make life a lot easier. And you'll likely find their help really valuable when navigating through your company's internal politics, especially if you're able to provide the answers their leaders are looking for. Show the deal is real, and most importantly, stick to business value and kill the chaos buzz. Trust me, I've done hundreds and thousands of these engagements. Now it seems it'll save you a ton of time and heartbreak. Thanks again to Mark and Miko for putting on such a great event, and to you all for tuning in. That's a wrap for today. Please feel free to connect with me on LinkedIn or shoot me an email if you'd like to continue the conversation.", "words": [], "utterances": null, "confidence": 0.953915124899268, "audio_duration": 1249.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Andrew Benoit will discuss how to get the maximum value out of your sales rep. Turn him from a thorn in your side, potentially into an actual asset. He will also teach you how to avoid a lot of the mistakes that I've seen project leaders make. If you'd like to connect after the conversation, please add me on LinkedIn.\n- There are a ton of misconceptions about how salespeople are trained and how we're incentivized. Ask them to take notes and summarize every meeting, including who attended from each team. Meet in person at the office whenever possible.\n- Live zooms and calls are so much more convenient. High performing sales keeps know how to identify and engage with each of these seven personas. And that's really hard to do so on a Zoom call with cameras off, or heck, even on.\n-  mobilizers are the personas that have the most influence in your company. They're proactive in identifying leading strategic initiatives and opportunities for improvement. The climber is less likely to take risks that would hurt their upward progress. And oftentimes they don't have nearly the internal influence that go getters have.\n- While both blockers and skeptics may exhibit resistance to change, blockers tend to be more dogmatic. Whereas skeptics, they're a little bit more open minded. With blockers, it's important to approach with caution, depending on how much power they have.\n- The last mobilizer Persona we want to address is the teacher. Teachers have a wealth of experience and expertise. Do not avoid the skeptic. Don't chase years, chase the confrontation. With empathy and logic and reasoning, overcome why they should be on your side.\n- Your goal should not be to build a chaos engineering practice. Focus on measurable and achievable outcomes. Even Netflix doesn't use the term chaos engineering anymore for this reason. I'd really recommend viewing fault injection as a critical adjoining portion of other initiatives.\n- The IDC estimates that orgs are going to spend over trillion dollars this year on cloud initiatives and support services. If things don't go well, your leadership team and your company's stock value not going to have a fun time. The earlier you find these issues, the easier and less expensive it'll be to fix them.\n- We weren't collecting nearly enough metrics to truly understand when things would go haywire. It's actually to be expected, especially when using brand new cloud and container services. Are you really getting the most out of your observability spend? Couldn't you just make a minor change and get a lot more value?\n- Another use cases I've seen be really valuable to tie onto are making Dr. Not a disaster and education budgets. Using updated tooling and modern tooling can be a great way to make disaster recovery way less painful.\n- This slide shows a fairly easy way to show value by quantifying how much adding another nine can have on your bottom line. The next thing I really want to emphasize is the importance of coming up with an implementation plan. Your leaders are going to want to seen that you've put serious thought in this.\n- Remember your sales rep when used correctly. You'll likely find their help valuable when navigating through your company's internal politics. Most importantly, stick to business value and kill the chaos buzz.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.05, "text": "sales teams", "timestamps": [{"start": 185916, "end": 186546}]}, {"count": 1, "rank": 0.05, "text": "High performing sales", "timestamps": [{"start": 390830, "end": 391914}]}, {"count": 1, "rank": 0.05, "text": "enterprise sales", "timestamps": [{"start": 156212, "end": 157102}]}, {"count": 2, "rank": 0.05, "text": "sales reps", "timestamps": [{"start": 161674, "end": 162138}, {"start": 413588, "end": 414138}]}, {"count": 15, "rank": 0.05, "text": "things", "timestamps": [{"start": 125214, "end": 125394}, {"start": 475480, "end": 475810}, {"start": 505988, "end": 506222}, {"start": 745888, "end": 746122}, {"start": 763012, "end": 763294}, {"start": 850288, "end": 850878}, {"start": 858004, "end": 858638}, {"start": 907348, "end": 907534}, {"start": 914596, "end": 914814}, {"start": 916318, "end": 916466}, {"start": 965912, "end": 966066}, {"start": 971400, "end": 971682}, {"start": 976488, "end": 976626}, {"start": 1035788, "end": 1036022}, {"start": 1046192, "end": 1046394}]}, {"count": 1, "rank": 0.05, "text": "other high priority initiatives", "timestamps": [{"start": 1091808, "end": 1093238}]}, {"count": 1, "rank": 0.05, "text": "highest priority initiative", "timestamps": [{"start": 904532, "end": 905706}]}, {"count": 1, "rank": 0.05, "text": "chaos engineering tooling", "timestamps": [{"start": 27772, "end": 28978}]}, {"count": 4, "rank": 0.05, "text": "sales keeps", "timestamps": [{"start": 156842, "end": 157642}, {"start": 341632, "end": 342374}, {"start": 391702, "end": 392326}, {"start": 660916, "end": 661498}]}, {"count": 8, "rank": 0.05, "text": "chaos engineering", "timestamps": [{"start": 27772, "end": 28706}, {"start": 740464, "end": 741366}, {"start": 744064, "end": 744886}, {"start": 805810, "end": 807034}, {"start": 812836, "end": 813738}, {"start": 824878, "end": 825726}, {"start": 1065496, "end": 1066494}, {"start": 1138562, "end": 1139554}]}, {"count": 1, "rank": 0.05, "text": "several more months", "timestamps": [{"start": 701296, "end": 702138}]}, {"count": 1, "rank": 0.04, "text": "chaos engineering mainstream", "timestamps": [{"start": 1065496, "end": 1067150}]}, {"count": 1, "rank": 0.04, "text": "cloud initiatives", "timestamps": [{"start": 891632, "end": 892406}]}, {"count": 1, "rank": 0.04, "text": "valid technical use case", "timestamps": [{"start": 237106, "end": 238502}]}, {"count": 1, "rank": 0.04, "text": "leading strategic initiatives", "timestamps": [{"start": 463098, "end": 464862}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}