{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/8a057522-de1f-47dd-83c9-fecfd3e3f79b", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["alayshia knighten", "burnout", "by", "can", "company", "conf fourty two", "customers", "engineers", "happens", "hasnt", "honeycombio", "indicators", "measures", "months", "negociation", "objectivesengineers", "okay", "performs", "provide", "rockstar", "sli", "slis", "slos", "strategies", "taken", "team lead onboarding engineering", "teams", "turn", "turnover", "wider"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "1504b2fe-0dce-4597-92c5-cb33770b5ba9", "status": "completed", "error": null, "text": "Are you an sre? A developer? A quality engineer who wants to tackle the challenge of improving reliability in your DevOps? You can enable your DevOps for reliability with chaos native. Create your free account at Chaos native. Litmus Cloud my name is Alicia Nyton, and I'm an engineering team lead at Honeycombio, where I specialize in assisting customers in this sticky but quite satisfying space called observability. I bring customers to the hive, where they are lost, and I help them understand that they're humans, too. My background consists of physics, a little biology, DevOps engineering, and a splash of trash talking. Today we will be discussing SLI negotiation tactics for engineers. Service level indicators are quantitative measures of a service, which in turn are measured by slos. Whoa. My apologies. This is not the talk that you actually think seriously. This is about survival level indicators that are prescribed to everyone who has a pause. It's a mental measure to indicate, hey, self, am I okay? Like real life okay, if you are flaming dog, this is fine meme several times throughout the course of the day, then you're not okay. My friend, a person is only great as their best cup of coffee is a fact set approximately by no one. I hope, at least if this has become your mantra of drinking coffee to stay awake and stay alive. Hopefully caffeine is not this hypothetical liquid that is gluing your eyes open in such a way that it creates pillows for your tiredness. Well, those are bags, folks, and they're indicators that you need to get some rest. This talk is specifically designed to address engineers. So, slos measure customer success. But if we think about it, customers are as successful, are only as successful as the people that we put in front of them and the people that are helping create these systems that they can use and love on a day to day basis. So let's focus on that for a moment. So we've talked about survival level indicators for 2 seconds, right? So let's define that. It's the me factor divided by valid moments. So what is that exactly? The me factor is basically core values plus what intrigues you, your mantra, and your tolerance levels. The me factors are the good parts of you and what you stand for. If at any point in time, your me factor is compromised, then the best parts of you cannot be brought to the table. Imagine if your job told you something like, hi, you're probably going to have to miss out on your child's graduation or the trip you've been planning for several months. Yeah, we have things to do, so you can cancel that. I'm pretty sure you'll go Super Saiyan in the office and are talk smack in those private back slack channels. So it's important to keep your me factor in mind and keep those things in perspective. So I've talked about the me factor. So what are valid moments? Valid moments are things that you've considered to be justifiable for you. For example, some people prefer to not have a job that's on call, but maybe in your situation it's okay that you're on call. Or maybe it may be okay for you to work extra hours temporarily, as it's something that needs to be done that will be beneficial later. So what are invalid moments? Well, my friend, that's up to you. My tolerance on invalid, non justifiable moments is pretty low nowadays. But some may feel otherwise and that's okay. It's all about your survival, and you should always keep your survival in mind. So we've gotten our mind around surviving in the workplace and in general. So how do we calibrate that? Well, I want to provide a few tips for that. So let's define mutualistic expectations. So as soon as you humanly can define your expectations and then calibrate them. As dynamic as life is, so are adults. We have needs, whether it's wanting to be a part of leadership, having more technical challenges at work, or easier workload, especially if you're doing a job of nine people, et cetera. Hey, boss, I'm tired of your shit is definitely not a way to approach your boss yet. You may want to indicate to your boss that I see myself in x situation and I feel that I'm in X place. Do you agree? This sparks the conversation of discovering where you are and where you can go. And it also gets your boss thinking, hey, this person is actually thinking about this and it's proactive. So let's approach these things together. This works the other way around as well. And what I mean by that is, as a boss, it's not cool to force someone into leadership, yet it's totally cool to encourage them and to ask the person where would they like to be and what are their current limitations. At work, you never know until you ask someone what's going on. And this is a good way to approach that. There's a great way to define basic expectations so you can do something like a readme of yourself, to introduce yourself to people so they know how you work, what your values are, ways to reach you. That's okay and plausible for you, et cetera. This is a way to set boundaries in a very meaningful way with people understanding who you are at a very basic level. The next thing I want to talk about is calibrating no meeting Wednesdays. So if you understand this concept or you have it, stick to it. If you don't have it, please create it. The notion of picking a day without a meeting without meetings is the beginning of something beautiful and it provides a sense of normalcy. You can drive your productivity throughout the day without being distracted. Defining weekly tasks spend a little time during working hours at the beginning of the work week or towards the end of the previous work week to calibrate your calendar for the upcoming days. You can determine which tasks are actually required for the week as well as the level of detail and attention it requires. Not all of the meetings on your calendar at times require you to be there, and so you can gauge that to taken free up yourself and have that sense of clarity to allow yourself that ability to prioritize without jamming up your time. Hobby fishing sparking up with a hobby is a way to give yourself, literally yourself, something to look forward to that has nothing to do with work. This is the time to think about yourself and fine tune that me factor myself. I just purchased a Kamado grill and so I'm planning on being a grill guru. Have no idea how this is going to work, but I've done all of this research and time and I've constructed on what I want to do. And so when I need to formulate what I want to do outside of work, this provides that foreground. To do that without putting busy, meaningless tasks in front of me. This is something that I really want to do and right now this is my yoga. Nudge your friends. So being healthy for yourself also requires those around you to be healthy as well. So tap your friend. They may actually need it. I've had work friends previously who've cried out for help, indirectly, directly, whatever the case may be, sending out smoke signals. Typically I'd sense them and I may nudge them back and say, hey, would you like to participate in doing something non work related on Zoom for 30 minutes? And this is simply because work has been challenging and they may not know how to depress or they may not know how to reach out. And this is a way, if they're your friend, this is a way to do so. Also, as a friend, if someone hasn't taken off that you know of, whether they're your friend or not, to be honest, tell them to take off. It's quite okay to do that. Life happens regardless if they're at work, not, and the work will be there regardless. And your sanity may not always be there. If required, suggest places for them to go. And this may also be an opportunity to get to know a person as well. Who knows? Sometimes people need to be reminded from humans that show general interest in them that it's okay to think about yourself, to think about your mental health, to think about your survival. So the last part here for me is tasting the gumbo. So I'm from Louisiana, so any chance I get, I love to throw a splash of Louisiana in there. So if we look at the me factor as a gumbo, there are many ingredients in the me factor that define a person. Besides calibrating yourself, there could be moments where the components have changed. So gauge yourself and taste those ingredients to ensure that the components that make up who you are as a great worker, friend, parent, lover, et cetera, are still flavorful to not only yourself, but to others as well. I mean, people have to love you and stomach you to a certain degree. No one is perfect, so use your experiences and feedback to add a little salt to your recipe. Check yourself before you break yourself, if you're familiar with that terminology, surviving is about patience and endurance under the right circumstances. If your job is no longer for you based on your expectations and needs, that's okay people. Sometimes we outgrow the seasons that we use. Have those conversations with your boss to see if it's feasible to add this to your gumbo. Or is it suitable to replace that seasoning with something more complementary? This tech stuff that's always easy. Life is hard but challenging and rewarding, so let's make sure we're all surviving. Thanks for joining.", "words": [], "utterances": null, "confidence": 0.947627019515084, "audio_duration": 809.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- You can enable your DevOps for reliability with chaos native. Create a free account at Chaos native.\n- Alicia Nyton is an engineering team lead at Honeycombio. Today we will discuss SLI negotiation tactics for engineers. Service level indicators are quantitative measures of a service, which in turn are measured by slos. This talk is specifically designed to address engineers.\n- The me factor is basically core values plus what intrigues you, your mantra, and your tolerance levels. The me factors are the good parts of you and what you stand for. If at any point in time, your me Factor is compromised, then the best parts of your cannot be brought to the table.\n- What are valid moments? Valid moments are things that you've considered to be justifiable for you. My tolerance on invalid, non justifiable moments is pretty low nowadays. It's all about your survival, and you should always keep your survival in mind.\n- As dynamic as life is, so are adults. We have needs, whether it's wanting to be a part of leadership or having more technical challenges at work. It's not cool to force someone into leadership, yet it's totally cool to encourage them.\n- The next thing I want to talk about is calibrating no meeting Wednesdays. This is the time to think about yourself and fine tune that me factor myself. Being healthy for yourself also requires those around you to be healthy as well. Nudge your friends.\n- There are many ingredients in the me factor that define a person. Use your experiences and feedback to add a little salt to your recipe. Check yourself before you break yourself. Life is hard but challenging and rewarding. Let's make sure we're all surviving.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.06, "text": "survival level indicators", "timestamps": [{"start": 122936, "end": 125242}, {"start": 213270, "end": 215730}]}, {"count": 1, "rank": 0.05, "text": "work friends", "timestamps": [{"start": 631548, "end": 632198}]}, {"count": 9, "rank": 0.05, "text": "people", "timestamps": [{"start": 198192, "end": 198442}, {"start": 200208, "end": 200454}, {"start": 296112, "end": 296700}, {"start": 377836, "end": 378246}, {"start": 455972, "end": 456222}, {"start": 472152, "end": 472402}, {"start": 701572, "end": 701902}, {"start": 758192, "end": 758442}, {"start": 782392, "end": 782980}]}, {"count": 1, "rank": 0.05, "text": "non work", "timestamps": [{"start": 652084, "end": 652702}]}, {"count": 1, "rank": 0.05, "text": "Service level indicators", "timestamps": [{"start": 107330, "end": 108746}]}, {"count": 5, "rank": 0.05, "text": "time", "timestamps": [{"start": 240928, "end": 241258}, {"start": 516632, "end": 517074}, {"start": 560228, "end": 560800}, {"start": 574008, "end": 574194}, {"start": 591808, "end": 592234}]}, {"count": 1, "rank": 0.05, "text": "invalid moments", "timestamps": [{"start": 317208, "end": 318366}]}, {"count": 3, "rank": 0.05, "text": "valid moments", "timestamps": [{"start": 223480, "end": 224558}, {"start": 286828, "end": 287534}, {"start": 287602, "end": 288374}]}, {"count": 1, "rank": 0.04, "text": "day basis", "timestamps": [{"start": 205268, "end": 206170}]}, {"count": 1, "rank": 0.04, "text": "working hours", "timestamps": [{"start": 517640, "end": 518580}]}, {"count": 1, "rank": 0.04, "text": "more technical challenges", "timestamps": [{"start": 372376, "end": 373582}]}, {"count": 1, "rank": 0.04, "text": "basic expectations", "timestamps": [{"start": 447798, "end": 449130}]}, {"count": 3, "rank": 0.04, "text": "customers", "timestamps": [{"start": 83442, "end": 83894}, {"start": 88716, "end": 89078}, {"start": 193216, "end": 193770}]}, {"count": 1, "rank": 0.04, "text": "mutualistic expectations", "timestamps": [{"start": 352234, "end": 354298}]}, {"count": 1, "rank": 0.04, "text": "weekly tasks", "timestamps": [{"start": 513182, "end": 514450}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}