{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/b307a1ce-74ec-4398-ada8-e4c4368ab5dc", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["alexa", "amazon", "asif mujawar", "aws", "base", "based", "best", "between", "bot", "call", "can", "center", "channels", "chat", "churn", "cloud", "conf fourty two", "connect", "crm", "database specialist sa", "describes", "devices", "from", "interacting", "means", "ml", "omnichannel", "practices", "refers", "seamless customer service amazon connect alexa", "services", "transition", "troublefree", "unified", "using"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "5dc8d48b-46d3-424c-ac67-0e23ebc6e961", "status": "completed", "error": null, "text": "Good morning, good afternoon and welcome to today's session on seamless customer service with Amazon Connect and Alexa, where we will dive how AI ML could help to improve the customer experience and how to perform data driven and personalized customer services. My name Asif Mujawar. I'm a senior dev specialist, SA best of London with AWS, working with customers across the globe, helping build next gen data based platform and transforming application in the cloud using AI and ML. So, a couple of key takeaways from this session. Today we will discover chat is Amazon Connect. We will look into what are the ML services we have in AWS, how to utilize these services with Amazon Connect, and how to integrate Amazon Neptune for data driven decisions on Amazon Connect. Now, Amazon Neptune is our graph database service which has ML becked into it. So that will help us to do the data driven decisions when it comes through databases or relationship mapping, or prediction of some of the relations chat we could build in the background for the customer data and how we can use this data in Amazon Connect. So let's just dive into a bit more about what is Amazon Connect? So I'm going to share a bit of the origin story with you around how AWS came to market with a simple to use omnichannel cloud contact center offering and why we believe that we have the best solution. We'll talk about why customers are adopting connect so quickly, the experiences they are creating and the benefits they are seeing. But the journey doesn't start here. So I would actually like to tell you about the story behind the story. For that, we'll have to go back twelve years. So at Amazon, we strive to be Earth's most customer centric company. And to do this, everyone who works at Amazon understands that our customers are our top priority and that our future as a company is built on customer satisfaction. Twelve years ago, Amazon Retail was starting to see the enormous hockey stick growth. More products than ever, more customers than ever. And to be able to really focus on ensuring highest possible levels of customer satisfaction, we needed the right people and right processes. But we also needed the contact center technology that was capable of ensuring customer satisfaction at scale. So today, over 70,000 Amazon customer Service Associates supports millions of customers who speak dozens of languages from customer service centers in 32 countries across the globe. We knew that in order to scale to this size and to deliver exceptional customer service at this call, we would need the right technology in place. We knew the trajectory of growth we are seeing, but we also needed to center for rapid changes in demand. Are you aware of Amazon Prime Day. So as you can imagine, on Prime Day, there is significant increase in traffic to the online store as well as traffic to the custom service centers. The contact center technology need to be able to take thousands of additional agents to handle this peak moment and scale back down literally a day later. So we explored a lot of contact center solutions, what we have on the market, on chat time, and we went through evolution about the product which can be customizable, can it scale and few other bits and bobs. But what we realized that the products on the market either they were good at scaling, bot not so good at customization. The products which were good at customization, they weren't good at scaling. So we needed to have something that can be customizable, that can be scaled and to do what we had as a region, so what we did, so we built our own service as a contact center. As a service using our knowledge and experience, we built an easy to use, intuitive system that enables Amazon customer service associates to focus their attention on the customer rather than navigating a complex or difficult to use system and their supervisors. A simple tool for managing their staff and their businesses. Over 50 groups and businesses within Amazon and its subsidiaries provide customer service today, including Zappos, audible and of course, Amazon Retail, the customer service which alone has hundred global contact centers and over 70,000 agents, making Amazon Connect suitable for contact centers ranging from tens of agents to tens of thousands of agents over time. Our AWS customer would meet our ex CEO Andy Jassie and ask him, what technology are you using for your contact center at Amazon? And he would tell them it's an internal tool and they would respond, if you bring that to the market, we would be interested in that. And we saw this again and again. Andy funded a team to bring our internal tool to the market, which we did in March 2017 as Amazon Connect. So Amazon Connect is a simple to use, cloud based contact center service we brought to the market to enable businesses to deliver exceptional omnichannel customer experiences that are natural, dynamic and personalized. It includes call the standard functionality contact center operations team have come to expect skill based routing maximizes efficiency of agents and satisfaction of end customers. To ensure that connect to the right customer of the right agent at the right time, voice and chat interactions are recorded making it easy to monitor and improve the agent quality call the common reporting analytics is available. Our customer often tell us how much they love the audio broadband Internet connection or the audio quality for calls with Amazon Connect using a standard broadband Internet connection, agents can be located virtually anywhere. Empowering businesses to offer increased flexibility to work at home agents. So in a current pandemic situation, imagine everybody's working from home. So the traditional offerings, what we had wouldn't have allow us to do the scale at the level we wanted to scale and connect using the cloud native system call you need is a hardware and a USB headset to connect with and that's about it. We built this from the ground to take advantage of the cloud built as multi tenant architected service that is available around the world through low latency links. We also have created a network of managed carriers for easy telephony hosting. At the same time, we utilize online powerful AI ML AWS services to help improve your customer journey within your contact center using Amazon Connect. So let's just dive into the first demo of how Amazon Connect helps you improve your customer journey. So in this demo we'll see a customer interacting with Alexa, which is another device where customer interacts with. And then in the back end, what we do. We have used an AI powered Amazon Lex natural language processing bot to serve the customer. So we're not pushing the calls directly to the customer agents on your contact center. What we're doing, we're reducing that impact on the agents and we're addressing most frequently asked questions and most commonly asked questions and serving them via this AI bot technology, Amazon Lex and what this Lex technology uses in the background, another AI service called Amazon Kendra, which then goes in and scans your knowledge base and pulls that information. What needs to be served to the customer on a frequently asked question or most commonly asked questions? And we filter the traffic from customers to your contact center. Only the customers will actually need some assistance on technical whereas how do I do something which is a common, like how do I top up my phone or how do I change my address? All of these things can then be services via natural language processing bot. So that gives you that ability to reduce the impact on the network, on your contact center. Plus at the same time it improves your customer experience that I don't have to wait in the queues and chat, I know I have to understand, answer the questions to another agent, what I've already addressed on the IBR, and that way the whole architecture, which we'll look in insider two, has baked in to improve that customer experience. So without further ado, let's have a look. Alexa open Cox Customer service hello, welcome to Cox Communications Alexa customer services. How can I help? I have a problem. I am here to help. Can you provide me your mobile number? 412-965-9834 Please provide me your four digit piN number 7878. Thanks for confirming your identity age do you still have the problem with your wiFi? You can ask me any questions regarding your account or say goodbye. How do I top up my phone? You can top up your phone credit by setting up card payments by using my Cox communications by text, by phone or in a shop. You can also top up someone else's phone online. Please visit HTTPs mycox.com. I would like to speak to an agent. Thanks for using our service. You will receive a call on 412-965-9834 so you can see here the customer interacting with Alexa at their home, on their phone device or eco dot. And in the background we use the Amazon Alexa NLP bot to process the customer through custom security checks where we ask for phone number and the digits and we verify the customer. You can see how we personalize the customer asking do you still have the problem which they reported last time? Again, this AI is built in. Our service in the background is picking up the last interaction and last interaction category and asking that customer a question whether they had the problem. At the same time, we dive into the for frequently asked questions. As customer asks, how do I talk with my phone? So we scan the knowledge base and we present the information back to the customer. And if the customer wants to speak to an agent, we seamlessly transfer this customer to an agent. Now let's look at how does that conversation goes on. So here we have the call coming in from the customer, and this is the customer agent side looking at it. And as you can see, we have the attributes populated where we are saying the channels underscore regular handler, queue and churn prediction, which is another ML we have applied. But we'll talk about in a second or two. Hello there. Yes, how are you? How are you? Everything going well? Excellent, yes, can't complain. So how can I help you today, ma'am? I was wondering, what will my monthly phone bill include? What will your monthly phone bill will include? Let's have a look. Yes, sir. Pleased. Yeah, while it's coming through, how's your day been so far? Oh, it's been okay. It's been okay. I'm trying to catch up on some stuff. I have a kid in college and I'm just trying to figure things out. By the way, your Alexa app is super helpful. I'm glad it helped you. Right. So your monthly phone bill will cover the cost of your plan and additional services such as additional add ons or any part charges such as devices or accessory channels and third party charges. If you need more information please visit our website call which is httpsmycox.com. I hope that helps you. That definitely does. Thank you so very much. I appreciate it and you have a great day. You too can. Thanks for calling. Brilliant. So we just looked at it in the first part. We had the customer interacting with Alexa. He started them Alexa. Then he came over to an agent to speak to where a customer doesn't have to make a call. Customer just simply provided the validation and the Amazon connect. Then you utilize chat information and made an outbound call. So at no point customer had to repeat itself and everything just was handed over to the agent. Agent looked at it. Again we provided if you look at the way we scan the knowledge base again, using an AI service in the background, Amazon Kendra is able to provide that information to agents where customer asks question what will my monthly phone bill will include having an agent scamper through a lot of portals to get information. We have one stop shop, he just punch in or she just punch in the question in the search bar and click search and that's it. It gives you that answer. What it needs. Again, Amazon Kendra is a natural language processing query engine. What we have in the background, which is picking up this information presenting back to the customer. So let's just dive into the architecture in this demo. So without any coding or integration works, agents are presented with previous chat messages from this interacting in line with the chat agent space. This is both if a chat is transferred to another agent or if the chat starts within the chat bot like it does in the demo, meaning the customer does not have to repeat themselves and the agent is empowered to start helping the customer immediately. So this is what it looks like under the hood, what we have used as an AI services or ML services in the background. So we have on the left hand side you can see Alexa app user or customer can come in via phone call or customer chat. If it's using Alexa app, then Alexa skill which is again powered by the NLP bot. So Alexa skill makes that call to Amazon NLP Bot and we use the outbound API call using a lambda, then we issue the call to Amazon Connect. Within the connect we have contact flows which are taking care of inbound and outbound connectivity, communication or also the channels what we have the Alexa customer phone call or voice or a chat channel. And within the center flow, then we do interact with the multiple AI services using lambda. Then we predict the customer churn and then we route the call based on whether the customer is about to churn or not churn. If the churning customer is coming in then we'll write the call to the agent who is handling the churning call. Or if the customer sentiment is negative then we wouldn't necessarily put through the IBR. We simply straight away put through directly to an agent who can handle the negative sentiment customer who are specializing that again that's an efficient routing and in terms of enabling the customer to agent to help customers'questions. We have the NLP query engine in the background which is Amazon Kendra which is another AI service that can help you to better serve the customer from can agent point of view and that reduce the service time. So that's the demo one let's look at. Let's just take this to a next level where we establish another AI service to help us to drive the better customer experience. So what are the base business drivers for a top customer service and why? Customer service is a key to a success of any business. Customer needs to receive the right support at the right time from the customer services, which means it in turn provide or improve your customer satisfaction. And that means a happy customer is more likely to recommend your business to the others and spend more with your services. So how do we serve the customer right first time? So first of all, you need to know your customer, that is your customer satisfaction from the previous interactions customer purchase history based on how he's been sending or she has been spending with you. The customer size itself chat are the customer needs based on the products they have procured so far and what is the purchasing power based on the history what we have. Secondly, you need a system that enables the customer journey through the system more smoother and effective. That is basically your interactive IVR can IVR with natural language processing or aipowered bot in the background which addresses the customer questions far more quickly than having to solute everything to the customer agent. Secondly, you have the ability to process the information on the fly, not necessarily putting the customer in the queue, process that information and then come back. Whereas you have that AI powered information processor in the background and ability to read the call to the right agent. The third most thing, you need the right agent for the right call. So how do you go about that? You need a system to know which agent it should route the call based on some criteria that enabled either the sales inquiry call to convert in a purchase or returning customer call in a retention. So how do we go about that? A routing system that has AIML based in natively in that service to be able to route this call based on some criteria. So let's just define some criteria here. Say for example agent CSAT score, so higher the agent CSAT score, more likely that agent is convert that particular customer into sales or retain that customer if it's churning customer. Secondly, the knowledge in that particular product area for that agent, if the customer agent or the agent itself is more like a technical support, then he wouldn't necessarily will be able to do the sales support call. So you need someone else in terms of the agent specialties. Again, we can have this baked in in the service that can look at the different attributes of the agent and intelligently route the call to the right area, right customer call to the right agent. And then thirdly look at the sales revenue attainment. So for example, if your agent have achieved the sales quota for that month, so it's less likely that particular agent is going to go chat extra mile to achieve that attainment what has been assigned to him or her. So what system can do then simply can look at on the fly who has hit the quota. So it's less likely the call will be to that particular agent for the sales. For the inquiries it will be go to the agent who have got very high cs scroll, has product specialties and haven't achieved the sales attainment. So that's a three dimensional checks before the call is routed. So with this you're increasing the probability that that inquiry is going to be highly convertible in a sales. So let's just look at how Amazon Eptune then helps you build that relationship mapping between the right customer to right agent. So for example, the demo which is coming up now, we will dive into what we just covered in the business drivers to see this in action. How we pair the customer to the right agent and improve the customer experience. So potential new customer inquiries. So what we do, we map the new customer based on the data we capture upfront in possible two ways. First, have the best possible sales agent. So first of all we capture the data in the flight in the IBR itself. And then we will map the agent to the new customer based on best possible agent. And then we enable these agents with some previous customer knowledge by mapping the new customer attributes to an existing customer base which will help the agents to sell the right product to their customer. This creates the unique experience for both sides, for agent as well. AWS customer because agent knows what the new customer looks like. Because we already have some historical knowledge based on the existing customer, what we have collected and what these existing customers have bought. So that means the agent is more likely to suggest a product that suits the customer rather than having to guesswork. And for the customer, him or her got the right product or right services from the company because they didn't know at the start bot. Now with ability of creating that mapping with existing customer base and having been able to establish that recommendation engine, we have been able to services the customer right first time. So let's just dive into the demo. So here we have, as you can see, we have pulled the customer attributes. Thank you for calling. How can I help you today? It looks like you're looking for a 75 g package. Is that accurate? Yeah, that's absolutely right. So I was just wondering, trying to see if 75 g package is something I should be using and what's the rate and see if that's something going to work for me. Absolutely. So let's talk about what is your average usage and what do you see? I know most people don't calculate their usages, but what do you see yourself using this for? Is this a personal use or is this for a business use case? It's a personal use. I normally work from home and I've got two kids who are normally on their tabs watching YouTube or whatever they want to watch it. So I'm just going to quickly go onto the other side. What we did here, we looked at how the customer agent was presented with information that has came through and we saw when the customer started interacting. Agent already have most of the information about he wanted to buy the 75 gig package. He wanted to start tomorrow and likewise it dived into and converted that sales inquiry into a sales. So let's look at the next one where we're looking at retention scheme. So here we're looking at this is an unhappy customer who is looking to leave the service. Again, you can see, you will see in the agent panel. We have provided enough information for the customer that will enable the agent to better serve the customer, serve the churn customer. You can also see there are some offers being available or been prompted on the customer agent screen so that customer agent could retain that particular customer. At the same time, these offers which have come in on the fly are being calculated using the ML service in the background. Based on the data which we have for this customer in terms of what the customer has spent so far, what's potential purchasing power or customer sentiment to retain this customer? So let's have a look at the demo there. Hello, I want to cancel my service, please. I'm so sorry to hear that, ma'am, can you give me the reason why you're looking to leave our service, please. Yes, it's horrible. I have been down, I am in a work from home situation. I can't get anything to log on. I have had everyone in my home shut down their data and there's just bot enough support coverage out here apparently, or I was misled when I was told that you guys cover this area or a tower is down something. I've call multiple times and I can't continue to go on like this, so I'm going to go with another service provider. In fact, they're cheaper and I've been a loyal customer to you guys and I am beyond frustrated right now. I'm so sorry to hear the number of problems you have been through and I'm really sorry for you have to put up with this while you're working from home, but I'm certainly going to look into it if there is a problem within your alexa. But while I do that AWS, you've been our loyal customer. We could actually provide you a 30% discount for a year. You could provide me with what? I'm sorry, 30% of discount for the entire year? You're going to give me can entire discount for an entire year? Absolutely. 30% off my current bill? Absolutely, ma'am. As you've been our loyal customer and the problems you have to put up with, so hence the reason we have an offer available for you for 30% discount for can entire year. That is awesome. Okay, excellent bot. That still doesn't help me with my problem about not having data. Now chat, can you do for me now to help fix that issue? Because I'm literally having to drive to a coffee shop to work. No, absolutely, ma'am. So what I'm going to do, I'm going to escalate this to our technical team and we will have somebody from the technical team reach out to you straight right after this call and they should be able to walk you through the troubleshooting steps. And I'm sure you must have already gone through these steps, but yes, again, until we have those data with us that what is the problem then? Possibly they are the best people to walk you through how to get that fixed. But rest, be assured there are people who are going to look after you and I'll make sure that's been followed up properly and then I'll give you a call tomorrow morning again just to check whether everything has been looked after. You. Thank you so much. That is awesome. Thank you so much. I look forward to speaking to you. Excellent. Cool, ma'am. So I will put your discount on the account and I'll base a case for technical support. And then there will be somebody in touch with you from the technical team and then I'll give you a call tomorrow morning again just to follow up how you're getting on with it. Thank you so much. You are fantastic. Thank you. I will talk to you soon. All right, excellent. Can you have, sir? Thank you. Bye. So here we go. In that demo, as you can see, we enabled the agent to provide the right information to the right time. It's an unhappy customer. We offered her the 30% discount on the entire bill of that year. At the same time, the agent wasn't then able to go and speak to the technical team and assure her that she's going to be services with the current information right after the call. So that's again powered by the AI services. So we'll just look into it. How do we went about building this up? So what we have is we have the customer data which is hosted in the dynamodb to start with. And then what we build, we build the Neptune relationship mapping on the data that we have available from this customer data, be it the CRM or be it the other data sources. What we have. And then we use Amazon, Kendra in the background to search some of the information. What we needed. But at the same time, what we did, we used the customized personalization where we build the using sagemaker, the personal office, based on the criteria we just looked at in terms of the customer spend, customer sentiment and customer purchasing power. And then we made that available to the agent on the control panel itself. At the same time, what we did within the contact flows, the way we routed the call. What we did, we build that agent mapping the optimal agent using the Neptune relationship. We'll just dive in on slider two, how we went about that. But again, we did some three dimensional checks to build that optimal agent versus the customer inquiry. And then we then pair up the agent to the customer call to be able to better serve that customer. So let's just dive in into the relationship mapping. Let's dive deeper into the Amazon Neptune graph data model. What we build. So we build a three dimensional relationship with the customer to see customer to sentiment, customer to product and customer to spend. And we tag that as customer sentiment, customer package and customer spend. And this is what then driving that ML to be able to publish my offers for the day of my offer, if I'm churning customer and at the same time, my future sales cycles, I could run with this customer and then I can then match the customers base sell based on the products. So 75 gig as a package and I'll have Asif and EJ, David and Sam. All these customers are using the same product and they're all happy customers. And at the same time, out of those, Asif and David are the only people who have that spend category to go to the next level, whereas the others can stay where they are as they are happy on what they are and then they haven't been spending with us a lot, whereas Asif and David have been using other services. So that means they're more likely they can go on to the other services. That way we can build a relationship. Now, at the same time, in terms of the agent, we can look at the agent sentiment. It's a two way door. So we'll look at the agent sentiment itself, that how the agent been serving and how the agent been filling while services to that customer, how much revenue that particular agent has generated so far. And at the same time the product knowledge itself does. The agent has that particular product knowledge. So when the call comes in from the customer, say for example, Asif is calling, who is a happy customer who has very good spending power and he's using 75 gig package. So when it comes to agents, I will look at the agent who has higher cs score and a good sentiment. At the same time he hasn't attend the revenue, but it's a good attendment. AWS far AWS converting the inquiries to sales goes at the same time does the agent has got product knowledge in 75 week package itself plus the next level package. So that way it's more likely that agent could highlight some of the deficiencies in the 75 week package and how the customer can overcome those deficiencies in the next level package. So that way I can convert this inquiry into sales. So that's Amazon Neptune for you. So let's dive into the connect flow itself. So how did we do this in Amazon connect? This is the workflow where we've been using lambdas which invokes the AML service endpoint to grab the data points that are required to either route the call or provide the prompts to an agent or provide some data points to an agent to better serve the customer or to the AI bot itself. How we pulling the information from the background to be able to put that into the bot itself. Some data sample for you in the background. This is how the CRM data looks like. So we have customer phone number, product soldiers, how many call the customer has made so far, the data plan, blah blah blah and the pin number and the sentiment at the top. And this is the ML model, what we have in the background, which is predicting the churn, plus it's predicting the customer evolution AWS such for the building of the offers. And that's the end of what I had to share today. Thank you for tuning in and thanks to conf fourty two team for opportunity. In this session we looked at the Amazon Connect, the first truly omnichannel cloud contact sensor and how our customers are using it to deliver dynamic, natural and personalized experiences at call using ML technologies in the background. So thank you very much for your time so far today. Have a good one. Bye.", "words": [], "utterances": null, "confidence": 0.943612722493423, "audio_duration": 1869.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Session on seamless customer service with Amazon Connect and Alexa. How AI ML could help to improve the customer experience. How to perform data driven and personalized customer services. How Amazon came to market with a simple to use omnichannel cloud contact center offering.\n- Cox Communications Alexa customer services. In the background we use the Amazon Alexa NLP bot to process the customer through custom security checks. And if the customer wants to speak to an agent, we seamlessly transfer this customer to an agents.\n- Alexa app user or customer can come in via phone call or customer chat. Using an AI service in the background, Amazon Kendra is able to provide that information to agents. Your monthly phone bill will cover the cost of your plan and additional services.\n- Customer service is a key to a success of any business. Customer needs to receive the right support at the right time. A happy customer is more likely to recommend your business to the others. Amazon Eptune helps you build that relationship mapping between the right customer to right agent.\n- \"I was just wondering, trying to see if 75 g package is something I should be using and what's the rate and see if that's something going to work for me \"\n- What do you see yourself using this for? Is this a personal use or is this for a business use case? I normally work from home and I've got two kids who are normally on their tabs watching YouTube. What we did here, we looked at how the customer agent was presented with information. It converted that inquiry into a sales.\n- An unhappy customer who is looking to leave the service. We have an offer available for you for a 30% discount for can entire year. I'm going to escalate this to our technical team and we will have somebody from the technical team reach out to you straight after this call.\n- We build a three dimensional relationship with the customer to see customer to sentiment, customer to product and customer to spend. And then we then pair up the agent to the customer call to be able to better serve that customer. AWS far AWS converting the inquiries to sales goes at the same time.\n- We looked at the Amazon Connect, the first truly omnichannel cloud contact sensor. How our customers are using it to deliver dynamic, natural and personalized experiences at call using ML technologies in the background. Thank you for tuning in and thanks to conf fourty two team for opportunity.", "auto_highlights_result": {"status": "success", "results": [{"count": 6, "rank": 0.12, "text": "customer agent", "timestamps": [{"start": 636188, "end": 636742}, {"start": 981698, "end": 982620}, {"start": 1048438, "end": 1049744}, {"start": 1282946, "end": 1283900}, {"start": 1328434, "end": 1329180}, {"start": 1331650, "end": 1332780}]}, {"count": 3, "rank": 0.12, "text": "customer services", "timestamps": [{"start": 33858, "end": 34742}, {"start": 512538, "end": 513540}, {"start": 927630, "end": 928588}]}, {"count": 1, "rank": 0.11, "text": "customer service centers", "timestamps": [{"start": 163348, "end": 164778}]}, {"count": 2, "rank": 0.11, "text": "Amazon customer service associates", "timestamps": [{"start": 156740, "end": 158842}, {"start": 244038, "end": 245606}]}, {"count": 3, "rank": 0.11, "text": "customer call", "timestamps": [{"start": 1015808, "end": 1016520}, {"start": 1074302, "end": 1075128}, {"start": 1648678, "end": 1649584}]}, {"count": 1, "rank": 0.11, "text": "exceptional customer service", "timestamps": [{"start": 170926, "end": 172130}]}, {"count": 1, "rank": 0.11, "text": "seamless customer service", "timestamps": [{"start": 24228, "end": 25350}]}, {"count": 4, "rank": 0.1, "text": "customer sentiment", "timestamps": [{"start": 878654, "end": 879316}, {"start": 1350630, "end": 1351388}, {"start": 1613722, "end": 1614704}, {"start": 1667038, "end": 1667604}]}, {"count": 1, "rank": 0.1, "text": "customer chat", "timestamps": [{"start": 833538, "end": 834296}]}, {"count": 2, "rank": 0.1, "text": "AWS customer", "timestamps": [{"start": 278732, "end": 279798}, {"start": 1179774, "end": 1180340}]}, {"count": 1, "rank": 0.1, "text": "customer package", "timestamps": [{"start": 1667652, "end": 1668276}]}, {"count": 5, "rank": 0.1, "text": "customer satisfaction", "timestamps": [{"start": 130508, "end": 131794}, {"start": 143168, "end": 144326}, {"start": 152426, "end": 153386}, {"start": 932738, "end": 933976}, {"start": 946902, "end": 947932}]}, {"count": 1, "rank": 0.1, "text": "end customers", "timestamps": [{"start": 326168, "end": 326738}]}, {"count": 1, "rank": 0.1, "text": "happy customers", "timestamps": [{"start": 1700662, "end": 1701424}]}, {"count": 1, "rank": 0.1, "text": "customer phone number", "timestamps": [{"start": 1824942, "end": 1825896}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}