{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/617750b0-6fe8-4834-ae3c-149412c18357", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["ais", "averting", "bias", "conf fourty two", "cuttingedge", "datahungry", "harnessing", "leaks", "models", "paycor", "perils", "pratik thantharate", "principal software engineer in test", "privacy", "propagation", "raises", "risks", "solutions", "unravels"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "57c9120f-b494-4060-af19-23d704f46545", "status": "completed", "error": null, "text": "My name is Pratik. Thank you. And I'm a principal software engineer in one of the leading human capital management companies in the US. I'm also an active researcher in the field of artificial intelligence DevOps machine learning and security. It's great to be here at Conf 42 machine learning conference and to discuss the important topic of large language model and the security risk that there is. So let's dive into my presentation. So today my topic is the privacy predicament with the transformative potential of large language models. So we are living in exciting times. With this advancement in AI, we find ourselves at a remarkable technological crossroad which is propelled by this large language models. This artificial intelligence marvels can engage in dialogue just like human, generate creative content, and even write a quote without any issues or error. With this, immense capabilities are overshadowed by trouble paradox, which is shielding this data. This model, which possesses a severe risk to the individual privacy and the human rights. As useful these models are, their OPEC training processes raises a significant privacy risk. And this is a privacy paradox that we need to grapple with. And one should ask like how we can take a full advantage of this large language models while protecting the people's privacy. Let's talk about the data privacy paradox. The training large language model involves ingesting a mind boggling amount of data, and which are randomly scrapped from the open source or Internet, like from the website, book, personal communication, you just name it. This unfiltered data absorption allows the model to inevitably memorize and spit out verbatim sensitive personal information, like credit card numbers, private messages, copyright materials and other defamatory content which is present in this training datasets. But the problem just don't stop here at this data leaks. These models are also absorbing and spreading the societal biases, stereotype and misinformation, which present in the massive amount of online data that they trained on. This private risk go beyond this individual information, and which includes discrimination and allowing misinformation to spread like wildfire across the Internet. So here is the profound paradox that we face. The discriminate data driving this model's extraordinary capabilities is also the very source of geopolitic, the privacy and the human rights of the societal human being striking a delicate balance. So let's find a balance, how we can maintain the capability of the LLM models and we can make it secure at the same time. So resolving this paradox requires like walking a tight rope. Excessively constraining this training data could undermine the models broad knowledge and hamper the performance. Yet unchecked this data ingestion possess unacceptable privacy risk. Technical approaches like data filtering, differential privacy and synthetic data can help to mitigate issues. But implementing this massive scale of the modern language models is computationally and logically it's very challenging. We may also need to accept that some calculated privacy trade offs are unavoidable, at least with this current method. The key will be developing a governance framework to assess and manage the risk appropriately for the different use cases, and this will be a collaborative effort. So let's talk about the transparency and the accountability challenges. Even when the privacy risk are from this training, data are reduced. The large language model present another major challenge. That these are the opaque black boxes, and their complexity makes it impossible to audit what is specific data influenced given output just to understand this machine reasoning process behind it. The lack of transparency fundamentally undermines the ability to ensure the safe, unbiased operation of the system and to hold them accountable when things go south. So techniques like water modeling, constant decoding and robust monitoring, this all could provide more visibility into this behavior. But ultimately, we must find ways to build transparency and auditability into the system from the ground up to secure privacy minded development practices. Let's talk about this devsecops for the responsibility development devsecops term is just like a dev operations with security. So when we are tackling this privacy paradox surrounding this language models, which demands a multifaceted, holistic solution with the principal governance framework on the tech side like this, continue research into privacy preserving training methods. The new secure machine learning techniques will be crucial. Perhaps more particularly, we must embrace like this devsecop practices that integrate the security, privacy and ethical AI principle into each and every phase of the software development cycle and building this LLM models. And this can be achieved through cross functional collaboration in parallel. Comprehensive AI governance framework align the technological development with the human values must be cooperatively developed by all stakeholders like firms, policymakers and the representative from the impacted communities. Only by combining this edge cutting solution with the rigorous governance, we can truly unleash the large language model's immense potential, while we are holding the privacy and this non discrimination and human right. Now, let's discuss about this governance framework and ethical principles as we stand. We understand the capabilities of large language models are incredible, we have all seen it. But we must maintain, we must remain constantly committed to confront that the privacy predicament that they present. Resolving this paradox is an urgent imperative that will shape the responsible development of the AI and for the generations to come through continuous innovation, holistic secure practices and ethical grounded governance we can place a trail alignment of transformative AI with the core human values. This makes no mistake, like path ahead will be immensely challenging, but our collective principles and commitment to prioritizing this humanity webping must light the way forward. And with the dedication and collaboration across the sectors, we can unlock the language large language model potential while maintaining the security at the same time in this digital world. In the conclusion, I would say together let's build a safer digital world.", "words": [], "utterances": null, "confidence": 0.90485408224674, "audio_duration": 517.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Pratik is a principal software engineer in one of the leading human capital management companies in the US. He is also an active researcher in the field of artificial intelligence DevOps machine learning and security. We discuss the important topic of large language model and the security risk that there is.\n- As useful these models are, their training processes raises a significant privacy risk. These models are also absorbing and spreading the societal biases, stereotype and misinformation. The key will be developing a governance framework to assess and manage the risk appropriately.\n- Large language model present another major challenge. complexity makes it impossible to audit what is specific data influenced given output. Comprehensive AI governance framework align the technological development with the human values must be cooperatively developed. Together let's build a safer digital world.", "auto_highlights_result": {"status": "success", "results": [{"count": 4, "rank": 0.09, "text": "large language model", "timestamps": [{"start": 54090, "end": 55642}, {"start": 131456, "end": 132488}, {"start": 291640, "end": 292856}, {"start": 502208, "end": 503264}]}, {"count": 1, "rank": 0.08, "text": "privacy minded development practices", "timestamps": [{"start": 341986, "end": 344454}]}, {"count": 1, "rank": 0.07, "text": "unacceptable privacy risk", "timestamps": [{"start": 241818, "end": 243834}]}, {"count": 1, "rank": 0.07, "text": "differential privacy", "timestamps": [{"start": 246274, "end": 247434}]}, {"count": 1, "rank": 0.07, "text": "language large language model potential", "timestamps": [{"start": 501432, "end": 504004}]}, {"count": 1, "rank": 0.07, "text": "synthetic data", "timestamps": [{"start": 247986, "end": 248826}]}, {"count": 1, "rank": 0.07, "text": "specific data", "timestamps": [{"start": 302504, "end": 303524}]}, {"count": 1, "rank": 0.07, "text": "data filtering", "timestamps": [{"start": 245122, "end": 246154}]}, {"count": 1, "rank": 0.07, "text": "online data", "timestamps": [{"start": 180702, "end": 181462}]}, {"count": 1, "rank": 0.06, "text": "Comprehensive AI governance framework", "timestamps": [{"start": 401236, "end": 403876}]}, {"count": 1, "rank": 0.06, "text": "training large language model", "timestamps": [{"start": 131152, "end": 132488}]}, {"count": 1, "rank": 0.06, "text": "data privacy paradox", "timestamps": [{"start": 129256, "end": 130824}]}, {"count": 1, "rank": 0.06, "text": "artificial intelligence DevOps machine learning", "timestamps": [{"start": 41690, "end": 44794}]}, {"count": 1, "rank": 0.05, "text": "modern language models", "timestamps": [{"start": 253944, "end": 255272}]}, {"count": 1, "rank": 0.05, "text": "ethical grounded governance", "timestamps": [{"start": 472186, "end": 474400}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}