{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/cbdc2aad-ba41-49db-ab42-ea0ab31a9d15", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["behind", "complexities", "conf fourty two", "enterprises", "experiences", "from", "insights", "mastering", "microsoft", "pramod nammi", "product", "product manager", "solutions", "strategies", "unleashing"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "238134de-0b6e-45b1-b8a2-c30d0c10f5bb", "status": "completed", "error": null, "text": "Hello everyone. Today we'll cover generalized product management for enterprises. So if you're a vm looking to incorporate Genai in your products or at your company, this presentation is a good overview of the field and what you should consider when building with Genai. Let's look at the agenda. First, we will cover what is Genai, what are the factors that led to its popularity? Whether it is just a hype or is there a long term trend here, we will also look into the impact of Genai on various industries. What are the benefits, and talk about some use cases, how they line up to revenue and cost factors for a company. Lastly, for product managers, we will understand what the risks are with Genaii, what you can do to mitigate them, and when you are building for them. Is there anything that you need to consider both for internal use cases and for your customers? So what is Genaida? It is a relatively new trend in the field of artificial intelligence. It is a system that learns from existing data and produces realistic versions of it that mimic the source data, but are not necessarily a duplicative or exact copies of the source data. This has huge potential for us, because we now can save a lot of time and energy when doing repetitive tasks, or creative tasks like producing images, music, speech and text. Genei is even perfect for coding, as it can learn from the patterns of any programming language, and you can design new applications and products using that capability. The most useful aspect, however, is the one that doesn't require a lot of technical knowledge to interact with Genai. It simply works by understanding natural language of a user. And so your user can just talk to the tool like they would with any other human being. Let's look at some of the underlying technology that makes Jennair really effective. Right? So we have gans. These are generative adversarial neural networks. This is a machine learning framework where you take a bunch of real images and generate fake ones that are realistic. And there is this thing called a discriminator, whose job is to try and catch fake ones. And as time progresses, the generator gets really good at fooling the discriminator, and the discriminator in turn gets really good at catching fake ones. And this creates a positive feedback loop. So over time, this results in being able to create highly realistic data using an existing dataset. Next, we have this other technology called variational auto encoders. This is another type of machine learning tool that can generate new data samples that are very much like the training dataset. This helps when we have a very limited data or we need to fill in gaps in the existing data so that we can train our machine learning models we have with enough data that can produce meaningful results. Then we come to LLMs. Right? This is the hot topic right now. LLMs are where all of this magic finally comes together in the hands of regular users, because with LLMs, you can now interact with these machine learning models in a human language, because the LLMs understand and can generate human language as well. And this is what has resulted in the trend that we now see in the form of conversational AI suggest chat GPT. Now, let's look at the surge in popularity. Why did Jenny become popular so suddenly in the recent years? Three things. Firstly, we have better algorithms now that are able to deal with vast amounts of data efficiently and produce high quality, realistic data that resembles the original data. And secondly, we have really great hardware now where GPU makers like Nvidia have come up with some incredibly powerful AI chips that can now train generative AI models at very large scale. And lastly, we have an abundance of data that is from decades of human generated content that is all available on the Internet now. So AI models can now be trained with this data. Now, let's look at where is the hype as predicted by Gartner. Now, if you looked into what Gartner is predicting, and Gartner is a research firm that deals with, that has a lot of expertise in technology and business feed published research about the trends that happen on time to time. And so, according to Gartner, a generative AI is in this region called the peak of inflated expectations. This is where everyone is talking about it. A lot of startups we are seeing entering in the space, a lot of businesses are considering using this technology, and there is a lot of promise and hope. And if you see what Gartner is predicting, is that Genai will reach this stage called the plateau of productivity in five to ten years. When any technology reaches the plateau of productivity, it means that it is going to be ubiquitous and we will all be interacting with it in some fashion on a daily basis. So there's a lot of promise, and this signals that Genei is here to stay. And let's look at some more predictions that Gartner has given in terms of what the adoption of Genei is going to be in the enterprise space. It is predicted that by the end of 2024, that is, this year, 40% of enterprise applications will have some form of conversational AI embedded within their systems, whether it is internal or external, facing towards users. And in 2025, 30% of enterprises will be implementing AI, augmented development and testing in their internal processes as they come up with new applications and products in. By 2026, 60% of enterprises will be incorporating Genai in their websites and mobile apps as well, which all companies now have such presence. So 60% is a very huge adoption figure. And by 2026 it is predicted that at least 100 million people will be interacting with robo colleagues or Jenny Eye pilot like scenarios as they go about doing their work. Which means right now we use tools like browsers and office and Windows and macOS, etcetera. But Genei is also going to become very popular and everyone's going to start using it as their go as a work tool. Lastly, by 2027 predicted that around 15% of all newly developed applications will be automatically generated by AI without any human involvement, which is a huge deal. Now let's look at some industries that are impacted by Genei and what potential use cases and applications that each of these industries will be seeing first. In the pharmaceutical industry, Genei can be used for drug discovery, clinical trial design and patient data analysis. This is a mainstay of the pharmaceutical industry and Genea is going to help the main core value products within this business and in the manufacturing sector. Genea can optimize production processes. It can automate repetitive tasks. It can help in quality control as well. In the field of media, Ji can generate articles, it can help authors and publishers draft content, come up with new ideas, change the language and tone, come up with personalized recommendations, and can even be a good brainstorming tool. In the field of architecture, Chenai can assist in design and in coming up with planning project planning for buildings, it can help. It can act as a good brainstorming tool for architects as they're going about their designs. Similarly, in interior design as well, right? You can imagine Genei helping interior designers come up with ideas very quickly for their clients. In the field of engineering, Chennai can help with product design, any simulations, the data that is needed for running simulations, it can fill in the gaps, it can do analysis on those simulations, can optimize various functions in the engineering disciplines. In the field of automobile and automotive industry, Chenai can help with vehicle design, can help with autonomous driving systems. We have Tesla and many other ev manufacturers now are venturing into this space, so that is a big adoption there as well. Similarly, for aerospace and defense, there are lots of flight simulations and optimizations and autonomous systems that can be benefited from the use of Genei. And in the field of medicine and being Genei can help assist in imaging analysis, we have x rays and MRI scans, etcetera. And Genei can help both patients and healthcare providers predict the progression of any disease or condition that a patient has. It can also help the patients get personalized treatment plans on behalf of the healthcare provider as well. Let's look at some benefits of Genai that are very relevant for enterprises. We talked about the applications previously, but what are the specific sectors within enterprise that can directly benefit? So first, as we discussed previously, product development can be greatly enhanced by Genai. It can be accelerated because with the help of coding assistance or by streamlining the design process and creating, helping enterprises create new product offerings within their core product by incorporating Genai to the customers. And then there's a field of customer experience where a lot of customers interact with the enterprises for support, and Genei can come and help with these interactions as well. Where when a customer is talking to the support team, the support agents can have a detailed case analysis of what this customer wants. The customer themselves can deal directly, first with the Genei assistant and probably be routed to the right pathways that the that the customer support team can then handle. And then employee productivity itself, right? Like for enterprises, when they incorporate Genai, all the employment employees can become much more efficient and automate their repetitive tasks. And employees can get intelligent insights reports without having to do a lot of number crunching. Let's dig deeper into some use cases. Right. What are the specific capabilities of Genei that we know today? First, we have this capability of Jennai, that is in writing, where Jenny, I can produce a draft output and you can even ask Jenny what business style should it be professional, should it be casual, what length should it be? Etcetera. And Jenny, I can get you started with a boilerplate draft, and then as an employee, you can start building on top of the draft. It can also help you in discovery if there's a vast amount of data, for example, internal employee wikis and knowledge bases. Employees can then directly ask a question, vision AI, and get the right answers neatly summarized, rather than having to find very specific article in our traditional search experience, it can manipulate tone and soften the language as we spoke about earlier as well. So employees don't have to spend a lot of time in really crafting their messages and their documents. Genei can easily take that load for you. And then next we have the capability of synthesis, which is where Genei can summarize vast amounts of data into easily consumable output. So it can shorten emails, it can shorten any conversations and chats that you're having internal company forums, any web pages that the company has. All of them can be neatly summarized and be made available to you on the fly. It can also simplify any rules, and if your company has lots of instructions for you as you're learning and onboarding into the company, it can simplify all of that and make those was easily digestible to you. So learning becomes much easier. It can also like classify and sort content right again, today, all of this is done manually. Somebody's going and adding these hashtags and sentiments, etcetera. But generally I can easily do that. And this is useful both for employees. It is useful for managers and HR who want to understand what the employee sentiment is around the company. It can help you even do sentiment analysis on your customer experience, on your user research. If customers are giving you feedback on reviews on public forums, you can easily start that now and get a sense of what the sentiment is. And similarly like in the support and customer care interactions, Genai can basically incorporated in the chat experiences now, we all have this experience where we interact with any company's customer care via chat experiences now. So with the presence of Genai, this all becomes much easy. Now, we have some advanced use cases as well. As we previously talked about, there's a field of coding, as we talked about. As developers within these companies are building applications, they can now use Genai as a copilot and help with the code generation, quickly finding the right documentation needed to move forward, etcetera. Some of the other things we don't have to get into, which we spoke about earlier as well. In the field of medicine and data science as well. Let's look at what problems Genei is solving. Right what are the right ways to think about? If you're a product manager, how do you think about incorporating Genai? These are the few ways in which you can do it. One, if you're a product manager, first, you can think about integrating Genai into your core products, which is you have existing products that your customers are already using, and you can think about how you can enhance their experience with those existing products with the help of Genaid. The other way is to create new product offerings entirely, whose main value proposition itself is Genai. So these are in addition to your existing line of products, and for which you can even charge a premium because customers get a much more productive and efficient experience. The other way to think about is employee efficiency. So if you're a product manager, you can think about how to solve these problems within your company itself rather than external facing. So you can think about how do you make your product team more efficient? How are they brainstorming? How are they, how are the developers, how fast are the developers in coming up with new products? And can you incorporate Genai in those workflows? That basically you can think about the first two, which is integrating in core products and integrating in new core new products as revenue generators and the employee efficiency. And the next one is process improvements as cost reduction genai in a revenue stream. Jenny. And then cost reduction Genii. Right, so as we talked about it, so what are the, how do we think about the Genii features and their capabilities? Right. Let's go a little bit deeper into that. Some of the Genii features which we previously talked about are automated summarization, for example. Right again, summarizing content for people being able to create new content. For example, your marketing team can now very quickly come up with new assets, new content and copy that can be used within the product, within your faqs and help centers and public landing pages. All of this can now be sped up dramatically. And then you can use the features of synthesis of information and you can get customer case summaries, insights and reporting about customers as well. Very quickly offer search in a natural language to your customers. Today, your customers might be searching for something and you're having to invest in a search experience that goes in indexes, all the search results. But with the help of Genai, you don't have to do that. You can. Your customers can speak in a natural language or type in a natural language. They should be able to find any data that they have with your company. A little fine tuning is required for this, but automated actions are a very good use case potentially in the future as well. So if you have products in the home automation space, or payments and productivity use cases like note taking apps, or to do lists, etcetera, or any office productivity applications, you can also think about automated actions that your customers can do. As I previously said, you can think about Genai capabilities into two categories. One is top line. Top line means that these are use cases where you can integrate Genai into your products, external facing products, which means you can therefore command new revenue. They augment your existing revenue streams. And then you can think about the other category as bottom line, which is integrating Genai into your internal company processes like business reporting, internal communications, knowledge management, feedback processing, customer support, etcetera. And in all these areas, Genai will reduce costs dramatically. So those are the two ways to think about it. If you're a product manager looking to incorporate Genai, in your day to day life, let's look about, let's look into some risks of Genaii, right? So if you're a product manager and if you're, whether it is internal or external, there are a few risks that you must be aware of. One is Genai need not always be accurate. The systems sometimes produce fabricated answers which we call as hallucinations now. So this is a big risk. If you're, if you're dealing with something very business critical, you need to be able to consider. You should be able to consider this before releasing your Genai features. The other aspect is bias. The data that is used to train the model can also be biased and this can influence the results in a negative way and impact the business operations significantly. Lastly, intellectual property, right? Sometimes it's possible depending on what model that you're using, whether it is in house or it is a third party LLM solution like OpenAI's solution, it is possible that the model that they're using can be ingested on some proprietary and sensitive information. And this can sometimes leak information. Sensitive information, or even the information that you are using or the customers are using to interact with Genei can inadvertently be used to train the model and therefore be available to others outside the company as well. So this has to be considered now with the risks in mind. Imagine you're a PM now and you're looking to integrate Chennai into your product and you want, and you're doing this with a goal to improve the customer experience or to reduce costs and make your internal processes more efficient. And you have identified a suitable LLM to power this experience. I would advise these as the next steps that you should take. First, I think you should thoroughly evaluate the LLM model that you have selected and you have to understand its capabilities and its limitations. As we talked about previously, some LLMs have different accuracies. They may be biased towards certain data sets, etcetera. So it's good to always assess the performance with respect to what your product needs to do. So you can think you can grade your LLM based on these aspects, right? How good is it at natural language processing? How good is it at content generation? How good is it with automation, for example, if that is your use case? Always good to think about accuracy and bias, as I said previously. Next, you have to define the use cases and user journeys very clearly. And it's good to document these use cases and share it with your team so that they're all aware and they're able to map out the user journey and the touch points where Genei can be seamlessly integrated, and again, this can be in the field of content creation, customer support, task automation, synthesis, summarization, or what have you. Next, you need to think about developing an AI strategy. I will go into this in detail sharply, but the idea here is to deploy Genei in a responsible fashion in a way that ensures transparency, accountability and user control. And we have to provide some mechanisms for customers to deal with inaccuracy or bias, etcetera. And we also have to ensure that the whole experience is private and no accidental leaks of confidential information happens when customers are entering their sensitive data in these prompts and when they're interacting with any. You also need to implement some governance and monitoring mechanisms where you should be overseeing the integration and the ongoing operation of GenaI within your product. This could be setting up dashboards to monitor continuously the model's performance, to continuously monitor what users are saying in their feedback when they're interacting with Genai, and always having a process to continuously improve those experiences. As we talked about it, when we say responsible AI, the goal here is to establish trust, because a lot of the times customers, customers have this distrust with anything that is AI, because again, they're scared that the results can be inaccurate, they're scared that it can be biased, or their sensitive content may be used to train the AI model and therefore some secret business secrets can be leaked externally. So what you should do is think about the following. First, make sure you add disclaimers in your products when you're using Genaid. These disclaimers should clearly communicate that AI generated content can be inaccurate and so that customers can manage their expectations and exercise some caution. Before using these results, you must implement some reporting tools so that when Jenny comes out with some result which the user finds harmful or violates their community policies or any other policies that may have, that they may have, they should be able to immediately report it and give you a reason why they think it is bad, for example. And you should be continuously monitoring these reports as well. You should also give fallback options to customers so that they are not completely reliant on AI powered experiences in order to get value from your product. There should be some fallback where a user can say, I don't want to use AI, but I still want to complete this job that I have for which I am paying you as a customer. Next criteria is transparency. You should provide clear messaging to users indicating when they're interacting with an AI system that, yeah, they are interacting with AI should not be behind the scenes. And invisible to the user. So it should be very clear that if they're, if a genai is being used, or an LLM is being used to provide an experience to the users, they should clearly know that in the UI, wherever possible and applicable, you should use citations and explanations. So if Jenny is giving a customer, your customers some results, or your employees some results, it is good to have a source from where this has come from, so that customers have that added layer of trust that this is coming from a known source, and it's not a mere hallucination by Genai. There are some deployment models that you should know about before you go about actually using an LL. The first one is off the shelf. This is where you're considering an LLM that is directly available in the market today, like for example, OpenAI or any other product. These models are already pre trained and they're not really aware of your business context or the customer's data. They're just off the shelf. Basically, the good thing with this is it provides a quick and easy way to integrate genai immediately and deliver value for your products or for your internal processes. Then we have fine tuned or bespoke models. In this case, the LLM is fine tuned with the data from the enterprise, and this significantly increases the output quality, because any prompts or any questions you have for AI, the answers will be highly relevant to you, because that AI knows the context about your company or your customers data, etcetera. And then we have instance based LLMs. Now, the instance based LLMs are a version of fine tuned bespoke models, but they have the added benefit of being run entirely in house. And therefore there is no risk of any sensitive data making to a competitor. Or in the case of off the shelf, you still have that risk. If you are giving some sensitive information in the, in the prompt itself, then that can be used to train the ALM and you have no control over it. But in the instance based model, you control all of these boundaries and therefore the data never leaves your instance. So these are the enterprise policies when Jennai should be adopted, right? When Jenny is being adopted. So if you're integrating internally within your company, or if you are a PM for an enterprise, for a b two b in a b two B space, you are. Customers will also expect these policies to be supported. One is to protect privacy, right? So in case of, if your product allows for users to upload images, and that is being processed by Genai, you have to ensure that if there are any faces, they are blurred and there's no potential to for the LLM to ingest these faces and then later output some other images using those faces. You should avoid sensitive data. Make sure that you again give disclaimers to your employees or your customers that hey, do not enter any sensitive data here, or being able to detect sensitive data and not even allowing Genai to actually get trained on that data. The other way to do this is also to secure data. You can even turn off logging at the LLM side so that if I enter a query or if I enter a prompt, the LLM merely processes the prompt and gives me an output, but will not store that prompt and therefore will not train the LLM. You can consider implementing your solution in that way also, and the next policy is to protect PII which is personally identifiable information. So when using Genei in your experiences, you have to make sure that you're not actually logging the user's sensitive information, like their name or their gender, where they are, their IP address. All of this should not be going to the NLM. You should also provide controls for the admins of your customers so that if they don't want to use Genai they should be able to turn it off. Or if they don't want to deploy Genai for all of the company, they should be able to control and configure who should be able to use it, what is the level of interactions that they can have, what is allowed and what is not allowed to be shared with this genei. So this is all good to have as a configurable admin control settings. That's it guys. This has been a discussion about. This has been a high level introduction about product management in the Genai space. Thank you for listening and I hope this was very useful to.", "words": [], "utterances": null, "confidence": 0.922775898566698, "audio_duration": 1607.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Genaida is a relatively new trend in the field of artificial intelligence. It is a system that learns from existing data and produces realistic versions of it. The most useful aspect is the one that doesn't require a lot of technical knowledge to interact with Genai. For product managers, we will understand what the risks are with Genaii.\n- Gartner predicts that Genai will reach this stage called the plateau of productivity in five to ten years. By 2026 it is predicted that at least 100 million people will be interacting with robo colleagues. This signals that Genei is here to stay.\n- Genei can be used for drug discovery, clinical trial design and patient data analysis. In the field of engineering, Chennai can help with product design. For aerospace and defense, there are lots of flight simulations and optimizing and autonomous systems that can be benefited from the use of Genei.\n- Genei can help enterprises create new product offerings within their core product by incorporating Genai to the customers. Employees can get intelligent insights reports without having to do a lot of number crunching. The main value of Genai is to create new products entirely.\n- You can think about Genai capabilities into two categories. Top line means that these are use cases where you can integrate Genai into your products. Bottom line is integrating Genaii into your internal company processes. There are a few risks that you must be aware of.\n- First, evaluate the LLM model that you have selected. Always good to think about accuracy and bias. Next, define the use cases and user journeys very clearly. Deploy Genei in a responsible fashion in a way that ensures transparency, accountability and user control.\n- When using Genei in your experiences, you have to make sure that you're not actually logging the user's sensitive information. You should also provide controls for the admins of your customers. This has been a high level introduction about product management in the Genai space.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.07, "text": "new core new products", "timestamps": [{"start": 864724, "end": 866356}]}, {"count": 2, "rank": 0.06, "text": "new products", "timestamps": [{"start": 855260, "end": 855716}, {"start": 865540, "end": 866356}]}, {"count": 3, "rank": 0.06, "text": "customer experience", "timestamps": [{"start": 571610, "end": 572314}, {"start": 735296, "end": 736404}, {"start": 1107708, "end": 1108532}]}, {"count": 2, "rank": 0.06, "text": "new product offerings", "timestamps": [{"start": 565500, "end": 566650}, {"start": 819814, "end": 820910}]}, {"count": 1, "rank": 0.06, "text": "customer case summaries", "timestamps": [{"start": 919456, "end": 920688}]}, {"count": 3, "rank": 0.06, "text": "customer support", "timestamps": [{"start": 596042, "end": 596642}, {"start": 1004818, "end": 1005442}, {"start": 1176646, "end": 1177574}]}, {"count": 1, "rank": 0.06, "text": "product design", "timestamps": [{"start": 482552, "end": 483424}]}, {"count": 2, "rank": 0.06, "text": "existing products", "timestamps": [{"start": 809134, "end": 809870}, {"start": 815422, "end": 816246}]}, {"count": 25, "rank": 0.06, "text": "customers", "timestamps": [{"start": 77330, "end": 78094}, {"start": 569658, "end": 570394}, {"start": 572930, "end": 573298}, {"start": 738170, "end": 738506}, {"start": 810270, "end": 810590}, {"start": 832342, "end": 832790}, {"start": 922200, "end": 922648}, {"start": 927552, "end": 928136}, {"start": 928792, "end": 929168}, {"start": 939270, "end": 939614}, {"start": 969924, "end": 970260}, {"start": 1083770, "end": 1084090}, {"start": 1202480, "end": 1202928}, {"start": 1214240, "end": 1214640}, {"start": 1250370, "end": 1250644}, {"start": 1250674, "end": 1250904}, {"start": 1285652, "end": 1286020}, {"start": 1317790, "end": 1318502}, {"start": 1360512, "end": 1360904}, {"start": 1369154, "end": 1369578}, {"start": 1401520, "end": 1401960}, {"start": 1433696, "end": 1434320}, {"start": 1484736, "end": 1485214}, {"start": 1516072, "end": 1516488}, {"start": 1572194, "end": 1572666}]}, {"count": 2, "rank": 0.05, "text": "core products", "timestamps": [{"start": 807214, "end": 807974}, {"start": 862780, "end": 863412}]}, {"count": 1, "rank": 0.05, "text": "product managers", "timestamps": [{"start": 65642, "end": 66546}]}, {"count": 5, "rank": 0.05, "text": "sensitive data", "timestamps": [{"start": 1215472, "end": 1216280}, {"start": 1449696, "end": 1450488}, {"start": 1511488, "end": 1512360}, {"start": 1517792, "end": 1518536}, {"start": 1520856, "end": 1521552}]}, {"count": 2, "rank": 0.05, "text": "product management", "timestamps": [{"start": 29728, "end": 30424}, {"start": 1601244, "end": 1601916}]}, {"count": 2, "rank": 0.05, "text": "existing data", "timestamps": [{"start": 86594, "end": 87442}, {"start": 191002, "end": 192030}]}, {"count": 1, "rank": 0.05, "text": "Genei helping interior designers", "timestamps": [{"start": 474926, "end": 476718}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}