{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/0a0de321-3280-428e-8fc3-23b8b3e33df4", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["behind", "conf fourty two", "datadog", "differences", "grafana", "including", "kubernetes", "michael levan", "monitoring", "opentelemetry", "production", "prometheus", "tools", "trainer consultant content creator", "understand", "using", "youll"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "46d96145-dc91-4c78-a6c9-9607d68a4dce", "status": "completed", "error": null, "text": "Monitoring observability. It's obviously incredibly crucial whether you're on prem cloud kubernetes, standard containers, wherever you're running, you need to understand what's happening in your environment, whether it's monitoring. So graphs, alerting, seeing everything on a screen, understanding what's happening from that perspective, or observability, which is more around the idea of taking action. My name is Michael Levan. Welcome to my session at Conf 42. We're going to dive into a bunch of hands on stuff, but primarily I'm going to show two different realms of focus. The homegrown or open source style solutions and the enterprise solutions. We're going to walk through installing both. We're going to do data dog on Q Prometheus and we're going to talk about the differences, which should hopefully help you decide which one you're going to go within your organization. Let's go ahead and jump right in. Let's start by diving into cube Prometheus. Alright, so I'm going to open up my terminal, do a quick cube Ctl, get nodes here we can see I am on an EKS cluster. It's not going to matter though, if you're on aks GkE on prem, all these steps should be relatively similar. Okay, so the first thing that you're going to do, you're going to want to add the helm chart for Q Prometheus. I essentially do everything via helm chart. Why? It's a great package manager. It's much better than just going and calling out to a bunch of kubernetes manifests. And instead of again using 567 different kubernetes manifests, everything is under one roof. So I typically go with helm charts. Next, going to go ahead and update the repo. Once that's done, we will install Cube Prometheus. Okay, now as the name sounds, Cube Prometheus is going to be a combination of Prometheus and grafana. Can you install these separate? Absolutely. But the reason why I actually like to do it together is because Kube Prometheus gives you a bunch of dashboards out of the box that are all kubernetes related. So let's say I just install Grafana and Prometheus separately. I'm not going to have any dashboards, but if I install Kube Prometheus, it comes again pre installed with all these different Kubernetes dashboards, which we'll go ahead and take a look at in a second. And once this is installed, it takes of course a little bit because there's a bunch of different pods that need to come up. You can forward and look at Prometheus via port forwarding, or you can just go ahead and hit Grafana, right? So let's go ahead and do this. That way we can get a nice visual, right? And then let me go ahead and open up a web browser. Web browser is up. We can see that here. I'm going to go ahead and just take a look here. To log in, the default username is admin, password is prom operator. So admin from hyphen operator. And now we're logged in. So what I was referring to before, if I go to dashboards, notice here how I have all these different Kubernetes dashboards. You will not have this by default. And of course if you want to, you can import a new one. So for example, if we just take a look here, we have the argo cd dashboard, for example. So what I can do is I can actually copy the iD, go back new, import, paste that id in load, you can see it is in fact argo cd import, and then boom, we have the dashboard. So it's pretty straightforward. You can also write your own dashboards. I believe they're still written in Python, at least they used to be, but nonetheless you can create your own. But there are a lot out there already, so don't reinvent the wheel if you don't have to. But if I go back to dashboards here and let's say I click on Kubernetes API server. Now, I haven't made any requests or anything to this, so it's probably not the best, but we can see here again, another dashboard, compute resources, some cpu information, some memory information, etcetera. But point being is we can see the dashboards work and then if we want to, we can get alerting on various dashboards and all that fun stuff. So this is the monitoring piece, and if you want the full observability stack for logs, traces, metrics, you're gonna have to do prometheus, which is already here, and then tempo and low key for traces and logging, and then you'll have the full monitoring and observability stack. But there are a couple things here, and it's not necessarily a bad thing, it's just you got to kind of figure out what option you want. So this is the homegrown solution. This is open source. I'm not paying for anything, okay? But I actually am, right? I'm paying for engineers to manage it, I'm paying for infrastructure, because this has to run somewhere, so there are still costs. And again, this isn't a bad thing. It's just all going to be dependent on your organization. If you're a startup, for example, and everybody's already working 13 hours a day, adding another tool may not be the best method. Or maybe it is, again, depending on how the organization is structured. So let's say you want all these tools, monitoring and observability and even APM and alerting and a bunch of other stuff under one roof. Maybe it's a SaaS so you don't have to manage the infrastructure or anything like that. Probably want to look at a enterprise paid solution. Okay. And that's kind of what we can get with Datadog. Now, with Datadog, again, we get everything under one roof, metrics, logs, full monitors, service management, infrastructure management, APM, all of it. All we have to do for this is if I go under my and I click on API keys, right? I'm going to have an API key here. I'll go ahead and I'll just create a new one. We'll just call it con 42 create key, right? And then now I have this API key. So if I copy it, I'm going to head back over to versus code. Okay. And I'm just open up a new terminal here and I'm going to paste in that API key, my cluster name, ks. Quick start. Okay, first thing you're going to want to do, going to want to sign up for Datadog. It's free to sign up. You're not going to be paying for anything. I've been doing demos on Datadog for a long time now and haven't got a bill because I just delete my stuff right away. Okay. But I'm going to set these environment variables. I'm going to use helm. Okay. So if you don't have the data dog helm chart, you're going to want to add it and update it. And then I'm going to use this fairly large helm installation. And the reason why is because this sets us up for high availability. So we're going to see, you know, multiple replicas, cube state metrics is enabled, we're enabling logging, we're enabling all the logs for the containers. So let's go ahead and run this and it may take maybe two to three minutes to actually see all the information within your environment. Right? So if I head back over here, I click finish, I'm going to go to dashboard. Oops, sorry, infrastructure and kubernetes explorer. Okay. And we can actually see all this stuff in here right away, but I want to click on one other. Let's see kubernetes overview. Okay, here it is. So if I check here, I can see my cluster, I can see all my namespaces. See the monitoring namespace, right. Because we deployed Q Prometheus. And then if I click on explore, I can see everything running here. So if I look into one of these pods, maybe, you know, one of the Q Prometheus pods, we can see the cluster, it's on the service that it's in. Well in back of the monitoring namespace, the host, the deployment, replica sets, ips, everything. We can see everything here, even the metadata. Okay. We can see any related resources which this is actually really cool. It's a little graph here that we can see. Right. Troubleshooter. I don't think we have anything on. Status is ready. Alright, so we're good to go here. So we have the pod phase, which is actually nice. We get a little bit of different information here, logs, if we turn them on. So any logs that are coming in through the pod, okay, metrics, etcetera. So point being is this, we have everything under one roof. Of course if we install it, we have to install different things for trace and stuff. But everything is under one roof. Okay. So we can dive down. We also have a visual of this, right? So we dive down, we see our clusters running, we see our namespaces, see all of our workloads. Okay. We see our networking. And this is really solid. Now, Datadog is expensive, don't get me wrong. But again, this is a good implementation. If you want that enterprise, I don't even want to say enterprise grade feel because you can get the same feel from Grafana and the Prometheus stack. But if you want that SaaS based solution that's set up for you, you just have to run a couple of installations or even just one. You got support behind you all that. Data dog is a great implementation. Again, just keep in mind, you know, never think that you're not paying because I know a lot of people go open source because they don't want to pay. Either way you're paying. You're either paying engineers to manage it and the infrastructure to run it on, or you're paying a SaaS solution. It's really going to be up to you at the end of the day. Thank you so much for joining me for the session. Really do appreciate it. Hope that you enjoyed it.", "words": [], "utterances": null, "confidence": 0.927894811764704, "audio_duration": 623.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Monitoring observability. It's obviously incredibly crucial whether you're on prem cloud kubernetes or standard containers. The homegrown or open source style solutions and the enterprise solutions. We're going to walk through installing both.\n-  Cube Prometheus is a combination of Prometheus and grafana. It gives you a bunch of dashboards out of the box that are all kubernetes related. You can also write your own dashboards. It's open source, but there are still costs.\n- Mark: First thing you're going to want to do is sign up for Datadog. This sets us up for high availability. We have everything under one roof. If you want that enterprise grade feel, you can use a SaaS solution.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.07, "text": "Cube Prometheus", "timestamps": [{"start": 83198, "end": 84686}, {"start": 128782, "end": 129774}, {"start": 133174, "end": 134414}]}, {"count": 2, "rank": 0.07, "text": "Kube Prometheus", "timestamps": [{"start": 145412, "end": 146372}, {"start": 157436, "end": 158244}]}, {"count": 1, "rank": 0.06, "text": "different information", "timestamps": [{"start": 533436, "end": 534172}]}, {"count": 1, "rank": 0.06, "text": "different things", "timestamps": [{"start": 551012, "end": 551420}]}, {"count": 1, "rank": 0.06, "text": "different pods", "timestamps": [{"start": 169956, "end": 170404}]}, {"count": 1, "rank": 0.06, "text": "various dashboards", "timestamps": [{"start": 277550, "end": 278590}]}, {"count": 3, "rank": 0.05, "text": "helm chart", "timestamps": [{"start": 103790, "end": 104286}, {"start": 107846, "end": 108798}, {"start": 426340, "end": 426772}]}, {"count": 1, "rank": 0.05, "text": "API keys", "timestamps": [{"start": 373536, "end": 374736}]}, {"count": 2, "rank": 0.05, "text": "observability stack", "timestamps": [{"start": 283766, "end": 284886}, {"start": 296318, "end": 297470}]}, {"count": 1, "rank": 0.05, "text": "Kubernetes API server", "timestamps": [{"start": 258638, "end": 260070}]}, {"count": 3, "rank": 0.05, "text": "open source", "timestamps": [{"start": 65814, "end": 66374}, {"start": 306582, "end": 307110}, {"start": 606822, "end": 607310}]}, {"count": 1, "rank": 0.05, "text": "infrastructure management", "timestamps": [{"start": 365824, "end": 366968}]}, {"count": 1, "rank": 0.05, "text": "argo cd import", "timestamps": [{"start": 240010, "end": 241626}]}, {"count": 4, "rank": 0.04, "text": "solution", "timestamps": [{"start": 305606, "end": 306086}, {"start": 352486, "end": 352822}, {"start": 590214, "end": 590566}, {"start": 615796, "end": 616276}]}, {"count": 1, "rank": 0.04, "text": "other stuff", "timestamps": [{"start": 342526, "end": 343222}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}