{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/009c34ca-d5b2-41eb-91cb-5f8d1fff363f", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["apis", "applications", "areas", "automated", "based", "be", "benefits", "business", "by", "calculated", "calculates", "called", "can", "capability", "challenges", "cloud", "conf fourty two", "configurable", "continuously", "costefficiently", "crossindustry", "ctocdioit", "customizable", "dashboards", "deliveries", "delivering", "developed", "devsecops", "entries", "existing", "features", "from", "has", "head of application portfolio composition", "identified", "implemented", "industryagnostic", "industryindependent", "introducing", "jira", "juan", "juan antonio conde", "kpis", "mins", "nextgen", "opportunities", "organizationbusiness", "platformtechnology", "prevailing", "produced", "programming", "reports", "sandeep", "sandeep panghal", "senior engagement manager", "sprints", "surveyquestionaire", "tata consultancy services", "tcs", "technologies", "tools", "unitsapplications", "userfriendly", "using", "zurich", "zurich insurance group"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "a289e08e-55f1-41be-b06a-4c1d46c13aa4", "status": "completed", "error": null, "text": "You. Hello everybody. First of all, thank you for inviting us to present in the 42 Devsecops 2023 event. So today we are going to explain you a bit about our case. And to do so, I'm having here with me Sandeep Panghal, which is managing consultant within tcs and myself Juan Antonio Conde, head head head head head of application portfolio composition. We enter into the case. So let's provide a brief update on where we are with who we are. So Zurich is a little more deliveries insurance that serve its customer in a global and local market. Funded in 1872 with about 56,000 employees, it provides a wide range of property and casualty and life insurance products and services in more than 210 countries and territories. Sandeep, I will hand over to you to provide a brief update on Tata and then we can go into the case. Yeah, Tata Tata Tata Tata Consultancy Services World renowned Tata Group is a global it services consulting and business solution provider who has been building greater futures through innovations and knowledge for over 50 plus years. So we have been recommended has a top two most valuable brand in 2022 with a market capitalization of 144 billion with a revenue of 25 plus billion dollars in FY 2022. So we are a company of 600,000 plus employees representing 150 plus nationalities with a 35 plus diversity percentage. So we are a company who has spreaded its wings across all the industries ranging from BFSI, retail, manufacturing. So whatever you name it, TCS is there with BFSI predominantly dominating in the revenue market. So if I talk about from the geographical area. So we have spread it across the globe with the major businesses working, coming from the North America followed by Europe, continental Europe as well as the Asia. So we have been ranked as a top 20 future brand in the index 2021 and has been ranked as a top hundred as a leader by the research firms. Moving on. Basically now I will be giving you a walkthrough about our automated Devsecops maturity assessment, about the background, basically how we came out talk about this solution. So basically here is our CTO or CIO of an organization who is thinking that how do I know about Devsecops adoption of the business unit functions or the entire organization? How matured am I organization in Devsecops with respect to industry standards? How do I compare business units in terms of future investment? Which business units, applications or the platforms are less efficient with lower quality and lower production deliveries and the vice versa? Where I need to invest more? How can I benchmark each business unit application or the functions against each other or with other insurance providers or moreover with other industries. Can I have some kind of a point in time? Dashboards, automated continuous dashboard with neo human error. So this was the background. Now, if I talk about the problem statement, there are no standard setup developed matrices which can be applied across the business units which have been globally spreaded across the different countries for using. And there isn't any harmonization of the Devsecops adoption view of the organizationbusiness and the matrices which are being produced with the big manual efforts due to the multiple data sources, due to the complexities of the various applications, diverse landscapes and the tools used across the various business units. And the teams are focusing on introducing mattresses and the measurement rather than on the production deliveries. So in order to resolve this problem, here we have Juan who will be talking about the solution. So yeah, so Sandeep went through the problem statement. What were the major headaches that it brings to our organization? But I'm pretty sure that that's something that is common across quite a lot of companies worldwide, especially if they are big corporations. So after many different meetings with quite a lot of different stakeholders across Zurich, but also we engage with many different partners to confirm the direction to follow. So we have been talking with key reference partners and consultant firms around the globe. So it came up on the solution has indeed said that we need to build something that brings automation on how we produce metrics that is tool agnostic and just provide the metrics that we require, but also providing the flexibility in case that we need to adjust the metrics. And here it is where data hoop, which is the product that we have built from scratch, is coming into the picture. So first of all we thought, okay, so how we are going to be building something new. Of course this needs to be cloud based, needs to be scalable, agnostic of technologies, underlying technologies, but of course flexible enough to integrate with the different DevOps tools that we are having in the market. Also code quality tools, security testing tools, different testing tools that we can incorporate into data hook in terms of data points or metadata retrieve from data hook. In one side we have the technology, but in the other side we have been designing data hook with the customer in mind. So of course we have been applying design thinking and user experience principles. It has been secured by design. So in the sense that we protect the business units, data or group data to don't be shared with others, at least that we are interested providing benchmarks also from global organization to the business units to the teams without compromising that anonymization of data to be presented from one group to another. It has been also user friendly error reports produced in order to make business units application teams understand why they are not seeing their data within the dashboard, how they can improve the way that they are doing things. All right? And this has been the main purpose of data hook. So create a tool that provides the application team, the business units it heads, but also the group leaders information about how we are doing developed in our corporation. So what is our development efficiency? So the benefits that data hoop brings to organization. And you can see some of them here on this slide. And I have been referring to some of those already. So faster agile adoption. So of course, I'm pretty sure that many big corporations like us can think, hey, how agile is our organization? How many agile applications do we have? Right? So with Datacoop, we have been able to not only identify how our teams are applying those agile behaviors on the different tools that we are using to do software development, but also to do project management. We have been also able to incorporate other disciplines like how automated processes are, how we are doing testing across the different applications and teams. Right? So once you know the data, of course you can improve, which is describe the continuously improvement behavior. But as I mentioned earlier, so that allow us really to compare with the different units, the different teams, and not just with the aim of knowing where we are, also with the aim of course, always to improve. And of course last but not least, so we have been able to produce metric at a scale almost with no effort or with a very little effort on the team side. All right. The outcome up to date about what we have done. So here you have some figures so we have implemented or we have onboarded within data hook. I would say that right now it's a bit more than 200 applications from twelve business units has been assessed. The monthly onboarding ratio is about 20% plus 20%. The onboarding process for new application is automated through Azure pipeline. So almost an onboarding of an application can be performed without any manual intervention. Metrics related to customer value, organizational effectiveness, service quality, measurement areas continuously from several tool sets. So we are retrieving data on a regular basis, on a monthly basis and we are producing those metrics to our different teams, global business units and department benchmark is available for test, SEc ops adoption, maturity assessment. Lead time to market KPIs decreased by 9% over the last nine months. So we're here becoming faster. So this is going back to the continuous improvement that we have seen on the previous slide and then also we have identified up to 10% month to month increase in technical, therefore 20 plus business areas over the last year. So those numbers areas just reflecting the adoption of data who within Zurich. And this well is more to come within the next months and years. So hopefully this has been something interesting for you. Thank you very much for listening us and if you are interested to know a bit more about data hook. So here you have our email address. Feel free to reach out. I will be more than happy to get in contact with you and to provide more details about how we have implemented data hook in our corporation. Thank you very much.", "words": [], "utterances": null, "confidence": 0.937027797927463, "audio_duration": 671.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Tata Group is a global it services consulting and business solution provider. With a market capitalization of 144 billion with a revenue of 25 plus billion dollars in FY 2022. The company has spreaded its wings across all the industries ranging from BFSI, retail, manufacturing. Today we are going to explain you a bit about our case.\n- An automated continuous dashboard with neo human error. There are no standard setup developed matrices which can be applied across the business units. There isn't any harmonization of the Devsecops adoption view of the organization. Here we have Juan who will be talking about the solution.\n- Data hoop is a tool that provides the application team, the business units it heads, but also the group leaders information about how we are doing developed in our corporation. The benefits that data hoop brings to organization include faster agile adoption.\n- More than 200 applications from twelve business units has been assessed. Monthly onboarding ratio is about 20% plus 20%. Lead time to market KPIs decreased by 9% over the last nine months. More to come within the next months and years.\n- Thank you very much for listening us and if you are interested to know a bit more about data hook. Here you have our email address. Feel free to reach out. I will be more than happy to get in contact with you.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "business units application teams", "timestamps": [{"start": 447120, "end": 449318}]}, {"count": 1, "rank": 0.08, "text": "global business units", "timestamps": [{"start": 607970, "end": 609674}]}, {"count": 10, "rank": 0.08, "text": "business units", "timestamps": [{"start": 216430, "end": 217342}, {"start": 221032, "end": 221902}, {"start": 265752, "end": 266494}, {"start": 293606, "end": 294838}, {"start": 420712, "end": 421582}, {"start": 432028, "end": 432802}, {"start": 447120, "end": 448070}, {"start": 463928, "end": 464974}, {"start": 572056, "end": 572814}, {"start": 608922, "end": 609674}]}, {"count": 1, "rank": 0.07, "text": "different testing tools", "timestamps": [{"start": 394262, "end": 395686}]}, {"count": 7, "rank": 0.07, "text": "data hook", "timestamps": [{"start": 397744, "end": 398486}, {"start": 401872, "end": 402890}, {"start": 408378, "end": 409034}, {"start": 459508, "end": 460026}, {"start": 566056, "end": 567090}, {"start": 657812, "end": 658426}, {"start": 669418, "end": 669994}]}, {"count": 1, "rank": 0.07, "text": "many different partners", "timestamps": [{"start": 333788, "end": 335430}]}, {"count": 1, "rank": 0.07, "text": "business solution provider", "timestamps": [{"start": 106980, "end": 108394}]}, {"count": 1, "rank": 0.06, "text": "data points", "timestamps": [{"start": 399216, "end": 399850}]}, {"count": 1, "rank": 0.06, "text": "group data", "timestamps": [{"start": 422552, "end": 423170}]}, {"count": 1, "rank": 0.06, "text": "many different meetings", "timestamps": [{"start": 327370, "end": 328514}]}, {"count": 1, "rank": 0.06, "text": "Tata Tata Tata Tata Consultancy Services", "timestamps": [{"start": 99696, "end": 101982}]}, {"count": 1, "rank": 0.06, "text": "Tata Tata Tata Tata Consultancy Services World renowned Tata Group", "timestamps": [{"start": 99696, "end": 103822}]}, {"count": 1, "rank": 0.06, "text": "new application", "timestamps": [{"start": 583132, "end": 583718}]}, {"count": 5, "rank": 0.06, "text": "applications", "timestamps": [{"start": 221966, "end": 222526}, {"start": 289382, "end": 290310}, {"start": 496742, "end": 497206}, {"start": 522600, "end": 523166}, {"start": 570920, "end": 571486}]}, {"count": 1, "rank": 0.06, "text": "different stakeholders", "timestamps": [{"start": 329468, "end": 330562}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}