{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/ad6d760f-b5a9-4ad8-bf80-ed7f08c6db1c", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["archit srivastava", "be", "between", "boon", "boundaries", "brain", "break", "can", "child", "completely", "computing", "conf fourty two", "constantly", "data analyst", "domains", "fields", "has", "hewlett packard enterprise aiqyam", "ignotis", "ignotus", "in ignotis", "paths", "possibilities", "realise", "relm", "these", "things", "tough", "true", "two", "unimaginable", "unknown", "unleash", "was"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "d30135ef-00aa-4dbe-8880-0a636db345a5", "status": "completed", "error": null, "text": "So hello all. Good morning, good evening and good afternoon in wherever time zone you are. So, my name is Archit Srivastava and today I'll be taking you through my talk. And the topic of the talk is in ignotis. And the talk is basically an introduction about how quantum computers can be helpful in the fields of astrophysics. And the meaning of the word in ignotis is into the unknown. So it is actually an area which is very unknown to us, like how can quantum computers be used utilized in the area of astrophysics? So let us move forward with the topic. So, a basic introduction about me. So who I am, where I work, and what all things I have done in the past. So I am one of the founders of a quantum hardware community called as Akim. And at AKM we basically try to spread awareness about what the quantum hardware architecture is. And we basically research about different quantum hardware architectures like photonics, iron trap, superconducting. And we basically dive deep into how these different quantum architectures work especially. I graduated with a bachelor's of engineering degree in electronics and instrumentation engineering from RV College of Engineering, Bangalore. And me, along with one of my colleagues, we started off a quantum research club, and its name was circuit. So circuit is an abbreviation for center for interdisciplinary research in quantum information and technology. And over there, we had different verticals which focus more on different areas of quantum computing, to be specific, like quantum machine learning, quantum optimization, quantum algorithms and all. And I got associated in my final years of college with a community called as quantum Computing India. And over there, along with a few of my colleagues, we started off the quantum hardware learning circle, where we focused more about the growth and what all things are going on in the quantum hardware domains. And in my final years of college, also, I was one of the first quantum computing interns at the Boon QSI Private Limited, which is one of the leading quantum computing firms in the computing fluid dynamics area. And the vision, the mission, the aim that they have and they are trying to achieve is fabulous, and they are doing great in this field right now. And the research that they do at their firm is one of the best in the industry, which is basically collaborating the research field, research domain and the industry together. And the problem statements that they're tackling is going to help the humanity and the industry and the research area in general in the coming future. Currently, I work as full stack data engineer at Hewlett Beckert Enterprise in the Silicon Valley of India, Bangalore, in the state of Karnataka. And my day two day work basically deals with anywhere from developing dashboards and performing data analytics work, to developing machine learning models and trying to predict some certain trends, and parallel developing data engineering pipelines so that to perform specific ETL tasks. My personal interest lies in the area of the field where we can integrate quantum computing with the field of gravitational wave astronomy. So these two are very vast fields, and a lot of scientists in these past have tried to integrate these two fields together to basically get to a one unison field so that we can explore what the limits of physics are and how we can break them so that we can explore the unknown. Hence the title of the topic. So, moving forward with the topic, basically. So, the motivation behind this talk was basically to reduce the lack of knowledge that is there, that is out there with the quantum ecosystem in general and the need for the growth in the domain. Like, we get to hear that if we combine quantum with artificial intelligence or even general artificial intelligence, we basically can develop certain systems which will take over humanity, and a lot of stuff and misinformation going around. And my personal opinion is we are years behind this particular years behind actually getting to leverage the actual advantages what a quantum computer can provide to us, and then coming more to specifics of the topics. So there is can increase in the need to spread awareness about the various topics related to quantum computing and astrophysics. So in the industry currently, we get to see a lot of use cases of quantum computing being placed in the fields of, say, finance, supply chain optimization, or various fields like pharma, getting to know about the protein folding examples, and various places quantum computers are being used currently. But there is a very niche area where quantum computers can become a big asset, is the area of astrophysics and gravitational wave astronomy, where, if the research is done in the right way, with the correct motivation, then I personally believe that we can develop certain tools, certain experiments, or certain methods which can experimentally verify certain theories of physics, like the quantum gravity, or even the theory of everything. That is sort of a hypothesis that people are yet to prove and yet to achieve. So, moving on with the topic, what we have in the topic today is. So if I give you a brief about what the contents will be. So, basically, I'll be giving a brief introduction about what the whole talk will be about. Then we'll dive a bit deep in what quantum computers are, and I'm sure that my fellow colleagues, in different talks have talked about quantum a lot. So in the third segment of the talk, I'll be focusing a bit more on where quantum computers can work and what this term ligo or Ligo means and why astrophysics at all? And the methods in which quantum computing can be included in astrophysics. And what are the final conclusions with the talk that we has today? Moving on with the topic, so, basically giving a brief introduction about the talk today. So, quantum computing and astrophysics. So, astrophysics is basically the science which deals with the mathematics related two celestial bodies and everything related to them. Even the mathematical analysis of, say, black holes or even relativity or it is a very vast area, and it is basically on a scale. If we try to look, it is at a totally right hand side. And if we look at quantum computing or quantum physics in general, the quantum physics lies on the extreme left. So these two fields are basically at the extremes of these physics that we have today. And what scientists believe that if we are able to combine and unify these two extreme fields, then we'll be able to get to explore the unknown that is out there in the field of science and explain a lot of unknown phenomenon that happen in nature. Currently, we have heard about a lot of developments in past while going through the noble price distributions that happen. So we might have heard about the terms lIgo, or gravitational wave detectors, and along with quantum computers. So these are different terms that have been floating around from the past couple of years. And these are very complex and complicated devices to perform totally different and very difficult tasks. Like LIgo are very big detectors out there, which basically help us to detect the gravitational waves that Einstein predicted in his theories. And quantum computers are basically an ensemble of various equipments, chips and cutting edge technology, engineering science, physics to basically leverage out the advantages being provided by quantum physics to perform quantum operations and give us the advantages that it can provide to us, so that we can use them for daily use cases like predictions in the area of quantum machine learning and encryption, which is a very niche area in quantum computing right now. There are different architectures of quantum computers also. And what is quantum gravity? So, quantum gravity is a hypothetical theory that scientists have developed, which basically is at the intersection of quantum physics and astrophysics, or specifically gravity. So they try to predict that there can be the existence of a particle for gravity and called as graviton. And if that exists, then it basically will complete the theory and combine the two vast theories of general and special relativity along with quantum computing. So, basically, there is a need to investigate the realm of the unknown, hence the topic of the talk. And it is a very niche area of research, which has infinite possibilities. So, moving on with the topic, these talk so giving a brief introduction of what the quantum is. So this is a quantum computer. Well, actually not, because this is a part of quantum computer. And right beside, right at the below, we have the chip. And this actually is a picture which shows us the inside of what a quantum computer looks like inside the. So basically, this is called as the golden chandelier, because majority of the components are created out of gold. And right there below sits the quantum child, and the temperature decreases as we move down the chandelier, and below it is nearly absolute zero. So this is a part of quantum computer, and there will be a lot of casings out of it, and it will be connected to various various control system equipments, and then to the output and input signaling devices, the measurement devices and all. So when I say, well, it is not actually a quantum computer because there are a lot of devices attached to it which is not there right there in the picture. So all those components, the measurement components, the input components, the output components, along with the cloud systems, the software, the hardware and different architectures, they comprise of what we collectively call as a single word or a quantum computer. So this device is able to perform and leverage all the advantages being provided by quantum physics. And it provides the output so that we can use, a normal user can use the advantages of quantum physics like superposition, superposition and all, and sitting remotely via a cloud. So companies like IBM, Google, Microsoft, Amazon, along with several other companies, they are providing the access to these quantum computers via cloud, via cloud services, and via different sdks that they have, via different libraries that they have created, like Kiskit, Penny Lane, Bracket, et cetera. So a lot of buzz and hype is going on around quantum computing and the industry. And there are companies which are sort of investigating and diving deep into this niche technology and leveraging it, the complete advantage of it, for their own development. Like in the area of finance, Goldman Sachs, Standard Chartered and other companies are using quantum computers to basically work on problem statements like portfolio optimization, stock price prediction, et cetera. In the area of supply chain, companies like ExxonMobil, et cetera. Are working on optimizing the shipment paths being provided for the ships, for shipments, to optimize the overall supply chain paths or routes that they have, so that there is a cost cutting advantage. And there are other firms working in different areas like battery optimization, so that we can develop more batteries, which are optimized. And a lot of research is going on in and around industry with the sdks and the libraries that these companies are providing. So has we talk there is constant development going on around the quantum computers and the structure that we have in front of us is being constantly updated, upgraded and improved, so that the companies that the problem statements that they are targeting, they can be more optimized, more viable to the customers and the end users. So, as I was talking about various quantum computers, so various quantum computers are out there. And different companies work on different kind of architectures also. So we have superconducting trap diamonds, photonics, and there are a lot of diamond centers and a lot more architectures out there, like the anilos available, being made available by D Wave. So, all in all, a lot of quantum computers are being developed with various kinds of architectures. And different kinds of architectures are optimized for different kinds of. To work on different kinds of problem statements. And like the annealous that are being used, they are more specifically optimized for the optimization problems. And thus they are being used in supply chain optimization, portfolio optimization problems by the companies in various domains. So this, along with the information being provided in the other talks at the conference by my colleagues, will basically give you a generic and overall picture of how the quantum realm is currently and what the scenario of quantum computing is. So now, moving on to the focus part of the talk is basically the astrophysics part, and my personal favorite. So, talking ABout astrophysics. So, basically, specifically talking will be the gravitational waves. So, gravitational waves are basically ripples in the spacetime fabric, which was predicted by Einstein's general theory of relativity. And the pictures that you are seeing here are different observatories built across the globe. And the first Two to come up Were in LIVINgStON AnD HaNford. And these are long tubes, long vacuum chambers, long vacuum tubes which carry lasers. And they basically are like, if I give a number to the length of these arms that you see over here, so they are 4 length. And if someone asks, why 4 length? So it is because if the arm lengths are more than 4, curvature of earth comes into picture and the arms BasicallY starts to bend around the curvature of curves. So it is difficult to keep the laser straight BeyoND 4 overcome Those kind of disadvantages. Scientists are currently working on different projects. Two basically reduce the arm length disadvantage. So they are setting up satellites and coming up with projects in space, basically. So that like one, two name is LISA. So LISA is being developed to basically have the arm length problem solved. And the observatory will be set up in space using satellites. And you have various observatories in and around the world. So KAgRA is one of the observatories in JApaN. It is underground, and underground observatories have different advantages and disadvantages. And we have Virgo in Europe. We have geo 600 in Germany. So 600 is, this specific observatory is sort of an experimental observatory. The arm lengths over here for the detectors is only 600 meters. And the one coming up right now in India, in the state of Maharashtra, is the Indigo project that recently the government of India has signed up for, and the budgets have been released. So these are the overall pictures of how the detectors or the gravitational wave detectors look like. So, now moving forward with the talk, so how these detectors work, actually. So the lasers that I was talking about. So there is a source of laser light. And if I play the video again. So the video basically says that there's a beam splitter, which splits the light, and it gets reflected by these mirrors at the end. And these mirrors basically sends the light again to the beam splitter. And the beam splitter basically domains the light and to a detector. So the vibrations that you see, the mirrors that you see are moving. So these mirrors are moving because of the phenomenon happening below. So somewhere far in the galaxy, there can be two black holes or two massive celestial bodies or any binary black hole merger or a neutron star neutron star merger or a neutron black hole merger happening. So once these mergers, mergers start, so these massive bodies, they start to revolve around each other. And as you can see, what happens is they start to form ripples in the spacetime fabric. And they walk the spacetime fabric around each other so much that they basically sort of create was in and around the spacetime. And if you see, once they merge, the merger happens. They become a single body, a single massive body, and the ripples basically die out. And these ripples are the ripples that cross the entire universe. And it basically reaches the observatories. And once they reach the observatories, they move these mirrors back and forth. And these mirrors, once they are moved back and forth, they basically change the intensity of light that is falling upon these detectors here. And the intensity variation that we get at these detectors are being converted into how much the earth was basically warped around. So, if in very crude words, I have to say. So these gravitational waves that are being sent because of these black hole mergers that are happening, they cross us almost every time. And this is not just true with the black holes, any body, when it moves. So even if I am moving my hand, it is creating gravitational wave ripples in the spacetime fabric. But because my hand or my body is not massive enough to warp the spacetime fabric that much. So these ripples are very feeble. And the black hole mergers, the ripples that it sends. So once these ripples basically move across the whole complete earth or the complete spacetime fabric which contains the earth and other planets and galaxies. So it basically stretches and compresses the whole space and whole space, meaning the earth and people, me, you, everybody. So once these was crosses, they basically are. We are stretched and compressed. And these stretching and compression basically happen in the order of ten to the power -34 to ten to the power -35 meters. It is very small, so we are not able to detect them. And because the differences are very small, this small. So these massive detectors are used to detect the small slightest of the variation in the intensity of the laser light that is there. And then we basically get to know what was like. Were there any gravitational wave being crossing, crossing the earth? And the reason you ask why so many detectors in and around the globe is because these detectors are so sensitive, so much sensitive that even if there is a car crossing across, like near any detector or there is someone walking around the detectors, they detect those noises also. And they are also trapped in the output noise. So to separate all the noise sources, there are seismic noises, there are quantum noises. There are various types of noises that can cause certain kinds of waves. So one type of signal will be common across all these detectors that you see here. And that will be the gravitational wave that has crossed. And all these detectors and various other detectors across the globe are being developed because we want to just be confirmed that, okay, there was a gravitational wave that has crossed. Moving on with the topic. So this was just a very brief introduction about what gravitational wave detectors are, how they work, and what gravitational waves are in general. So now moving to the specific topics. So there's a type of noise. The types of noise that I was talking to you about were these different kinds of noises. The seismic noises, gravity gradient noises, suspension noises, coating brownian noises, quantum noises, computing thermodynamics. So all these noises are there, like the mirrors are suspended. So they cause certain types of noises. The coating on the mirrors, they cause a certain type of noise in the output. These mirrors are hefty. The mirrors are two to three story building high, and they weigh in tons and they cause a noise. The lasers are so much powerful that once the lasers are like, they hit the mirrors. So even though the mirrors are super cool, they still heat up so much that the mirrors may expand or contract. And that can basically add up to the noises, the gases that are there around the tube. These curvature of earth also might vary the seismic variations, the seismic activity that is there in these earth that is happening. So all these things can actually add up to various types of noises. And the picture that you are seeing here is something called as advanced lego. So it is very simplistic plot diagram of how insides of those detectors look. So there is a laser, it is being split into different modes. There is a mode cleaning happening. And the lasers are basically bouncing back to and forth in the four kilometer arm length. And there is a multiplication happening of the detectors in the 615 kilowatts. And finally, the output is mapped here. So the major contribution that happens is one happening by the quantum short noise. So if you see these graph here of the noise, this purple line that you see is basically the quantum shot noise. And these noises come into picture because we are dealing with lasers. And lasers are basically quantum particles which can behave in various ways. So now if we move on with explanation. So these noises are significant when the gravitational wave detections are being made, because it happens due to quantum vacuum fluctuations and quantum vacuum fluctuations. And these topics are very hefty topics and very advanced topics. So it can be covered in some other talk way. So just now giving you a brief introduction and keeping it open for you to explore is the quantum wave fluctuations, which you can explore. And to overcome these quantum wave vacuum fluctuations, the squeeze state of lights are used to reduce these short noises. And in general increasing the signal to noise ratio. It helps in detecting the faint gravitational waves, wave signatures and various machine learning problem statement. Machine learning algorithms are being used to basically identify the specific gravitational waves that we want and remove all these kind of noises that is already there. So, talking about now we have talked about quantum. Now we have talked about gravitational waves or astrophysics in general and what are the methods that we can implement or propose so that we can leverage the use of quantum computers in the area of astrophysics. So, talking about the areas where this can come, so we can have something like a quantum signal preprocessing. Then there is a measurement happening, and then there is a quantum signal post processing happening. Okay, so this sort of can be a setup of the quantum signal preprocessing. We have the detection happening and the post processing can be done. So we're talking more about that. So the signal preprocessing is basically the quantum information that is hidden in the potential gravitational wave. So this method is basically tries to perform a preprocessing step on the signal before it is measured. So the measurement step that we talked about that. So if I just quickly show these slide so the measurement is happening over here, the output mode clean, there is an output mode cleaner, and there is a measurement happening. So the measurement that is happening here, before that, we can have a quantum preprocessing happening, so that it basically takes out the important quantum information that we have. And it might provide a wider spectrum of data collection by the opportunities, by using the Hilbert spaces that is available. So, this sort of experiment is actually going on, and the research is going on in the GEo 600 observatory in Germany, and they are focusing more on how to extract the quantum information which is hidden in the gravitational waves, and give more information about the granularity of what the quantum information actually provides us to. So, moving on to the next step, which is the quantum signal post processing. So, the present signal post processing that we have is classical, and a quantum equivalent of the selina post processing steps could be developed. Like there are many post processing happening, which include machine learning algorithms. So, instead of the machine learning algorithms, we can use more accurate and more efficient quantum machine learning algorithms. And these quantum machine learning algorithms at larger scale, with hefty data, they are proven to be more accurate and provide more insights about how and what the things are, and give better predictions, and separate out things better. And quantum machine learning is a topic which one of my colleagues is talking about at this conference. And it is a very niche area where things can develop a lot. And the advantages that quantum machine learning can provide us can be used as one of the steps of the quantum signal post processing. And the post processing, basically may increase the processing speed, and thus increase the accuracy of the signal isolation. So, increasing the processing speed and basically will help in increasing the signal isolation, and the signal basically that we are wanting. So if there is a binary black hole merger, the signals that we get across the different detectors, we can isolate it better and get more accuracy along with it. And the errors can also be isolated more efficiently. And the errors that we are getting along with the gravitational waves, basically can be isolated more by the quantum signal post processing that can happen. So we move on further with the slide. So this is basically the picture that you see is basically a frequency dependent squeezing for advanced Lego. And this is basically a setup that is being tested out at these Geo 600, by the GeO 600 team, along with the advanced lIgo. And it is basically a 16 meters setup. And this is the basic foundation of the idea. And the 16 m experiment that you see up bottom right is basically what I was trying to talk about. Like, we can have certain post processing steps, either in the form of optical setups or software setups, which can help in isolating the setup. And we can think it as a modular setup, like say if there is a gravitational wave that is coming and we isolate it. And so we can make the setup more modular and we can have different types of optical setups, specifically targeting a particular type of quantum algorithm or quantum, or a quantum optic setup that we are looking into. So this is an area where we can dive deep into and come up with setups which can help in, ah, not only improving the quantum in the gravitational wave detection step, but also developing on these areas will basically help us move closer to the overall goal that we have in the development of an experimental setup for quantum gravity. So the researches that the team at the GEO 600 is doing may lead into the development of an experimental setup to prove the quantum gravity and the existence of gravitons. And maybe these developments will lead to advantages in various fields also. So, moving on with the topic. So the conclusions that we can drive out of the talk will be so these methods and researchers can help us explore the unknown area of the quantum gravity. And they have potential to hypothesize a method to experimentally prove the existence of gravitons. And the explorations may help in the development in the field of gravitational wave detection, which will help the ever growing community of quantum computing enthusiasts. Talking in general, the things that we have developed in various areas previously, like in these things that the cutting edge engineering feats that we developed in the CERN colliders and in the LIgo gravitational wave detectors. So a lot of things are being used in various places in and around world in various medical applications specifically. So these things that we develop while researching in this field will help improve the growing community of quantum enthusiasts. And also maybe in future, if we develop more on this topic, we'll be able to see how we can hypothesize, can experimental setup to prove the existence of gravitons and research more on the area of quantum gravity. And with that being said, I would like to conclude the presentation, the talk, and thank each and every member of the panel and the organizing team for giving me the chance to present this talk in front of the audience of the conference and hope to see you again. And a very much thank you to all.", "words": [], "utterances": null, "confidence": 0.953379887663819, "audio_duration": 2169.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Archit Srivastava talks about how quantum computers can be helpful in the fields of astrophysics. Currently works as full stack data engineer at Hewlett Beckert Enterprise in Bangalore.\n- There is can increase in the need to spread awareness about the various topics related to quantum computing and astrophysics. A very niche area where quantum computers can become a big asset is the area of astrophysics and gravitational wave astronomy.\n-  quantum computing and astrophysics. Scientists believe that if we are able to combine and unify these two extreme fields, then we'll be able to explore the unknown. It is a very niche area of research, which has infinite possibilities.\n- A lot of buzz and hype is going on around quantum computing and the industry. Companies like IBM, Google, Microsoft, Amazon, along with several other companies, are providing access to these quantum computers via cloud. They are being used in supply chain optimization, portfolio optimization problems by the companies in various domains.\n- Gravitational waves are ripples in the spacetime fabric predicted by Einstein's general theory of relativity. Scientists are currently working on different projects to reduce the arm length disadvantage. They are setting up satellites and coming up with projects in space.\n- The gravitational waves that are being sent because of black hole mergers that are happening, they cross us almost every time. These massive detectors are used to detect the small slightest of the variation in the intensity of the laser light that is there. And all these detectors and various other detectors across the globe are being developed.\n- The noises are significant when the gravitational wave detections are being made. These noises come into picture because we are dealing with lasers. Quantum wave fluctuations are used to reduce these short noises. It helps in detecting the faint gravitational waves, wave signatures and various machine learning problem statement.\n- A quantum equivalent of the selina post processing steps could be developed. Quantum machine learning can be used as one of the steps of the quantum signal post processing. Post processing may increase the processing speed, and thus increase the accuracy of the signal isolation.\n- A 16 meters setup is being tested out at these Geo 600, by the GeO 600 team, along with the advanced lIgo. Could lead into the development of an experimental setup to prove the quantum gravity and the existence of gravitons. These developments could lead to advantages in various fields.\n- The conclusions that we can drive out of the talk will be so these methods and researchers can help us explore the unknown area of the quantum gravity. They have potential to hypothesize a method to experimentally prove the existence of gravitons. And the explorations may help in the development in the field of gravitational wave detection.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.07, "text": "different quantum hardware architectures", "timestamps": [{"start": 79676, "end": 81874}]}, {"count": 6, "rank": 0.07, "text": "quantum physics", "timestamps": [{"start": 461828, "end": 462426}, {"start": 463368, "end": 464014}, {"start": 559188, "end": 559962}, {"start": 595390, "end": 596342}, {"start": 740830, "end": 741926}, {"start": 751492, "end": 752282}]}, {"count": 4, "rank": 0.07, "text": "quantum signal post processing", "timestamps": [{"start": 1707044, "end": 1708554}, {"start": 1796688, "end": 1798310}, {"start": 1858964, "end": 1860730}, {"start": 1907988, "end": 1909562}]}, {"count": 1, "rank": 0.07, "text": "quantum optimization", "timestamps": [{"start": 121496, "end": 122510}]}, {"count": 7, "rank": 0.07, "text": "quantum gravity", "timestamps": [{"start": 361444, "end": 362154}, {"start": 585548, "end": 586226}, {"start": 586428, "end": 587154}, {"start": 2021384, "end": 2022446}, {"start": 2037548, "end": 2038134}, {"start": 2062068, "end": 2063082}, {"start": 2141964, "end": 2143030}]}, {"count": 1, "rank": 0.07, "text": "quantum computing enthusiasts", "timestamps": [{"start": 2076508, "end": 2078310}]}, {"count": 1, "rank": 0.07, "text": "quantum particles", "timestamps": [{"start": 1611508, "end": 1612566}]}, {"count": 2, "rank": 0.07, "text": "various quantum computers", "timestamps": [{"start": 896752, "end": 898278}, {"start": 898448, "end": 900098}]}, {"count": 1, "rank": 0.07, "text": "quantum enthusiasts", "timestamps": [{"start": 2121608, "end": 2122974}]}, {"count": 2, "rank": 0.07, "text": "quantum vacuum fluctuations", "timestamps": [{"start": 1626988, "end": 1628562}, {"start": 1629084, "end": 1630962}]}, {"count": 1, "rank": 0.07, "text": "quantum operations", "timestamps": [{"start": 561060, "end": 562518}]}, {"count": 4, "rank": 0.07, "text": "gravitational wave detectors", "timestamps": [{"start": 511188, "end": 512454}, {"start": 1139264, "end": 1140454}, {"start": 1465192, "end": 1466974}, {"start": 2101654, "end": 2102794}]}, {"count": 10, "rank": 0.06, "text": "gravitational waves", "timestamps": [{"start": 540208, "end": 541174}, {"start": 992656, "end": 993766}, {"start": 994256, "end": 995174}, {"start": 1288444, "end": 1289394}, {"start": 1468168, "end": 1469006}, {"start": 1659674, "end": 1660618}, {"start": 1669800, "end": 1670830}, {"start": 1681916, "end": 1682946}, {"start": 1783628, "end": 1785074}, {"start": 1903812, "end": 1904714}]}, {"count": 1, "rank": 0.06, "text": "gravitational wave ripples", "timestamps": [{"start": 1306074, "end": 1307274}]}, {"count": 2, "rank": 0.06, "text": "gravitational wave detection", "timestamps": [{"start": 2006340, "end": 2008026}, {"start": 2072648, "end": 2074062}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}