{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/31c5c41a-d792-4cfc-8d92-812ee8ee7bbc", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["authorinternationalkeynotespeakerexecutivecoachcorporatetrainermemoryexpert", "business", "champion", "changing", "chester", "chestersantos", "chestersantoscom", "conffourtytwo", "from", "professional", "santos", "skills", "training", "worlds"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "f446334b-343f-46d2-90d7-1ea98eaea276", "status": "completed", "error": null, "text": "Chester Santos, the international man of Memory here. My goal is to make this a very entertaining and educational webinar. Memory is a fundamental part of learning and the acquisition of knowledge. So improving your memory skills is going to have a positive impact on multiple areas of your life. In case you might not be too familiar with myself and my background, a two minute short video is going to play with some of my presentation clips, media clips, and also my theme song. Check it out. And then I'll be back with the webinar that works. We just did some mental athletic training with Chester Santos, who has the best memory in the United States, with ease. Joining us right now is memory expert and winner of the 2008 USA national Memory Championship, Chester Santos. If you have trouble remembering names, faces, where you put your coffee task, well, if you do Chester Santos, he can help. He's a 2008 national memory champion. He is here to help us. Certainly knows he does. Chester Santos is the United States memory champion. He captured the title this past weekend in New York City. There he is accepting the prize. He's not. You can count or see. He got the names of every conference. You get it? Every sunny in a national. Who's the twelveth district New Jersey conference? Rush Holton. Okay. Rush holter wrapped up. Ten of hearts, three to go. Two of clubs. Yes. Jack of diamonds. You got it. And three of diamonds. Unbelievable. That's incredible. First of all, we have Carol, Rick, Pedro, Jack, Andy. We're dizzying ass every single time. He's got the power to educate, the power to thrill and memorize, all wrapped up in invitation for mine. He's your man. Some of his techniques stretch all the way back to the ancient Greeks, but what's amazing is it's standing in front of you as a modern human being. I can still feel those techniques reprogramming my brain to remember things better. All right, we're back. You just saw my introductory video. We're going to get started with the webinar. Now, I want you to keep in mind that I might ask you to do some things that can at certain times, seem a bit silly or unusual. But please bear with me because I promise you that everything that I ask you to do over the next hour or so, it's really going to help you to dramatically improve your ability to remember almost anything at all. I'd like for you all to close your eyes at this point. Close your eyes and just visualize what I describe to you with your eyes closed. I want for you to imagine yourself in your current residence. You are in the living room area of your residence. And you see there in the middle of your living room, standing behind podiums, looking as if they're about to engage in a debate. You see Donald Trump and Vladimir Putin. Just see that in your mind. I know it seems kind of out there unusual, but picture them now actually debating in the middle of your living room. Just see the debate unfold. It's becoming more and more heated between the two politicians, Trump and Putin. At one point, you see Donald Trump become visibly upset at something that Putin says. So he reaches behind his podium to pull out a pie. He takes it, throws it at Putin, hits him square in the face. You can see the pie dripping off of Putin's face. Picture that he's not happy about it at all. So believe it or not, he now reaches behind his podium to also pull out a pie, takes it, throws it at Trump. Splat. You can see the pie dripping off Trump's face. Now, what started off as a debate, turns out, has now turned into a full blown pie fight. The politicians are continuously throwing pies at each other. Pie is splattering all over the place. You can worry about who's going to clean up the living room later. Just see this happening in your mind to the best of your ability. You are primarily experiencing at this point, images running through your head, imagery. I'd like you now to attempt to involve even more senses as you experience this scenario happening. Imagine that you can not only see it happening, you can hear it happening as well. So you can hear the pie as it splatters on the politicians. Imagine now that you can smell the pie, stretch your imagination, really imagine what that pie might smell like. So at this point, you can see the pie fight happening. You can hear it. You can smell it as well. Let's take it a step further. I want for you to imagine that you walk up to one of the politicians, you take some of the pie off of their face, feel it in your hands, maybe it feels sort of sticky. Go ahead now even put some of the pie in your mouth. Go ahead and taste that pie. Hopefully it's tasting pretty good to you there. Although a lot of people tell me that it tastes like politician at this point. All right, go ahead and open up your eyes. Hopefully you enjoyed that exercise. A lot of people find it to be a fun exercise. Usually pretty easy for most people to complete that. But what in the world does that have to do with improving your ability to remember things? In fact, it has a lot to do with it. If you were able to complete that simple exercise, then you have the ability to remember anything at all that you would ever want to remember quickly, easily, and also with tremendous accuracy. Here are some reasons why. Reason number one, I had you there. Exercise your visualization ability, and your visual memory is incredibly powerful. An example that I like to cite in my presentations around the world is a situation that we can all relate to. We might see someone that we could have met years ago. We may have met that person years in the past. Oftentimes right away, as soon as we see their face, we remember their face. We know that we've met them somewhere before, but we can't seem to remember their name. Right. Pretty common experience. Something else that we can relate to. Let's say you go to a party. You go to a party, you're meeting a lot of new people. Two weeks after that party is over, you're talking with one of your friends that was at the party with you, and your friend describes someone to you that you had both met. Your friend says, hey, do you remember that attorney that we met at the party a couple of weeks ago? He's also a member of the tennis club. As your friend is going through the description of the person from the party, a lot of times you can picture who they're describing in your mind. You might even be able to remember what that person was wearing that night when you met them. But a lot of times, you can't seem to remember the name, and it's very frustrating. A third and final example related to this. How many times have you been describing to a friend or family member an actor from a tv show or movie? As you're going through this description, crystal clear in your mind, you can picture the actor that you're describing. Your friend or family member can also picture who you're describing, but neither one of you can come up with the name at that moment, and it's really frustrating to both of you. Those three examples that I just went over all illustrate pretty well that when it comes to dealing with people, we tend to be pretty good at remembering faces, but we are not nearly as good at remembering names. When you think about it, this makes a lot of sense, because when we are interacting with people in various ways, we always see the face, right? We see their face. The face is recorded into our visual memory, but at no point do we see their name. The name is something much more abstract to your brain. So one way that you can get better at remembering names is to turn the name somehow into a visual, something that you can picture in your mind. For instance, Mike might become a microphone for the name Alice. Sometimes I picture a white rabbit because that reminds me of Alice in Wonderland. That's how I open presentations around the world. I've given presentations in more than 30 different countries at this point. A lot of times I'll open with naming hundreds of people in the audience after just hearing each name one time. It's because I'm turning those names into powerful visuals. I'm going to get into remembering names in much more detail toward the end of this webinar, so look out for that. But for now, what I want for you to note is the power of your visual memory. When you can take information that you want to remember and turn it into something that you can picture in your mind, it's going to make that information so much easier to remember it later on when you need it. The second principle to take away from the simple exercise with Trump and Putin is that after I had you visualize, I then had you start to get more and more senses involved from there. As you activate more and more senses in the encoding process, when trying to get information into your memory, what's happening is you are activating more and more areas of your brain, and you are building more and more connections in your mind to the information, making it easier to retrieve it later. So I starred in an episode of PBS's Nova Science. The episode that I starred in was entitled how smart can we get? Or it might be easier to just Google Chester Santos, that's me, and PBS. And you'll probably find the clip. Anyone can watch the entire episode for free on the PBS website. Maybe take a look at it at some point. If you do, you'll see me on the show performing what at first seemed like pretty crazy memory feats. And then they had me train David Pogue, who was the host of the show. You might also know him from the New York Times and CBS News. He's a correspondent for the technology industry. I trained him on the show, and after just a little bit of training, he was then able to perform some pretty cool memory feats. After that, they had some neuroscientists, brain scientists, come on the show and explain, okay, how in the world did Chester pull that off? How did David Pogue do it? With just a little bit of training, and these brain scientists confirmed that it's because with these memory techniques that I've mastered over the years and that you're going to learn about during the short webinar today, what's happening is we're recruiting extra areas of the brain, areas of the brain that most people worlds never involve when trying to commit things to memory. With these techniques, we're activating more and more areas of the brain to help us, so it becomes so much easier to remember things. Part of this is learning to utilize additional senses. The more senses you involve, again, the more of the brain is activated, the easier it is to remember. Keep that in mind. Third and final principle is that in addition to seeing all of this and experiencing it with additional senses, I made the entire scenario with Trump and Putin very strange, right? Unusual. You would never expect to see that happening in the middle of your living room. I had you do that because I'd like for you to learn to take advantage of the psychological aspect to human memory that is all of us. With putting forth little to no effort, we tend to remember things that catch us by surprise, that are strange, extraordinary in some way, right? If this were to actually happen right now at this moment, wherever you are watching this webinar, if an elephant crashed into the room right now at this moment and started to spray water all over you with its trunk, if that actually happened at this moment, you would probably remember that for the rest of your life and always tell that story. It might be stuck there forever without you even putting forth any effort to commit that to memory. To this day, it still isn't fully understood how that works in the brain. How sometimes in one instant, something will go straight into long term memory and stay there forever. Whereas other times, when we have really important things that we need to get into long term memory, we have a lot of difficulty doing it. We can spend weeks, months, trying to get things in the long term memory. Although this isn't fully understood, we do realize that there is this psychological aspect to human memory. Realizing that we can harness that power and apply it to things that would be very useful for us to remember names and faces, to get more out of business networking, and to build better relationships with people in general. Presentations, important business related facts and figures, foreign language, vocabulary, exam material, and so on. There are so many practical applications for an improved ability to remember things. When you combine the three principles that we just went over, visualization, utilizing additional senses from there, and you also use your creativity and imagination to make what you are seeing and experiencing crazy, unusual, extraordinary. When you put that together right away, it becomes easier to remember just about anything at all. We're going to put this into practice now, all right? Without training anything down, without using any sort of electronic device to help you, you'll be using nothing but your brain and memory. Here. I know people aren't used to doing this nowadays. I'm going to have you attempt to commit to memory the following random list of words. It's going to be monkey, iron, rope, kite, house, paper, shoe, worm, envelope, pencil, river, rock, tree, cheese, and dollar. All right? Now, when I recite that list of words to live audiences, I get people in the audience looking at me as if, come on, man, there's no way I'm going to be able to remember that. Not unless you give me a lot of time to do it. But in fact, all of you watching this webinar, you're all going to have it committed to memory perfectly, forwards and backwards. With just about three minutes of study time and with no further review necessary. Even weeks from now, you will skills know those words forwards and backwards. They will be locked into your memory. How you're going to pull this off. Just listen to what I described to you. See and experience it happening in your mind, just as you did in the opening exercise with Trump and Putin. Same approach. The whole key to this, and probably one of the most important things to get out of the short webinar today, is to hopefully shift your approach just a little bit when it comes to any sort of memory task. Remembering names, giving a presentation, whatever it might be, rather than coming at it, as we usually do, as a difficult and boring exercise in memory. Try to come at it more as just a fun opportunity to use your creativity and your imagination. That small shift in your approach will make a huge difference in your ability to remember things you saw in the intro video, the two minute video with some of my tv clips. You saw one of my CNN clips there. I had to memorize during the commercial break, all right? Only had about two minutes to do it. Then they came back live on the air. I had to recite that, all of those cards from memory, if you pay attention, you'll see that while I'm memorizing the cards, I'm smiling, I'm giggling. I think they thought that I was a little bit crazy or nutty when I was on that show. But really, that's the key. If you all are smiling and giggling while you're going through this exercise, it's a good sign that you're going to remember all the words. So just have fun with it. It'll be very easy. Let's do it. Now, visualize what I described to you. The first word was monkey. So I want for you to just see a monkey in your mind, all right? This monkey is dancing around, making monkey noises. Whatever a monkey would sound like, I'm working on my monkey impression. Okay, the point here is to see and hear the monkey. The monkey now picks up a gigantic iron, because that was the next word. So just see this like a movie or cartoon playing in your head. However you can best visualize it. You've got a monkey dancing around with a giant iron. At this point, the iron starts to fall. But a rope attaches itself to the iron. Maybe even feel the rope. Maybe it feels sort of rough. Really interact with it. You look up the rope, and you see that the other end of the rope is attached to a kite. That kite is flying around in the air. Maybe you reach up and try and touch it. It might just be right just out of your reach. That kite. The kite now crashes into the side of a house. Really see it smash into that house. The house, you notice is completely covered in paper. For some reason, it's covered in paper. Picture that. Out of nowhere, a shoe appears, and it starts to walk all over the paper. Maybe it's messing up the paper as it's walking on it. That shoe. The shoe skills pretty badly. So you decide to investigate and see why. You look inside of the shoe and you find a little worm crawling around. See that smelly worm crawling inside the shoe? Worm was the next word. The worm now jumps out of the shoe and into an envelope. Maybe it's going to mail itself or something. I don't know. Envelope was the next word. A pencil appears out of thin air. It starts to write all over the envelope. Maybe it's addressing it. The pencil. The pencil now jumps into a river. And there is a huge splash when that little pencil hits the river. River was next. The river, you see is crashing up against a giant rock. All right, really see it crashing into that rock. The rock flies out of the river and into a tree. Picture that tree. This tree is growing cheese. You probably haven't seen a tree like that before. This tree is growing cheese. Out of each piece of cheese shoots a dollar. The last word was dollar. I'm going to go through this again very quickly, and your job at this point is to simply replay through this little story that you've created in your mind. So we started off with the monkey. What was the monkey dancing around with? It was dancing around with an iron. What attached itself to the iron? It was a rope. The other end of the rope was attached to what? It was a kite. What did the kite crash into? It was a house. What was the house covered in? It was covered in paper. What walked on it. It was a shoe. What was changing in the shoe? It was a worm. The worm jumped into what? It was an envelope, right? What wrote on the envelope? It was a pencil. The pencil then jumped into what? It was a river. The river was crashing up against the rock. That flew into what? It was a tree. What was it growing? Cheese. And what shot out? A dollar. Right? The last word was dollar. Now, you should be able to recall pretty easily the entire random list of words by simply going through that story in your mind. And each major object that you encounter in the story will give you the next word if you'd like. At some point, you can just pause the webinar and see if you can recite those words forwards and then maybe even attempt to recite them backwards. If you do that, I'm pretty sure you're going to get close to 100% correct. This technique is called the story method. It is just one of many techniques that memory champions like myself use to pull off what at first seemed like extraordinary feats of memory. But really, it's just about the right techniques, a little bit of training and practice. My brain is not different from anyone else's. I've just learned powerful techniques and gone through a little bit of training. You can do this as well. And again, this will give you an advantage in just about any career. This is going to be very useful in various ways in your personal life and also for the kids that you have in school. This will cut their study time. It will improve their retention of information. This provides them with a much more fun and interesting framework to use when they have to commit things to memory for school. If you will stick to this type of training with the story method and other similar types of techniques, you will notice many benefits over time. Benefit number one, your memory is going to improve over time in general, even independent of using the techniques. But that's only if, after the webinar today, you force yourself to commit more and more things to memory and recall them. Your memory will then improve because your brain is very trainable. The more you force your brain to perform a particular function over and over again, the more it signals to your brain that that's something important that you need to be able to do. So your brain finds a way to make itself better at doing it. There was a segment on a science program about a guy who was in a very unfortunate accident, and a pole went through a certain area of his brain, and he completely lost the ability to perform certain functions. What happened, though, is with rehabilitation and training, the brain rewired itself, other areas of his brain took over. So areas of the brain that most people would have nothing to do with performing those functions, they took over, and he regained the ability to perform not all, but many of those functions due to rewiring of his brain. With training, your brain's incredibly trainable. The opposite is, however, true. If you never have your brain perform a particular function, if you're always writing everything down, if you're always entering things into electronic devices, what you're saying to your brain is, you know what, at this point in my life, it's not important for me to be able to remember things anymore. So it makes sense that you are going to start to lose that ability over time. We are living in an age of perhaps dangerous digital dependency. People are losing not only their memory ability, but also other mental functions due to becoming too dependent on electronic devices. An example I'll give you. We all used to be able to remember the phone numbers of so many friends and family members, right? We could easily dial those from memory. I remember when I was growing up, my parents would also give me some emergency numbers that they thought were important for me to know. We could all do that. But nowadays, you give somebody even one phone number and they feel paralyzed, they can't do it. It's getting so bad that there are people out there today that don't even know their own phone number. It's a really good example of the use it or lose it principle as it applies to memory. Another quick example, navigation. You have people. I'll give Uber and Lyft drivers as an example. In some cases, they may have been driving in a city for three, four plus years. But if something is wrong with the app at that time, if there's something wrong with the network connection, a lot of times they can't take you to even very commonly known landmarks in a city. They will need to pull over, restart their phone, until hopefully the issue with the app resolves or the network connection comes back. Because for those three, four plus years, they have been 100% dependent on the gps. They've completely shut off their brains, so haven't even learned a few simple streets. The same is happening with taxi drivers. Taxi drivers used to be world famous for their memory ability. I know New York City and London taxi drivers. At one point, universities were even doing research on their brains because they had just an extraordinary ability to remember even thousands of streets. But nowadays, I've been in a taxi in San Francisco, and it just isn't the same anymore due to dependency on gps. So just be a little bit aware that we want to be a bit careful with too much digital dependency. Try to use your brain, definitely try to use your memory when you can. I get people in my seminars all the time that tell me, hey, you know, when I was back in school, Chester, I was pretty good at remembering things, but now I'm having really a lot of difficulty remembering things on the job. They're sending us to new trainings and I don't have that ability to commit all of this information to memory like I did back in my schooling years. When you think about it, this makes sense because then you were using your memory all the time, right? So when we are in preschool, elementary school, junior high, high school, grad school, for some people through that entire block of years, you're challenged to learn tons of information from a wide variety of areas. You're tested on your recall of the information, for quizzes, exams, to write papers. When you first start a new job, when you do the on the job, onboarding, right. The onboard training. You have to learn a lot of new things in order to perform your job functions properly. But then what happens to a lot of us is we enter this 30, 40 plus year period where things start to become a routine. We're doing the same types of things day in and day out. We're not really challenged to use our memory as much on a regular basis. So when we are suddenly presented with something new to learn, we feel like our memory capabilities have been diminished. The positive aspect of this is if you make it a point to actually exercise your memory, exercise your brain in general as well, you can keep your memory strong and really in fact improve it at any age. Now, some people don't believe me when I tell them this. A lot of people are stuck on this idea that someone older in age is going to have a memory worse than someone younger in age. And that's just the way things are. So I like to talk about two things. One, I represented the United States in the World Memory Championship. It was held in the Middle east when I represented the United States. There was a guy there from Malaysia in his late sixty s, so more than thirty years older than me. He destroyed me in this competition. Okay? He kicked my butt really badly. In the world memory championship. He actually memorized the entire dictionary, advanced Learners edition in English and Chinese. He did a demonstration for people in the audience and for people from the media that were there watching. They would call out any page number in the dictionary and give a row column combination. Within a few seconds, he could tell you the word there and its definition from memory. He could even do the reverse. If you just called out a random word like chair, he would say, okay, chair, I think that's on page 737, row four. And he was right every single time. He's known as the walking dictionary. Dr. Yipswei Choi from Malaysia. These are the types of guys that you get at the world memory championship. It's pretty intense over there, but it goes to show he was in his late sixty s. So even later in your years you can have an extraordinary memory ability. But he is constantly training his memory with these types of techniques that we're talking about on today's webinar. Second example, I've been teaching a one day memory training workshop in San Francisco for more than twelve years, and now I have an online equivalent memory school. But I've gotten people in the San Francisco seminar that from all over the world and all different age ranges I have seen in that workshop, people in their sixty s and seventy s completely outperform working professionals in their twenty s and thirty s in terms of the memory tasks in the workshop. And when I talk to those people, it turns out that they not only sign up for things like memory workshops, they take language classes. They're always keeping very mentally active, attending art functions, museum events, they're really exercising, challenging their brain at all times. And I think that is they're really dedicated to lifelong learning. And I really think that is at least part of the reason how they're staying so razor sharp even later in their years. So you can improve your memory, remain razor sharp at any age. If you stick to the type of training we're going to be talking about today, you will keep your memory strong, improve it at any age. Also, visualization ability will improve. You'll create these images in your mind more quickly. You'll be able to see the imagery more clearly. And visualization ability has been linked in many studies to more than memory. It's been linked to overall intelligence. In fact, if you can take complex information and turn it into a simple series of images that you can visualize, see in your mind, it helps to improve your understanding as well. So visualization, another important thing that you can develop with this type of training. This is also very good exercise in creativity and imagination, coming up with these creative and imaginative stories. In addition, this is really good exercise for your brain in general. And everyone is recommending nowadays a brain exercise program in addition to a physical exercise program. With the current research, if you're destined to develop Alzheimer's or another form of dementia. Unfortunately, there is no doctor, no researcher that can tell you how to prevent that from happening. But what they do believe is that by engaging in rigorous brain exercise, you can build up what they're calling cognitive reserve. If you were to look that up right now, google it, or otherwise look it up, cognitive reserve is the terminology that you'll find used in the research. This basically means building up some extra brain muscle, and they think that it might help to make you more resistant to some forms of dementia if you do, unfortunately develop it down the line. One of the best ways to develop cognitive reserve research supports learning foreign languages can really build up some extra brain muscle, extra brain connections. Of course, learning languages is going to be easier for you if you master memory skills techniques. Now, we've covered so far the story method with random words. I want to make it clear before we move on to names, which is coming up, I want to make it clear first that this won't apply to just random words. This can apply to even very complex types of information as well. So not just monkey, iron, rope. I was a speaker at Harvard University. You can find on my website a testimonial from the Harvard Graduate Council. So I gave a seminar for and then one large seminar for hundreds of students over at Harvard, and then smaller, more in depth training after that. I had Harvard medical students, law students, business students in the programs. Even very complex types of information can be tackled. It's about building mental note cards or mental cue cards that remind you of something more complex. You'll have a better idea. As we go through one more short exercise, I want for you to just visualize what I described to you. See and experience it happening in your mind as best you can. This will take a minute or two, really easy. I want for you to visualize some giant machines. Just see that, picture it. Some giant machines. These giant machines are smashing up a huge pile of gold and silver, right? Smashing up a huge pile of gold and silver. Those machines, out of the gold and silver vehicles rise up. See these vehicles? Whatever that looks like to you. And shooting out of the windows of the vehicles, a bunch of medicine. Maybe you see pill bottles or syringes or something. Medicine is shooting out of the windows and exploding out of the medicine. Oil, maybe black petroleum oil would be easiest to visualize. Oil explodes out of the medicine. That was it. This one really is very quick and easy. I'm going to run through the imagery again, replay through it in your mind. We had these giant machines were smashing up what they were smashing up gold and silver. What rose up vehicles. What shot out of the windows of the vehicles? It was medicine. What exploded out of the medicine? It was oil. What you have just done there, I'm sure you can recite those items back. You've just memorized the top five exports of the UK. So if you were to look up some of the UK's top exports, you'll find listed machinery, precious metals, vehicles, pharmaceuticals and oil. So you see there how the images don't need to perfectly match what you're trying to remember. Those simple images serve as note cards, mental note cards, to remind you of something a little bit broader when you are meeting with clients, potential clients, or it's a presentation in front of colleagues, when you have just 510 15 key things that you're able to recite, demonstrate that. You know that, right? You're demonstrating your expertise, you're showing that you actually know your stuff. You are so much more impressive. You are perceived to be more of an expert in your particular field. People start to have more confidence in you and your ability when you have a razor sharp memory. And just a little bit of memory skills training will go a long way. We talked about it earlier, people are very digitally dependent. In today's business environment, people can't remember even a small amount of information. So a little bit in terms of memory skills training will go a long way towards setting you apart, making you more impressive and you will be more memorable in the business world. Of course, as I mentioned earlier, this is also huge for kids that you have in school. This is going to cut study time, improve retention. Kids find this to be a much more interesting and fun methodology to use to commit things to memory, as I mentioned earlier. Let's move on now to one of my more popular topics. No matter what type of group I might be talking to around the world, it's always going to be names. Because names we know is remembering names is important in just about any career. It's important in everyone's personal life. I like to quote the book how to win friends and influence people. You may have heard of it to this day, it's still one of the most popular business and personal success books ever written. In that book, it was written that the sweetest sound to a person in any language is the sound of their own name, and also that everyone's favorite subject is themselves. So in fact, remembering people's names and things about them helps you to build better business and personal relationships. If you meet someone at an event and the next time you see them, you can say hey, John, how are you? How's your wife Nancy? How was your last round of golf? Automatically what they're feeling is, wow, they must be pretty important to you if you can remember those things. About the most important is their name. And then in turn they become much more interested in getting to know you and what you're about better. This is really very strengthening to relationships. Now, on the opposite side, if you are not remembering people's names, or maybe even worse, you're calling people by the wrong name, this can be very detrimental to both business and personal relationships. I had a guy come up to me after one of my presentations and he told me he was in sales and he actually ended up getting fired because he attended an annual or semiannual conference and he had accidentally the whole day been calling the vice president of sales by the wrong name. I think he called him by a similar name, like it was close to the correct name, but not exactly right. And the vice president ended up training to a supervisor and said, look, in a sales career, this is just not acceptable in our field. We really need to be good with names. And the guy got fired. That's maybe, perhaps an extreme example, but I think we all know that people that are very good with names are more popular, more likable. Politicians are clear on this fact. By the way, a lot of politicians go through memory skills training. They really want to make it a point to get good at names. And I think we all realize that it can be detrimental to relationships when you are not remembering names or calling people by the wrong name. So let me give you some steps that you can put into practice right away. All right, step number one, to help you out with names from this day forward, whenever you are introduced to someone, make it a point to immediately repeat the name and shake their hand if you can. Or maybe if we're concerned about germs, you can do that elbow bump with a pandemic that we have going on recently, but definitely at least repeat the name. Nice to meet you, John, or pleased to meet you, John. It might seem pretty obvious there, but a lot of times when someone is telling us their name, introducing themselves, our mind is all over the place. We're thinking about all sorts of other things. We don't even pay attention to the name for even 1 second. So that first step forces us to pay attention for at least a second. That's the only way we could repeat the name right back to the person. Start doing that today. Eventually it's going to become a habit and second nature to you. Step number two, early on in your interaction with the person, ask them a simple question using their name. So, John, how do you know Chester or John? How long have you been involved with this organization? Just one question early on will reinforce the name in your mind. Prevent it from just going in one ear and out the other. I want to clarify. I don't mean use the name over and over again in the conversation to where it starts to seem a little weird. Just use it once early on. That will be enough to reinforce it. Step number three, take a few seconds or less to think of a connection between the name, the person's name, and anything at all that you already know. So John might make you think of John Lennon. It could be a famous person like that, or it could be a character from a tv show or movie that you like. It could be something as simple as you have a friend or family member that has that same name. Thinking of a connection between the name and literally anything at all that you already know is really going to help that name to stick better in your long term memory. Step number four. Whenever you leave the party, the meeting, whatever type of function it might be, make it a point to try to say goodbye to people actually using their name. That's really going to go a long way toward helping you to remember more of those names long term. Those four steps are going to help you out right away. You will notice an immediate improvement if you combine them with the visual based technique that I very briefly hit on earlier. There is no doubt in my mind that you will be better than you ever have before remembering names. You might not be 100%. Even I'm not 100%. But if you can remember 80 plus percent of the people that you're meeting, this is going to pay off big time in your career. This is going to help you out in your personal life as well. You're going to find just that this helps you to be more likable to people. This definitely strengthens relationships. The visual again that I had mentioned was like a microphone. You might picture for the name Mike. There's another step to that. When you come up with the visual for the name, also connect it to something about the person's look. So if you're meeting this new person named Mike, ask yourself what's unique about the look. Maybe to you he's got cool looking hair. If that's the case, you might imagine the microphone getting tangled up in his hair. Because how this works is the next time you see the person, all you have to do is ask yourself what was noticeable to me about their look. You're very likely to notice what was unique to you before. The image that you then stored there will immediately come back to you. You'll see the mic, the microphone that will remind you that the name was Mike. It might seem a little strange, but it's very powerful and effective. Anyone can get good at doing this with a little bit of training and practice. If you want some more training and practice with that and to learn more techniques, check out my online memory school. So in my online memory school, it's memoryschool. Net is the URL. I would picture a gigantic maybe fishing net to remember that it's net is the ending of the URL. I would simulate introducing you to many people over and over and teach you a wide variety of visual based techniques that I wasn't able to cover. On today's webinar. You'll really develop that skill in remembering names. I'm going to teach you how to remember presentations without notes or minimize the amount of notes. I'm going to teach you how to remember foreign language vocabulary presentations, exam material for the kids in school, or training material for professionals. More techniques to improve your memory in general. We're going to tackle remembering information with numbers, facts that contain figures, formulas, and so forth and so on. That is only the core training. Then there's an advanced training program. There's ongoing training every single month. New videos are uploaded every month so that you will continue developing your memory skills through memoryschool. Net. There's a small enrollment fee of $200, and then you can continue on as long as you want. At only $40 per month, you can cancel at any time. I do want to help people out that are watching this webinar that are very motivated to get started, and the only thing that might be preventing you is the upfront enrollment. So what I've done as a special opportunity for people attending the Acupon code dreams for 100 uses@memoryschool.net. If you are one of the first 100 people to use code dreams at the checkout screen, you will see the enrollment fee go from $200 all the way down to $0. Yes, I am completely training the enrollment fee for the first 100 people to use code dreams@memoryschool.net. Chester Santos here with a quick summary of the webinar for you. The three main principles again to keep in mind for developing a powerful memory are number one, turn whatever you want to remember into visuals. Number two, try to involve additional senses as you can from there. Three, while you are seeing and experiencing all of this in your mind. Try to make it unusual, extraordinary in some way to take advantage of the psychological aspect to human memory. A quick review of the steps to keep in mind for remembering names. Step number one when you are introduced to someone, repeat the name immediately. Step number two, ask the person a question using their name early on in the interaction. Step number three, try to think of a connection between the name and anything at all that you already know. Step number four use the name one last time before you leave, whatever type of event you may be at and for further training memoryschool net.", "words": [], "utterances": null, "confidence": 0.952492450459784, "audio_duration": 2975.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Chester Santos, the international man of Memory here. Memory is a fundamental part of learning and the acquisition of knowledge. improving your memory skills can have a positive impact on multiple areas of your life. A two minute short video is going to play with some of my presentation clips. And then I'll be back with the webinar that works.\n- Chester Santos is the United States memory champion. He captured the title this past weekend in New York City. Some of his techniques stretch all the way back to the ancient Greeks. He's got the power to educate, to thrill and memorize.\n- Exercise your visualization ability, and your visual memory is incredibly powerful. If you were able to complete that simple exercise, then you have the ability to remember anything at all that you would ever want to remember quickly and easily.\n-  Chester Santos: When it comes to dealing with people, we are not nearly as good at remembering names. He says one way to improve your memory is to turn the name somehow into a visual. Santos: As you activate more senses in the encoding process, you are building more connections in your mind.\n- Use nothing but your brain and memory. I'm going to have you attempt to commit to memory the following random list of words. The key to this is to shift your approach just a little bit when it comes to any sort of memory task. Try to come at it more as a fun opportunity to use your creativity and your imagination.\n- This technique is called the story method. It is just one of many techniques that memory champions like myself use to pull off extraordinary feats of memory. Your job is to simply replay through this little story that you've created in your mind. Each major object that you encounter in the story will give you the next word.\n- If you will stick to this type of training with the story method and other similar types of techniques, you will notice many benefits over time. Your memory will improve because your brain is very trainable. People are losing memory ability due to becoming too dependent on electronic devices.\n- Research suggests that by engaging in rigorous brain exercise, you can build up what they're calling cognitive reserve. This can apply to even very complex types of information. It's about building mental note cards or mental cue cards that remind you of something more complex.\n- You've just memorized the top five exports of the UK. See and experience it happening in your mind as best you can. Those simple images serve as note cards, mental note cards. A little bit in terms of memory skills training will go a long way towards setting you apart.\n- Remembering people's names and things about them helps you to build better business and personal relationships. If you are not remembering names or calling people by the wrong name, this can be detrimental to relationships. Here are some tips to help you get good at remembering names.\n- Acupon code dreams for 100 uses@memoryschool. net. If you are one of the first 100 people to use code dreams at the checkout screen, you will see the enrollment fee go from $200 all the way down to $0. Three main principles for developing a powerful memory.", "auto_highlights_result": {"status": "success", "results": [{"count": 3, "rank": 0.07, "text": "memory skills training", "timestamps": [{"start": 2331712, "end": 2333082}, {"start": 2345508, "end": 2346526}, {"start": 2522428, "end": 2523702}]}, {"count": 1, "rank": 0.06, "text": "memory skills techniques", "timestamps": [{"start": 2116330, "end": 2119270}]}, {"count": 3, "rank": 0.06, "text": "human memory", "timestamps": [{"start": 877708, "end": 878434}, {"start": 953832, "end": 954670}, {"start": 2936896, "end": 2938230}]}, {"count": 1, "rank": 0.06, "text": "memory workshops", "timestamps": [{"start": 1966316, "end": 1967666}]}, {"count": 4, "rank": 0.06, "text": "long term memory", "timestamps": [{"start": 931136, "end": 932246}, {"start": 939552, "end": 940294}, {"start": 945588, "end": 946762}, {"start": 2651988, "end": 2653178}]}, {"count": 1, "rank": 0.06, "text": "memory champions", "timestamps": [{"start": 1426812, "end": 1427842}]}, {"count": 1, "rank": 0.06, "text": "memory task", "timestamps": [{"start": 1106472, "end": 1107214}]}, {"count": 1, "rank": 0.06, "text": "memory expert", "timestamps": [{"start": 158408, "end": 159166}]}, {"count": 1, "rank": 0.05, "text": "remembering information", "timestamps": [{"start": 2819762, "end": 2820726}]}, {"count": 23, "rank": 0.05, "text": "names", "timestamps": [{"start": 164878, "end": 165294}, {"start": 184208, "end": 184518}, {"start": 634742, "end": 635366}, {"start": 657342, "end": 657966}, {"start": 692836, "end": 693322}, {"start": 696922, "end": 697402}, {"start": 962840, "end": 963278}, {"start": 1107758, "end": 1108222}, {"start": 2128620, "end": 2129270}, {"start": 2385152, "end": 2385574}, {"start": 2385936, "end": 2386246}, {"start": 2388134, "end": 2388406}, {"start": 2419602, "end": 2420098}, {"start": 2457118, "end": 2457454}, {"start": 2505192, "end": 2505486}, {"start": 2514296, "end": 2514974}, {"start": 2525484, "end": 2525746}, {"start": 2531234, "end": 2531506}, {"start": 2539472, "end": 2540038}, {"start": 2668476, "end": 2669346}, {"start": 2689878, "end": 2690390}, {"start": 2800202, "end": 2800650}, {"start": 2942022, "end": 2942422}]}, {"count": 1, "rank": 0.05, "text": "new people", "timestamps": [{"start": 550612, "end": 551934}]}, {"count": 1, "rank": 0.05, "text": "many people", "timestamps": [{"start": 2789888, "end": 2790698}]}, {"count": 2, "rank": 0.05, "text": "more techniques", "timestamps": [{"start": 2771884, "end": 2773090}, {"start": 2815906, "end": 2816786}]}, {"count": 1, "rank": 0.05, "text": "most people worlds", "timestamps": [{"start": 829372, "end": 830310}]}, {"count": 3, "rank": 0.05, "text": "most people", "timestamps": [{"start": 479004, "end": 479714}, {"start": 829372, "end": 829910}, {"start": 1547060, "end": 1547806}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}