{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/b7f6d219-a528-4f34-a205-5c803c2b2cea", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["advancements", "aims", "applications", "both", "building", "cases", "challenges", "classical", "compared", "comprehensive", "computations", "computers", "computing", "conf fourty two", "emerged", "emmanuel samir harris", "fields", "foundations", "freelance software developer", "from", "frontiers", "gamechanging", "groundbreaking", "has", "highlighting", "illustrating", "industries", "opens", "principles", "programming", "provide", "realworld", "software", "stories", "these", "transforms", "underpin", "unleashing", "years"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "25d940e3-0424-40ed-bc51-c5cd214afb44", "status": "completed", "error": null, "text": "Hi, I welcome you all to topic week of unleashing the power of quantum computing from theory to practical application. My name is Emmanuel Samir Harris, and it's a pleasure to present my presentation before you for this conference, that is conference 42, Quantum Computing 2023. So let's get started. Unleashing the power of quantum computing from theory to practical application quantum computing has the potential to revolutionarize the world of computations. In this presentation, we'll explore the basic of quantum computing, its practical application, and future development. Quantum computing basic okay, let's start with the basic. As everything has a basic, so even quantum computing has basics. Quantum bits, qubits that what we call quantum bits or qubits, is a fundamental unit of quantum information. Unlike classical bits, which can only have two states, zero or one, qubits can exist in a superposition of both state at once. This gives quantum computations the potential to perform certain calculations much faster than classical computers since they can process many possible inputs simultaneously. Qubits can be implemented in various physical system such as ions, superconducting circuits, or even individual photons. However, qubits are subject to various sources of noise and error, which can make it difficult to maintain their delicate quantum states as a long period of time. As a result, much of quantum computing research is focused on developing error correction techniques and improvement the quality of qubits. Unlike classical bits, qubits can exit in superposition of states, allowing for multiple calculation to take place simultaneously. Let's come to the second thing. These second thing is of quantum mechanics. Quantum computing makes use of principle quantum mechanics, including entanglement and tunneling. Quantum mechanics is these branch of physics that studies the behavior of matter and energy at the smallest scale, such as atoms and subatom particles. It includes concepts such as wave particle duality, superposition, and entanglement, which are fundamental to our understanding of quantum computing. While quantum computing is still in its early stage of development, researchers believe that it has the potential to revolutionarize fields such as cryptography, material science, and drug discovery. As the technology continues to improve, we may see more and more application of quantum computing in coming years. The third a brief history from the first quantum algorithm proposed by Richard Feynman in 1982 to the development of the first quantum computers in the 1990s, the field of quantum computing has made great stride in recent years. Let's continue more below. A brief history of the quantum computing quantum computing has been an activity area of research since the 1980s, when the physicist Richard Heyman first proposed the idea of using quantum systems to stimulate quantum phenomena more efficiently than classical computers. In 1994, Peter Shaw develops a quantum algorithm that could factor large number of exponential faster than any known classic algorithm, demonstrating the potential of quantum computers to solve problems that are intracellible for classical computers. In the year followed, shore algorithm researcher develop a number of other quantum algorithms such as a Grover's search algorithm and the quantum simulation algorithm. The first experimental demonstration of quantum computing were also carried out in the 1990s using system such as nuclear magnetic resonance, NMR and iron traps. Since then, the field of quantum computing has continued to grow rapidly with the development of new hardware architectures, programming languages and quantum algorithms. Notably, milestones include the creation of the first five qubit and 16 qubit quantum computers by IBM in 2016 and 2017, respectively, and the development of fault tolerant quantum error correction codes by several research groups. Despite the progress in quantum computing, many challenges remain. One of the biggest challenges in the development of large scale, fault tolerant quantum computers, which will require significant improvement in qubit quality and error correction technique. Nevertheless, researchers remain optimistic about the potential of quantum computing to revolutionize fields such as cryptography, material science, drug discovery in the coming years. Popular quantum algorithm shows algorithm we have Grover's algorithm and quantum machine learning. Let's go through them one by one. Shows algorithm shows algorithm is a quantum algorithm for integer factorization. It allows for efficient factorization of large number which has important applications for cryptography. Many encryption schemes rely on the fact that factoring large number of computations difficult for classical computers. However, Shore's algorithm shows that this problem can be solved quickly on a quantum computer, which would render many current encryption method insecure. Grover's algorithm Grover's algorithm is a quantum algorithm for searching an unsorted database. It can speed up search problems by an exponential factor, making it a powerful tool for optimization. For example, if you had a database of nth items and you want to find a particular item, a classical computer would need to search through all n items one by one, taking O n and a time. Grover's algorithm, on the other hand, can solve the problem in o square at n time, which is significant speed up for large databases. Quantum machine learning quantum machine learning is an emerging field that combines quantum computing with artificial intelligence. As you can see that the future of artificial intelligence is combining it with the quantum machine learning. It has the potential to enhance AI by processing data much faster than classical computers. Some of the application of quantum machine learning includes image and speech recognition, drug discovery, and material science. However, quantum machine learning is still in its early stage of development and much research is focused on developing new algorithms architecture for quantum computers cryptography secure communication crypto analysis secure communication quantum computing could be used to develop an unbreakable system for securing communication between two parties. Crypto analysis what is that? It is quantum computers could also be used for breaking current cryptographic system with ease, posing a major threat to security. Okay, in which area again we can actually use quantum computing. It is the drug discovery quantum stimulation quantum computing could all allow for more accurate simulation of molecular interaction, speeding up drug discovery and reducing these cost of clinical trial optimization problems. Efficiently optimizing drug candidates and designing custom molecules to interact with the specific biological target would have a significant impact on the pharmaceutical industries. What are the challenges? Developing precise model for molecules and handling the complexity of simulating large biological system are some of the challenges that researchers are currently facing. Optimization problem how can we actually help with that? Route optimization quantum computing could help optimizing delivery route, reducing transportation costs and improving efficiency. Quantum nel a quantum optimization approach that could help solve complex optimization problems across diverse industries from finance to logistics. Fluid dynamics quantum computing could allow for more accurate modeling of fluid dynamics and application in aerospace, energy production, and more manufacturing and robotics. How quantum computing can help us in this field supply chain optimization quantum computing could optimize these supply chain management, reducing cost and improving efficiency. Robotic control system quantum computing could provide more efficient control system for robotic, improving their capabilities across industries from manufacturing to healthcare. Challenges the high cost and complexity of quantum computing hardware are some of the challenges facing its adaptation in these industries. What is the future of quantum computing? Hardware advancement new hardware, architectural and material such as topological qubits could help overcome some of the current challenges in quantum computing. Software. Challenges new software tools and algorithms are needed to make quantum computing more accessible and solve real world problem impact on various industries from finance and healthcare to material science and cryptography, quantum computing has the potential to transform many aspect of our lives. Let's move on to quantum computing hardware and software. Okay, presenting the current state of quantum hardware including various technologies, superconducting iron traps, et cetera and their challenges. The slide focus on the existing quantum computing hardware technology. It highlights key technology like superconducting qubits and iron trap qubits. We can actually try to see the superconducting qubits are based on superconducting circuits and have been a popular choice due to their scalability, but they face challenges related to the maintaining qubit stability and reducing noise. Iron traps qubits, on the other hand, use trap ions to represent qubits and have the advantage of longer coerced timing mention. The other technologies that we can actually see are such as the Topo logical qubits and photon based quantum computing are also being explored. Let's explore the quantum software development framework and programming language. The example will be cusket and cirque. This slide focuses on the software aspect of quantum computing. Software plays a crucial role in designing and implementing quantum algorithm, simulating quantum system and optimizing quantum computations. Quantum software development framework and programming language provides a high level interface and tool sets for developers to work with quantum hardware and simulate quantum system on classical computers. Quizkit is one such problem framework that offers a comprehensive suite of tools, libraries and documentations for quantum programming. It is an open source framework developed by IBM Quantum and provides a user friendly and accessible environment for developing quantum application quizkits. Allows developers to construct quantum circuits, execute them on actual quantum hardware or simulators, and retrieve the results. Circ, on the other hand, is quantum programming framework developed by Google. It focuses on providing a flexible and low level interface for quantum algorithm development. Circ allows developers to define quantum circuits and computations directly, giving these fine grained control over the quantum operation and gate level manipulation. Additionally, these frames works have vibrant and active communities that provide support, share resources, and foster collaboration. Developers can access documentation, tutorials, sample codes, and even participate in hackathons and programming challenges to enhance these quantum programming skills. In summary, exploring quantum software development framework like whisket and circ empowers developers to work with quantum computers, design quantum algorithms, simulate quantum system and optimize quantum computation. These frameworks provide a high level interface resource and a supportive community to facilitate the development and advancement of quantum software, highlighting the need for error correction and quantum error correction code. Let's move and discuss about this part. Quantum computing qubits are highly sensitive to noise and external disturbances, which can lead to error and degrade the performance of quantum computations. These errors can arise from factors such as environmental interaction, imperfection in hardware computers, and inherent fragility of quantum state. As quantum computers become large and more complex, the occurrence of error becomes increasingly likely, hindering the reliable execution of quantum algorithm. To overcome these challenges, error correction techniques and quantum error correction code has been developed. Error Correction is a critical aspect of quantum computing as it allows for the detection and mitigation of errors, thereby preserving the integrity of quantum information and enabling reliable quantum computation. Quantum error correction code are specialized coding schemes that are designed to detect and correct errors in quantum states. These cases provide redundancy by encoding quantum information in such a way that error can be detected and corrected without directly measuring the fragile quantum state. The most well known quantum error correction code is the surface code which is cases on a two dimensional grid of qubits. By applying a set of carefully designed operations, the surface code can detect errors that occur during quantum computation and enable their correction. Other cases such as the color code and topological codes are also being explored for their error correcting capabilities. Quantum error correction codes are essential for achieving fault tolerant quantum computation where errors can be effectively managed and suppressed by encoding quantum information redundantly and use error correction code. Quantum computers can operate reliably even in the presence of noise and errors, highlighting the needs for error correction and quantum error correction code underscores the significance of developing robust techniques to handle error in quantum computing. System error correction course provides a pathway towards scalable and fault oriented quantum computers and ensure the accuracy and fidelity of quantum computations. Researchers and scientists are actively exploring various error correction strategies and code to improve the stability and reliability of quantum computation. By incorporating error correction technique, the potential of quantum computing can be fully realized, enabling complex computations with higher accuracy and precisions. Let's move on to these quantum algorithm and its application. In these section, let's delve into the fascination world of quantum algorithm and explore these practical applications. Quantum algorithm harnesses the unique properties of quantum system to solve certain problems more efficiently than classical algorithm. Introducing key quantum algorithms and their advantages over classical algorithm first, let's discuss some key quantum algorithm that has revolutionarized the field of computations. One remarkable example is Shaw's algorithm. It is a quantum algorithm that efficiently factors large number of tasks that would take classical computers an impractically long time shows algorithm cases a potential threat to classical cryptography system as it can quickly break the widely used RSA encryption schema. Another notable algorithm is Grover's algorithm. It provides a quadratic speed up in searching an unsorted database compared to classical algorithm. This has significant applications for data retrieval and optimizational problem where finding the best solution from a large search space is essential. Let's come to the second part that is showcasing the practical application of the quantum computing. Let's try to understand this as well. Quantum computing is not just a theoretical concept, it has promising real world applications as this whole theme of me presenting is all about that. One such application is cryptography, which with the advent of quantum computers, new cryptography algorithm resistant to quantum attacks are being developed. These algorithms leverage the unique properties of quantum systems such as quantum key distribution and quantum resistant encryption. Scheme optimization problems are another domain where quantum computing excellence many real world problems such as resource allocation, supply chain optimization and portfolio optimization involves exploring vast search space. Quantum algorithm can provide exponential speed ups, enabling us to find optimum solution more efficiently. Machine learning is an area where quantum computing hold immense potential. Quantum machine unleashing algorithm has the potential to enhance pattern recognition, clustering and optimization task. Quantum inspiration technique like quantum inspiration, neural network has shown promising result in solving complex optimizational problems. Let's come to the third part that is providing real world example and success stories to illustrate the practical impact of quantum computing. Let us share some real world example in the field of quantum chemistry. Quantum computers are revolutionarizing the simulation of molecular system. This has profound applications for drug discovery, material design and understanding chemical reaction at an unprecedented level of detail. The financial industry is also exploring quantum computing to tackle complex problems. Quantum algorithms can be utilized in financial modeling, risk analysis and portfolio optimization, enabling more accurate predictions and efficient resource allocation. Several success stories has emerged from industries embracing quantum computing. For instance, a leading airline company uses quantum computing to optimize flight routes and reduce fuel consumption, resulting in significant cost saving and reducing carbon emission in health care. Quantum computing is being explored for personalized medicine, genomics and optimizing treatment plan, potentially leading to breakthrough in disease diagnosis and treatment. By showcasing these application and success stories, we can understand the transformative potential of quantum computing in its various domains and its ability to solve problems that were previously intractable. Let's come to the next slide. That is visualizing a quantum circuit. So I have actually done that on the Jupiter Ide where I actually imported the quizkit. And as you can see, then I started drawing a quantum circuit. When building a quantum circuit, it is often helpful to draw the circuit. This is supportively, natively by a quantum circuit object. We can either call print on the circuit or call the draw method on the object. This will render an ASCII art version of the circuit diagram. Let's building a quantum circuit now. Okay. Circuit as you can see, this is what I have given. Circuit is equal to quantum circuit three comma three. And then the command. What I have given is circuit x one circuit h range. We have taken as three and circuit cx as zero and one circuit measurement as range of three to range of three. Then we have printed the circuit and this is the circuit diagram. Okay. And also we have given the circuit run. I've sourced this from the Quizkit visualization of quantum circuit unleashing the power of quantum computing. Let's now turn our attention to the challenges that quantum computing faces and explores the exciting future prospect of this transformative field. I have given these points here discussing the current challenges in scaling up quantum computers and improving qubit stability. One of the primary challenges we face in quantum computing is scaling up the number of qubits and the building large quantum computers. Currently, we are working with a relatively small scale system due to technical constraints and delicate nature of qubits. Developing robust and scalable hardware architecture is crucial to realize the full potential of quantum computing. Another challenge we encounter is improving qubit stability and reducing noise. Qubits are extremely sensitive to environmental disturbances, leading to error and decohers. Advancement in material science and engineering are needed to enhance qubit coherence times and reduce error rate, paving the way for more reliable quantum computations, touching upon the need for continued research and collaboration in the field. To overcome these challenges, it is imperative to foster collaboration and knowledge sharing across academia, industry and government institutions. Continued research efforts are required to address the technological barrier and advance the understanding of quantum systems. Collaboration enables us to pool resource share expertise and accelerate the development of quantum computing technologies. Furthermore, interdisciplinary research is crucial for tackling the multifaceted challenges of quantum computing. Experts from field like physics, computer science, mathematics, machine science and engineering must work together to develop comprehensive solution and drive progressive in quantum computing. Sharing thoughts on future prospectives and potential breakthrough the future of quantum computing is incredibly promising, incredibly promising. As we overcome the current challenges, we can expect to witness significant breakthrough and advancements in the field. Here are few potential futures prospective to look forward to. First, achieving quantum advancements where quantum computers outperform classical computers for practical problems. In a major milestone, we anticipate that quantum computers will demonstrate their security in specific domains, spurning advancement in drug discovery, optimization, machine learning and more. Secondly, the development of fault tolerant quantum computers will be a game changer. Fault tolerance will enable error correction and ensure the reliability of quantum computers on large scale system. This will unlock new possibility and acceleration, the adoption of quantum computing in various industries and scientific research. Lastly, the discovery and exploration of novel quantum algorithm and quantum inspired techniques will continue to drive innovation. These algorithms could revolutionarize fields such as optimization, cryptography, computations and data analysis, offering unprecedented computational power and insight. By highlighting the challenges and discussing the future perspective, you gain a deeper understanding of the efforts required to overcome the obstacles and the potential transformative impact of quantum computing. It is an exciting journey of exploration, collaboration and innovation that holds immense promise for the future of computations from theory to practical application. Welcome everyone. In this section, we explore the transition from the theoretical concept to the practical application of quantum computing, showcasing the immense potential in holding for real world problem. Introducing the power of quantum computing for practical application quantum computing has these potential to revolutionize various industries by providing exponential computations power for solving complex problems. Let's dive into some practical application. These quantum computing shines secondly that discussing the application of quantum computing, drug discovery and material design one of the exciting area where quantum computing demonstrates its power is in drug discovery and material design. Quantum computers excel at simulating the behavior of molecular, allowing us to explore chemical reaction and interaction more accurately. This capability has the potential to revolutionarize the development of new drugs, accelerating these discovery of material a specific property and optimize chemical process. Highlighting the impact of quantum computing on optimizational problem optimizational problem are pervasive in many industries such as logistics, finance and supply chain management. Quantum computing offers a remarkable advantage in solving such problems efficiently. By leveraging quantum computers, we can explore vast search space and find optimal solution much faster than classical approach. These has these potential to revolutionarize resource allocation, scheduling and route optimization, leading significant cost saving and improved efficiency. Exploring the potential of quantum machine learning the intersection of quantum computing and machine learning opens up exciting possibilities. Quantum machine learning algorithm has a potential to enhance pattern recognition, clustering and optimization tasks. By harnessing the unique properties of quantum systems, we can unlock new insights from complex data set and train more accurate model. This could have application in areas such as image recognition, natural language processing, that is NLP and personalized medicines. Discussing these quantum cryptography and secure communication security and encryption are paramount in a digital age. As you all know, with the advent of more complex algorithm, the security and encryption will be playing a much bigger role in our future. Quantum protography offers novel approaches to secure communications. Quantum key distribution protocol leverage the principle of quantum mechanics to ensure secure transmission of encryption keys. Quantum resistance encryption scheme are also being stories to safeguard data from future quantum attacks. Quantum computing can play a pivotal role in enhancing data security and privacy, emphasizing the potential impact on financial modeling and optimization. The financial industries heavily rely on complex mathematical model and optimization algorithms. Quantum computing has the potential to revolutionarize financial modeling, risk analysis and portfolio optimization. By leveraging quantum algorithm, we can perform advanced simulations, analysis, analyze market trends, optimize investment strategies more efficiently, leading to more accurate prediction and improving decision making. These 7th point is summarizing the transformative power of quantum computers. In summarizing, quantum computing is poised to unleash its power in various practical applications from drug discovery and optimization of machine learning and secure communication. The potential impact is immense. As researchers and industry professionals, we have an exciting opportunity to harness this power unlock new insight and solve previously intracrackable problems. Let's come to the last part that is these conclusion and the takeaway. Quantum computing is an exciting and rapidly evolving field with many potential application. While challenging. While challenges remain, progress in hardware and software is paving the way for new breakthroughs. It's important to stay informed and keep an eye on developments in this fields. Thank you for joining me on this journey into the world of quantum computing and its practical application. As we conclude, let's recap the key takeaway and transforms potential of this revolutionary field, highlighting the transformative power of quantum computing quantum computing represents a paradigm shift in computation, offering unprecedented computational power and ability to solve complex problems efficiently. By harnessing the principles of quantum mechanics, we can unlock new frontiers in science, research, optimization, cryptography, and more. The practical application of quantum computing are vast and impactful. From drug discovery and material design to optimization problems and machine learning, quantum computing has a potential to revolutionarize various industries, leading to significant advancement and breakthroughs, emphasizing the need for continued research and collaboration. However, realizing the full potential of quantum computing requires continuous research and collaboration. We must tackle challenges related to scaling up quantum system, improving qubit stability, and developing error correction techniques. Collaboration among researchers, industry experts and policymakers is vital to address these challenges and drive the field forward. The interdisciplinary nature of quantum computing necessities collaboration across multiple disciplines includes physics, computers, science, mathematics, material science, and engineering. By working together, we can leverage diverse expertise and accelerate the development of practical quantum computing technologies. Encouraging exploration and adaptation of quantum computing as quantum computing continues to advance, it is essential for individual and organization to explore its application and embrace its potentials. This may involve learning quantum programming languages, experimenting with quantum simulations, or collaborating with quantum computing companies and research institute. Quantum computing is an exciting and rapidly evolving field as researchers, professionals and enthusiasts have the opportunity to contribute to its growth and shape its practical applications. Let's stay curious, keep exploring and unlock the full power of quantum computing for the closing remark. In conclusion, quantum computing holds tremendous promise for solving complex problems that were previously intracrackable. Its practical applications span diverse domain, including healthcare, finance, optimization, and cryptography. By embracing collaboration, research and innovation, we can unleash the transformative power of quantum computing and pave the way for a future of enhanced computation and technological breakthrough. Thank you very much for being with me for this wonderful presentation. I would like to take the Q A sessions any question and answer any doubts. If you have, you can put it across to me and I will be very happy to answer it. Thank you very much. Thanks for Emmanuel Samir Harris. And I would like to thank you, the greater people who have helped me to present this presentation. Thank you. Thank you very much.", "words": [], "utterances": null, "confidence": 0.934577890275483, "audio_duration": 1962.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Unleashing the power of quantum computing from theory to practical application. Quantum computing makes use of principle quantum mechanics, including entanglement and tunneling. Researchers believe that it has the potential to revolutionarize fields such as cryptography, material science, and drug discovery.\n- Grover's algorithm is a quantum algorithm for searching an unsorted database. Quantum machine learning is an emerging field that combines quantum computing with artificial intelligence. Challenges new software tools and algorithms are needed to make quantum computing more accessible.\n- Quantum software development framework and programming language provides a high level interface and tool sets for developers to work with quantum hardware. Software plays a crucial role in designing and implementing quantum algorithm, simulating quantum system and optimizing quantum computations.\n-  error correction techniques and quantum error correction code has been developed. Error Correction is a critical aspect of quantum computing as it allows for the detection and mitigation of errors. Researchers and scientists are actively exploring various error correction strategies and code to improve the stability and reliability of quantum computation.\n- Quantum computing is not just a theoretical concept, it has promising real world applications. With the advent of quantum computers, new cryptography algorithm resistant to quantum attacks are being developed. Let's come to the third part that is providing real world example and success stories to illustrate the practical impact of quantum computing.\n- When building a quantum circuit, it is often helpful to draw the circuit. We can either call print on the circuit or call the draw method on the object. This will render an ASCII art version of the circuit diagram.\n- One of the primary challenges we face in quantum computing is scaling up the number of qubits. Another challenge we encounter is improving qubit stability and reducing noise. To overcome these challenges, it is imperative to foster collaboration and knowledge sharing across academia, industry and government institutions.\n- The future of quantum computing is incredibly promising, incredibly promising. As we overcome the current challenges, we can expect to witness significant breakthrough and advancements in the field. Here are few potential futures prospective to look forward to.\n-  quantum computing has these potential to revolutionize various industries by providing exponential computations power for solving complex problems. Quantum computing is poised to unleash its power in various practical applications from drug discovery and optimization of machine learning and secure communication. The potential impact is immense.\n-  quantum computing represents a paradigm shift in computation. By harnessing the principles of quantum mechanics, we can unlock new frontiers in science, research, optimization, cryptography. However, realizing the full potential of quantum computing requires continuous research and collaboration.\n- In conclusion, quantum computing holds tremendous promise for solving complex problems. Its practical applications span diverse domain, including healthcare, finance, optimization, and cryptography. By embracing collaboration, research and innovation, we can unleash the transformative power of quantum computing.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.11, "text": "Quantum computing qubits", "timestamps": [{"start": 788416, "end": 790134}]}, {"count": 1, "rank": 0.1, "text": "quantum computing research", "timestamps": [{"start": 122648, "end": 123730}]}, {"count": 2, "rank": 0.1, "text": "quantum computing technologies", "timestamps": [{"start": 1372504, "end": 1374650}, {"start": 1852058, "end": 1853790}]}, {"count": 1, "rank": 0.1, "text": "quantum computing companies", "timestamps": [{"start": 1875548, "end": 1877190}]}, {"count": 1, "rank": 0.1, "text": "practical quantum computing technologies", "timestamps": [{"start": 1851668, "end": 1853790}]}, {"count": 1, "rank": 0.1, "text": "quantum computing necessities collaboration", "timestamps": [{"start": 1836572, "end": 1839302}]}, {"count": 21, "rank": 0.1, "text": "quantum computers", "timestamps": [{"start": 199840, "end": 201030}, {"start": 239968, "end": 240678}, {"start": 282738, "end": 283666}, {"start": 302410, "end": 303466}, {"start": 432588, "end": 433618}, {"start": 449968, "end": 451034}, {"start": 765572, "end": 766794}, {"start": 809012, "end": 810186}, {"start": 900496, "end": 901674}, {"start": 924302, "end": 925402}, {"start": 1051150, "end": 1052326}, {"start": 1122350, "end": 1123614}, {"start": 1293472, "end": 1294806}, {"start": 1303188, "end": 1304378}, {"start": 1420760, "end": 1423198}, {"start": 1429548, "end": 1430466}, {"start": 1442438, "end": 1443606}, {"start": 1450500, "end": 1451466}, {"start": 1540590, "end": 1542118}, {"start": 1577858, "end": 1578706}, {"start": 1707828, "end": 1708810}]}, {"count": 4, "rank": 0.09, "text": "quantum systems", "timestamps": [{"start": 220008, "end": 221102}, {"start": 1060132, "end": 1060906}, {"start": 1364408, "end": 1365374}, {"start": 1612964, "end": 1613930}]}, {"count": 5, "rank": 0.09, "text": "quantum computations", "timestamps": [{"start": 90096, "end": 91606}, {"start": 672462, "end": 673614}, {"start": 796048, "end": 798278}, {"start": 927532, "end": 929266}, {"start": 1341478, "end": 1342730}]}, {"count": 2, "rank": 0.09, "text": "Quantum error correction codes", "timestamps": [{"start": 289366, "end": 291350}, {"start": 885474, "end": 887518}]}, {"count": 1, "rank": 0.09, "text": "quantum computers cryptography", "timestamps": [{"start": 432588, "end": 434642}]}, {"count": 2, "rank": 0.09, "text": "quantum circuits", "timestamps": [{"start": 710474, "end": 711450}, {"start": 730098, "end": 730994}]}, {"count": 9, "rank": 0.09, "text": "quantum machine", "timestamps": [{"start": 325868, "end": 327154}, {"start": 396134, "end": 396934}, {"start": 397296, "end": 397846}, {"start": 407812, "end": 409594}, {"start": 417128, "end": 418494}, {"start": 424040, "end": 425266}, {"start": 1092614, "end": 1093846}, {"start": 1596768, "end": 1598022}, {"start": 1604122, "end": 1604906}]}, {"count": 3, "rank": 0.09, "text": "quantum hardware", "timestamps": [{"start": 599488, "end": 600810}, {"start": 681676, "end": 682834}, {"start": 712868, "end": 713978}]}, {"count": 4, "rank": 0.09, "text": "quantum programming", "timestamps": [{"start": 695616, "end": 696806}, {"start": 718952, "end": 719806}, {"start": 754740, "end": 756010}, {"start": 1868200, "end": 1869406}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}