{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/31d47b20-2a6c-4b61-9cd1-65017304ff64", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["agile project management consultant practitioner trainer", "challenges", "common", "conf fourty two", "exceptional agility a division of exceptional", "including", "products", "realworld", "scott m graffius", "skills", "solutions", "talents", "teams", "those"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "e63213ff-5fe3-49c0-89b2-96b76ed43f1c", "status": "completed", "error": null, "text": "Hi, I'm Scott Grapheus and this is what successful AI teams have in common. From improved medical diagnosis and self driving cars to real time translation of language and virtual assistants becoming genius, artificial intelligence has emerged as a transformative force, advancing innovation and revolutionizing how we live, work, and interact. Those talk is about the skills that fuel the delivery of successful AI solutions. Take a quick break and mention that for content accessibility purposes, I'm deliberately using relatively large size fonts, whoever practical and high contrast elements such as dark text on the white background or those reverse and as you saw, I'll be describing the onscreen content. There are a few slides that may be read word for word. Most slides I'll be either summarizing or elaborating on the on screen content. And we're back. Informed by work with AI teams and confirmed by research from leading organizations including Google, IEEE, MIT, Software Engineering Institute, and many, many others. Those behind the development and delivery of life changing AI solutions, or AI teams with a fusion or combination of technical expertise, also known as hard skills, and critical soft skills, also known as people skills or interpersonal skills, amongst other labels. This is to give you a sense of the different types of skills in terms of the quantity and the range against skills for AI teams. And there are 111 here in total. And this is not intended to be an exhaustive list. No two teams are identical with regards to the skills that I'm showing here on this particular slide. However, of the 111 skills, one is paramount and one is common amongst successful AI teams. At the category level, it's soft skills. And here's what computer world says soft skills are becoming a key focus. This is reinforced by the artificial intelligence and its impact on business publication, which reports in the AI era, soft skills are the new hard skills and rounding out the category of soft skills. This example here is from the United States Artificial Intelligence Institute, and they list the different most wanted AI skills that include soft skills at the top of the list. So that's the category. The category is soft skills. What exactly within soft skills do successful AI teams have in common? Well, it's the team. And that term teams can imply and involve team dynamics, team leadership, team development, and similar terms that are used in the literature. IBM says the team is a key driver of a successful AI project. Microsoft says, don't underestimate the power of a team dynamic. Your product becomes a result of it. And then I have another example, and this one here is from MIT. And with regards to AI, MIT says competencies like teamwork are crucial. So this talk will dive into team development. It's the skill that's common amongst successful AI teams and I'm going to be delivering information that you can use based on the science of high performing teams. So here are the objectives for this talk. There are three. The first is to understand that a confluence or a combination or a mix of skills, including and notably team development, are essential. Talk about the team development phases. Those are five, and specifically the characteristics of each of those five phases. And lastly, and most importantly, usable strategies that you can apply to navigate each those to improve the team's effectiveness, which perhaps no surprise, is correlated with happiness and success. Frankly the opposite of burnout. Here's the agenda, how this talk is structured. First is the introduction, objectives and agenda, and we're almost done with that. Next is about information, a little bit about me as it relates to this talk, the five phases of team development, and then we'll have a wrap up with a conclusion takeaway and an opportunity for feedback. So here's some information about me I'm Scott Rafis. I'm an agile project management practitioner, consultant, author and speaker, and I'm the founder of exceptional Agility, which is part of exceptional PPM and PMO solutions. I have nine credentials and my background spans diverse industries, everything from advanced tech, entertainment to government, r, D and more. And as far as those product is concerned, AI would sit nicely within advanced Tech or R and D or both of those. And my work has taken me to 25 countries and counted content for my books, which are two. Talks, workshops and more have been featured and used by a variety of organizations. Here are a few and of these I'll mention a handful, Microsoft, United States Department of Energy, the English Institute of Sport, Yale University, Virginia Tech and many others. And now we're on to the phases of team development, which are five. Dr. Bruce Wayne Tuckman, who got his doctorate in psychology from Princeton University, did extensive research on what was initially referred to as group dynamics, and then subsequently the terms team dynamics, group performance, team performance, team development, group development. Those terms are used interchangeably in the context of the basis of team development, and he did publish his model in 1965. That model is still highly relevant, relevant and beneficial today. That's why it's central to the discussion of team development, and my talk will draw on my own firsthand experience using this information, and it is supported by extensive research and recommendations from a variety of organizations. Earlier in this talk I showed a few examples, such as Google. You'll see Google here again. The point here is to show you a sampling of the grand total of 117 sources that were referenced and incorporated into this talk and discussion. And I do make all those references available to you. I'll show you at the end of this talk, if you're interested, how you can access that information. So here I'll mention a handful. I already mentioned Google, so if I mentioned them again, but IBM, Microsoft, MIT, Imperial College London, DevOps Institute, many, many others. Again, a grand total of 117. And to underscore, because the model came out in 1865, to underscore the continuing relevance and value of the model, this talk is based on those 117 sources, as I mentioned, most of which were published in the last ten years, and of those, many of them in the last year alone. So to introduce and navigate models like those one on team development, I have found in my experience that interesting visuals and practical examples can be extremely helpful. So of the 117 sources, I extracted the usable practical information, put it into plain language, and carefully and diligently incorporated it into this presentation. So that's what I've done. But visuals are very important. So I have found that at least as it relates to this presentation, clip art just does not work. No, clip art does not work. There's no stock photos and there's absolutely no generic content. It's all from me, custom, all of it. So here's those phases of team development, which is again a custom visual which gives the big picture. As mentioned earlier, I endeavor to use wire size font for content accessibility purposes. Here you're just getting sort of the thumbnail view. In a moment, I'll be zooming in on the content and it'll be more readily readable at that point. So this is just the thumbnail. But while we're here at the top, you'll mention that across the five phases of teams development, development forming, storming, norming, performing and adjourning, there's a graph and what it depicts is the general level of performance or productivity across the five phases. Two things I want to point out here with regards to the graph. One is that storming is at the lowest and the highest is performing. And then below the markers for the five phases, there's a row for the characteristics. These are the behaviors or what's typically seen in most teams in the respective those. And then below that the next row are strategies. These are the proven strategies according to the literature and my own experience, that can be applied to the respective phase to help advance the team forward, which means move on to the next phase. So while talking about the phases, I wanted a visual also to represent a team because this is about people. And for inspiration, I looked to when this model came out, 1965, I didn't find anything that resonated or was usable. However, a few years later, 1969, these characters were introduced. So this is obviously the more modern Lego incarnation of these characters. But this is a custom photograph of relatively expensive collectible figures. And I'll be using versions of this image in configurations as we navigate the five phases of team development. And here we are. First up is forming. So this is when an example of forming would be an AI team coming together for the first time, or somebody new joining AI team. Somebody left, somebody joined, or somebody just joined. So this can be a group of people who have never worked together before, who have all worked together before, or some combination. This model applies to all those scenarios. These are the characteristics, those are the behaviors that are typically seen during the forming phase. So if you're unsure where the team is, you can almost use the characteristics as sort of the diagnostic criteria for exactly where the teams is. So during forming, people are displaying eagerness and socializing, and they're generally pretty polite, sticking to safe topics. But even if information is shared up front, even if people have worked together before, even if there's a general sense there is some newness, right. Because those is forming. And with that, it's perfectly normal, according to Dr. Tuckman and countless studies since, to have a level of anxiety and questioning during forming, very normal. All those behaviors are normal and typical of forming. So what can you do as a leader? So as a leader, perhaps you're a sponsor, perhaps you're an executive, perhaps you're actually embedded, you're a member of the AI team regardless of your exact title, right? You could be an engineer, you could be a scrum master, or a project manager, or you could be the business analyst, right? Somebody, though, can take this information and apply it for everyone's mutual benefit. These are the strategies to help the team grow and advance, and that means move on. So somebody, again, doesn't matter who or what their exact title is, is taking the lead and making themselves very visible and facilitating interactions. If there's even one person who hasn't worked together before. And speaking of which, even if the team has worked together before, perhaps a two minute icebreaker, right? Icebreakers aren't just for people who have never worked together before. They can be very helpful for teams that have worked together before and just kind of want to have a fresh start or a fresh perspective and learn more about each other before delving into the work at hand. So the leader can facilitate those reductions provide as much information as possible. At this point. So many it have, particularly ones that have worked together before, have a very strong sense of sort of the values and the principles and the ethics and exactly what sort of the steps are involved and others are kind of reinventing themselves. And this applies to all scenarios. But whatever it is that's known to be shared upfront as quickly as possible during the forming phase, establishing clear expectations if there is any success criteria, such as we need to have an iteration or whatever it's called, your organization. Sometimes they're called R and D cycles, sometimes they're called sprints or iteration, sometimes they're just called a project. It doesn't really matter what the label is, but if there is some sort of this is going to be wrapping in two weeks or at the end of the month or whatever information is applicable for this team should be communicated sooner rather than later. During the forming phase is those beginning, so that's the best time. And whenever there's a question or concern, quick response times are particularly helpful. By the way, some of these strategies might seem like they're good common sense, and I would agree if that's what you're thinking. The literature says that these are the strategies that are particularly powerful at the respective phase. That's why they listed here, even though some of this information, like quick response times, is just probably a good practice regardless of what phase you're in, right? So next up is storming and what happens during storming. These are the characteristics of the team typically. And by the way, there's no fixed duration for these phases, right? A team that generally speaking has never worked together before might be informing and storming a little longer than a team that has worked together before. But there's no fixed duration. Storming can be a business day or less, or it can be the entire length of the project has happened. So here's the description of what occurs during the storming phase. There can be resistance and that couldn't translate potentially to a lack of participation. There can be conflict based on differences of opinions. And regardless of those formality with regards to structure in the organization, there can be sort of competition, jockeying for position. Emotions can be, relative to other phases, relatively high. These are normal characteristics, according to Dr. Tuckman in countless objective studies over the decades since. What can you do about the storming phase? Here are the strategies to help those team grow in advance, which means move out of it into those next phase, requesting and encouraging feedback. Here's what is meant by that. An example would be something that worked out quite well with several EI things I was involved in. And that is somebody saying something along the lines of if you ever have a question, concern, issue, impediment, whatever the label is, big or small, at any time, please let me know and then give examples. You can come into my office, you can hop on a zoom, you can email me or text me, right? And so you're soliciting and inviting and encouraging feedback that will result in feedback. And then once you receive it, whoever that person is, they need to acknowledge it and handle it. Otherwise that person will come back with more feedback. The point here is that many teams, including successful teams, for some issues or impediments or problems or concerns, will kind of wait till the end when we'll cover that, but wait till the end for a retrospective or a post project review or whatever the label is at your organization to provide that feedback. But you know, that could be two weeks away, it could be a month away, it can be days away. Why not get it resolved sooner rather than later? And by repeatedly, sincerely and professionally, politely inviting and requesting and encouraging feedback and responding appropriately goes a real long ways to brainstorming in those case in particular, and for the life of those project as well. So I'm going to jump down to the last bullet point here, building trust by honoring commitments. Now, not every organization uses agile, let's say scrum or strength. Some do, though, so I'll just use this as an example and it would still apply to other situations. Here would be a situation where there's going to be a daily stand up, it's going to be from ten to 1015 local time, it's going to be in person, and for people who are remote, they'll join remotely, and it's where each person will share. Typically, the points are you can do whatever you like, but they're typically what did you do since the last meeting? What are you going to do today? And any issues or impediments. Another invitation for feedback. And it's called a daily stand up or daily scrum because it happens daily, that is, every business day. So it's inevitable that for whatever reason, a meeting or two might get canceled over the lifespan of the sprint iteration project program, whatever it's called. So that's not really a problem. But what if it's a new team and you have a daily scrum and the first five are canceled in a row are canceled. So what I'm getting at is this, and it might seem quite obvious, but I think it really teams, articulating and that is trust is a very complicated thing in the context of team development. The most powerful thing you can do to build an advanced trust is to honor commitments. That doesn't mean you can't ever change your mind or cancel a meeting. But honoring your commitments goes a real long ways to building trust. So next up is the norming phase. It is the second highest level from a performance or productivity standpoint. You can see the graph above. And here is a very different visual of the team kind of starting to kind of form some connections here. That first bullet point talks about developing cohesion. Here relative to earlier phases, purpose and goals are more well understood, which can translate to higher levels of confidence and commitment. People are engaged and supported, and if there was any anxiety earlier during forming or storming, particularly storming, which is normal, it is either lowered or eliminated during the normal phase. So here's what you can do to help the team grow in advance, which means move on to the next phase. That is not waiting necessarily to the end. Doing it now would be recognizing individual and team efforts, providing learning opportunities, if appropriate, at your organization and feedback during while this project or program or sprint is live. And here those last point of monitoring the energy of the team. The team is at its second highest level of productivity. They're doing quite well. They're almost at the highest level of productivity. If things are going well, whoever that person is, they're taking a step back, right? They're not being in the front driver's seat. They're kind of stepping back and monitoring the energy of the team. And then that brings us to forming. Sorry. From norming to performing rather. And this is those highest level of productivity and performance, which according to the literature is correlated with happiness and success. Perhaps no surprise there very different visual showing a different kind of level of connections amongst the team members. And that first bullet point speaking to it. Demonstrations of interdependence and self management, sometimes called self organization. Those is compared to the earlier phases, high motivation, trust and empathy. People will typically refer to those larger team needs versus their own personal needs or individual needs. And just to make it clear, the team is consistent and effectively producing deliverables during those phase. So here's the strategies to help the team grow in advance. So if they're in the highest level of performance, the reason, if you're wondering why I bring this up is because this is an open active those until it's done, this is ongoing. So this is to keep the momentum going, diving from the side, similar to what I mentioned earlier for minimal intervention. Celebrating successes has different meanings of different organizations. So you do whatever you can at your company for the team to celebrate its successes and not necessarily waiting just for the end of the project program, sprint iteration to do so, if you can, and encouraging collective decision making and problem solving. Having said that, if the team is in the performing phase, they're very likely already practicing that third ballpoint already. And then that brings us to a journey, the fifth and final phase of the phases of tomb development. And here, even if this group of people will continue working together, this is really marking the end of a sprint iteration project, program, or whatever the label R D cycle at the organization. And I'll talk more about that. Well, right now, first of all, before doing that, I wanted to mention that if you come across any sort of literature articles or the like talking about four phases, well, they're talking about the 1965 model. When this model first came out, it involved forming, storming, norming and performing. However, Dr. Tuckman and his colleague Mary Ann C. Jensen found a journey to be so important that he, along with Jensen, modified his own model in 1977. So since Dr. Tuckman changed his model from four phases, five phases, the model has five phases, not four phases. It's important. And I also wanted to mention here, while it's formally called and properly called the adjourning phase, because that's what Dr. Tuckman called it, some people refer to it as adjourning, routineing, mourning, and have other labels for it, but it is adjourning. I include that just in case you come across that. So here, in terms of the characteristics here, it varies by organization and the type of project or teams you have. But there is the potential for sadness. That's probably why some people call it the morning those. So here's the scenario. Let's picture it's more of a classic. It's not typically done this way, but for illustration purposes, let's picture it as a classic project that runs several months, usually shorter cycles. And these are people who have largely not worked together before, and they're working very closely together, and they've achieved great results. And it's the end and it's time to kind of disband and go back to their regular roles and departments. And for people who are not accustomed to joining teams and the nature of teamwork, there can be sadness. And so I just wanted to mention that the literature is quite clear that this can happen. But there's things that you can do about this for everyone's benefit, for the individual, the team and the company's benefit, which I'll be covering. Recognizing team and individual efforts are things that the team might do on its own. And then if the team is temporary, it can disband. And again, for even teams that people are going to continue working together, this phase still applies. Here. I'll talk about strategies to help the team grow, really those strategies to help the individuals, the team and the company grow. So here's what can be done. Recognizing change, having what is referred to as a retrospective or lessons learned, or a post project review, where you can really take stock of things and incorporating those learnings into future endeavors, thereby continuously improving matters at the organization, which can give you a competitive advantage, by the way, and acknowledging the individuals and having some sort of this really will vary by organization tremendously, but some sort of a party or after party or acknowledgment by somebody in a position of leadership or somebody on the team, and some companies will at least in the well, now we're post Covid, I suppose, but pre Covid. Post Covid would go out to a restaurant on the company, right? And have a celebration or during a company meeting, we'll dedicate 510 15 minutes to talk about those success of this group of people, this teams, and what it means to the company. This is also very important, as I mentioned, not just individuals and the people on the team, but for the those company, for somebody, picture somebody who's not on the team and there is a company event of some sort, virtual or in person, and a person of leadership gets up and talks about how much they appreciate the hard work, diligence, and what it really means to the company, whether it is disrupting the marketplace or including sales or whatever the goals were of the AI endeavor during the respective cycle. And people who are obviously on the team will hear that and appreciate that. But it also sends a message, a very strong message, to people who, to everybody, including people who were not on the team, about how much the company appreciates this sort of effort. And so celebrating the team's accomplishments. The importance and value of that cannot be overstated. It is extremely powerful. So those are the key highlights from the five phases of team development, and we're now transitioning to the wrap up. This presentation advanced that confluence or a mix of skills, including and notably team development, are crucial to the delivery of successful AI solutions. It is just that it's team development that successful AI teams have in common. And then the session dived into the five phases of team development, talked about the characteristics of each one, and provided usable strategies for navigating the phases from beginning to end which improves when applied it teams effectiveness which also can be correlated with happiness and success which if you apply it can give you, your teams and your organization a competitive advantage. So if you'd like to connect, I'd love to connect with you. A lot of my information rather than listing all of my social media accounts on the screen here I just have my website@scottgraphis.com on my front main page are links to my different social accounts. So I'd love to connect with you if you would. And then as promised, I have a takeaway. It is the main visual of the phases of team development and the 117 sources. The references that went into this talk are all listed in the bibliography. This is a PDf file, so if you have to scan the code or in lowercase bit Lya, it may take a moment or two or three to load on your screen and then you can save the PDF to your hard drive. And then lastly, feedback really lets me know what's working and what's not, what you liked and what you wish I had spent more or less time on. And so I have created a very simple Google feedback form with your name, your email and what did you think? I think it's just three questions very quick. So if you are interested in providing feedback, I would find it. I would be very much appreciative of your feedback. You can scan the code or you could enter in in lowercase bit ly s seven and then that will bring up the Google form. I also wanted to make it easy to connect. I talked about how you go to my website, but if you would like to provide feedback after you hit those send button on the Google form, a new page appears where I thank you for providing feedback and I give you a link to all my social accounts. So that's those for you as well. So I look forward to hearing your feedback and talking with you further at the conference.", "words": [], "utterances": null, "confidence": 0.936682601232387, "audio_duration": 2042.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Artificial intelligence has emerged as a transformative force, advancing innovation and revolutionizing how we live, work, and interact. This talk is about the skills that fuel the delivery of successful AI solutions. Most slides I'll be either summarizing or elaborating on the on screen content.\n- Of the 111 skills, one is paramount and one is common amongst successful AI teams. The category is soft skills. What exactly within soft skills do successfulAI teams have in common? Well, it's the team. This talk will dive into team development.\n- Scott Rafis: Dr. Bruce Wayne Tuckman published his model of team development in 1965. This talk is based on 117 sources, most of which were published in the last ten years. To introduce and navigate models like those one on team development, interesting visuals and practical examples can be extremely helpful.\n- Across the five phases of teams development, development forming, storming, norming, performing and adjourning, there's a graph. What it depicts is the general level of performance or productivity. I wanted a visual also to represent a team because this is about people.\n- During forming, people are displaying eagerness and socializing. The leader can facilitate those behaviors and provide as much information as possible. Icebreakers aren't just for people who have never worked together before. Quick response times are particularly helpful.\n- Next up is storming and what happens during storming. Storming can be a business day or less, or it can be the entire length of the project. Here are the strategies to help those team grow in advance. Request and encouraging feedback.\n- Building trust by honoring commitments. The most powerful thing you can do to build an advanced trust is to honor commitments. That doesn't mean you can't ever change your mind or cancel a meeting. But honoring your commitments goes a real long way to building trust.\n- Next up is the norming phase. It is the second highest level from a performance or productivity standpoint. Here purpose and goals are more well understood, which can translate to higher levels of confidence and commitment. Here's what you can do to help the team grow in advance.\n- From norming to performing rather. This is those highest level of productivity and performance. According to the literature, this is correlated with happiness and success. Celebrating successes has different meanings of different organizations.\n- When teams disband, there can be sadness. But there's things that you can do about this for everyone's benefit, for the individual, the team and the company's benefit. Here, I'll talk about strategies to help the team grow.\n- Scottgraphis. com has created a simple Google feedback form with your name, your email and what did you think? Successful AI teams have in common the five phases of team development. I look forward to hearing your feedback and talking with you further at the conference.", "auto_highlights_result": {"status": "success", "results": [{"count": 8, "rank": 0.09, "text": "AI teams", "timestamps": [{"start": 24282, "end": 25010}, {"start": 92832, "end": 93606}, {"start": 109812, "end": 111150}, {"start": 142768, "end": 143734}, {"start": 168142, "end": 169410}, {"start": 217246, "end": 218238}, {"start": 267326, "end": 268530}, {"start": 1879778, "end": 1880386}]}, {"count": 18, "rank": 0.09, "text": "team development", "timestamps": [{"start": 228354, "end": 229378}, {"start": 262836, "end": 264094}, {"start": 287442, "end": 288262}, {"start": 292464, "end": 293254}, {"start": 341808, "end": 343046}, {"start": 422952, "end": 423646}, {"start": 445150, "end": 446102}, {"start": 451188, "end": 452190}, {"start": 467320, "end": 468530}, {"start": 556772, "end": 557722}, {"start": 606068, "end": 606794}, {"start": 740352, "end": 741610}, {"start": 1293408, "end": 1294454}, {"start": 1857828, "end": 1858554}, {"start": 1869198, "end": 1870450}, {"start": 1876578, "end": 1877714}, {"start": 1885804, "end": 1886706}, {"start": 1937068, "end": 1937938}]}, {"count": 1, "rank": 0.08, "text": "successful teams", "timestamps": [{"start": 1151574, "end": 1152954}]}, {"count": 1, "rank": 0.08, "text": "team performance", "timestamps": [{"start": 443366, "end": 444490}]}, {"count": 1, "rank": 0.08, "text": "many teams", "timestamps": [{"start": 1149710, "end": 1150662}]}, {"count": 2, "rank": 0.08, "text": "team dynamics", "timestamps": [{"start": 226098, "end": 227170}, {"start": 440864, "end": 442022}]}, {"count": 1, "rank": 0.08, "text": "team leadership", "timestamps": [{"start": 227250, "end": 228258}]}, {"count": 1, "rank": 0.08, "text": "Recognizing team", "timestamps": [{"start": 1689390, "end": 1690522}]}, {"count": 1, "rank": 0.08, "text": "new joining AI team", "timestamps": [{"start": 758068, "end": 760542}]}, {"count": 1, "rank": 0.08, "text": "high performing teams", "timestamps": [{"start": 275048, "end": 276826}]}, {"count": 1, "rank": 0.08, "text": "most teams", "timestamps": [{"start": 668728, "end": 669598}]}, {"count": 5, "rank": 0.08, "text": "successful AI teams", "timestamps": [{"start": 23700, "end": 25010}, {"start": 167406, "end": 169410}, {"start": 216390, "end": 218238}, {"start": 266718, "end": 268530}, {"start": 1879130, "end": 1880386}]}, {"count": 1, "rank": 0.06, "text": "team development phases", "timestamps": [{"start": 292464, "end": 293702}]}, {"count": 1, "rank": 0.05, "text": "other phases", "timestamps": [{"start": 1071144, "end": 1071854}]}, {"count": 2, "rank": 0.05, "text": "earlier phases", "timestamps": [{"start": 1334188, "end": 1335218}, {"start": 1443820, "end": 1444902}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}