{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/d6c62af3-4617-4b7a-91a4-5054b5015b55", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["assesses", "be", "benefits", "business", "computers", "computing", "conf fourty two", "daniel goldsmith", "digital catapult", "from", "introduces", "opportunities", "pippa spencer williams", "programme", "progress", "promises", "qtap", "realise", "reviews", "senior innovation partner", "senior quantum computing technologist", "started", "threats", "transformational", "users"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "44700c82-de02-4e28-9025-2654e614a0a2", "status": "completed", "error": null, "text": "Hello, I'm Daniel, and it's a pleasure to be here today and to talk to you. So, in my presentation, I'm going to explain how qubits differ from classical bits, and I'm going to look at where quantum computing can have an advantage over classical computing. So our existing NISC quantum devices have limitations, and I'm going to talk about how these might be resolved in the future. And we'll look at a future where we might see large, fault tolerant, universal quantum computers that will be truly transformational. So, for the moment, the three use cases for near term quantum devices are quantum optimization, quantum simulation of physical systems, particularly quantum systems and quantum machine learning. So my amazing colleague PipPa will talk about these use cases and their possible business benefits. And then Pippa will go on and look at our quantum data center of the Future Technology Access program Qtap, which launches in September. This free program will give education, training in quantum computing, access to experts, to reviews use cases, and access to quantum computing simulation tools, and the Orca PT one quantum computer. So Qtap is a unique chance for business users to get started on their quantum journey. But before I start that, I'd just like to briefly describe digital catapult, the organization that I represent. So, digital Catapult is the UK authority on advanced digital technology. And through collaboration and innovation, we accelerate industry adoption to drive growth and opportunity across the economy. So our technologies include five g and six g, artificial intelligence and machine learning, immersive technologies, Internet of Things, distributed ledger, and now quantum. And we deliver acceleration and innovation programs. We build test beds and demonstrators, and we facilitate r and D projects. So now I'm going to start my overview of quantum computing. And you're probably feeling a bit bombarded at the moment because there's a lot of information out there about quantum computing. And maybe you're wondering, is this hype, is this another it boom and bust cycle? Are there really opportunities for my organization, or is it forever five years away? Should I get started now? And if so, how should I get started? But before we answer those questions, let's go back to basics and let's describe what a qubit is. And let's do that by a thought experiment. The quantum egg timer. So the quantum egg timer starts off as full, just like a classical egg timer. And at the end of the thought experiment, the quantum egg timer is empty, just like the classical egg timer. But in the middle of the thought experiment, something quite unusual happens. Because it's a quantum egg timer, it knows the sound comes in lumps. Quantum means a lump. And so it knows it can't be half full and half empty. It's got to be either full or empty. And the way this conundrum gets resolved is if we actually measure the quantum ectiler, half the time, we find it full. And the other half of the time, we find it empty. So this quantum mechanical effect. Is completely outside of our normal experience. Because the objects we see in our day to day life. Made up of billions and billions of atoms. And the quantum mechanical effects typically get washed out. And so a qubit is just like the quantum egg timer. And it has similar states. So, like the egg timer, the qubit starts off in a full state. So a qubit might be an electron in a magnetic field, maybe an electron in an atom. And it has an excited state and a ground state. But whatever, it just starts off in one state. There's nothing strange or weird about that. But if we take a qubit. And we drive it with a pulse of electromagnetic radiation. Of exactly the right frequency and right duration. We can drive it into this superposition state. Where it is literally in two states at the same time. And then if we continue the pulse, we can then drive it into the ground state. So, so far, very good. Very interesting. But you're probably wondering, what has this got to do with computing? Well, as you well know, in your classical device in the computer, I'm recording this in in my mobile phone. The units of computation are either on or they're off. But a qubit is different. A qubit is on if it's in the excited state or off if it's in the ground state. But it can be in this weird superposition of started. Where it's literally in two states at the same time. And it's parallel processing over mini qubits in superposition. That can give quantum computers huger benefits over classical computers for certain algorithms. So all classical computers are fundamentally the same. They all work in a sequential manner. It's like reading a book letter by letter, word by word, sentence by sentence. Whereas quantum computer is like reading the whole book all at the same time. So another important quantum mechanical concept for quantum computing is entanglement. And the idea of entanglement is that two qubits are very closely correlated. So maybe we measure qubit one, and we find it's in the excited state. Well, that means that if we measure qubit two. Then it will be in the ground state and vice versa. If we measure qubit one and it's in the ground state, qubit two will be in the excited state. But so far, actually, that's not really that mysterious that similar correlations can be found in classical systems. But say that I measure the qubit by changing the magnetic field so that it goes into the screen, and I measure it, and I find that it's pointing out of the screen. One of the qubits is pointing out the screen. That means the other qubit will be pointing into the screen. And if I find that one of the qubits is pointing into the screen, that means that the other qubit is pointing out of the screen. And entanglement is a very interesting effect, not only because it's a primitive for quantum computing, but it forms the basis of quantum key distribution, because measuring one qubit effectively forces the other into a known quantum state. If someone comes and measures the qubit, then effectively, they can mess up the quantum distribution. So, now let's have a look at a quantum computing circuit. So, this quantum computing circuit has two qubits, and the time advances from left to right during the computation. So the two qubits start off, and they're initialized. That means they're both in the ground state, and then a quantum single qubit gate is applied. It's called the Hadamal gate. And that sounds like very mysterious. What does it do? But in actual fact, we've seen that before, because the Hadamar gate does nothing more than take a qubit in the ground state and force it into superposition of two states. And then we move on, and we see something we haven't seen before, a quantum two qubit gate. And that means that the state of the top qubit can influence the state of the bottom qubit. This is actually a c zero gate, and it means that if the top qubit is in the excited state, the bottom qubit will be forced to flip its state, and the computation advances. And at the end, we make a measurement, and we get a classical bitstream out. And the reason I've shown this is because it quite nicely shows the limitations that we have at the moment. So, the first challenge that we have at the moment with the quantum devices of today is that there's noise. The quantum states are very fragile. They easily get disrupted. And because of this noise, the gate depth is quite limited. You really, for someone quantum alchemist, want to stack up a large number of gates. But if you try and do that, often, the signal just gets washed out by noise. The second challenge is the number of qubits is quite limited. To do worthwhile computations, we ideally want thousands of error free qubits. At the moment, IBM have a device of 433 noisy qubits. So we're maybe quite some way away from where we need to be. And the third challenge is that, ideally, for our quantum algorithm, we want all the qubits connected, each qubit connected to every other qubit. But in quantum devices, that connectivity is quite limited. Maybe one qubit might be connected to only two or three other qubits. So let's look at where we are today and the likely next steps. But to do that, let's have a quick look at the history of quantum computing. So, in the 1980s, the fundamental concepts were developed. David Deutsch described a universal quantum computer. Universal means it's a quantum computer that can run any algorithm. And Richard Feynman, an american physicist, proposed a quantum computer to simulate physical systems. And then in the 90s, some quantum algorithms were developed, almost 30 years ago now. And the strange thing about the algorithms was David Deutsch also realized that it's possible to have a quantum speed up because he designed an algorithm where a quantum computer could do a computing in one shot, but it would take a classical computer, two shots. And Shaw expanded on that idea, and he developed an algorithm to factorize prime numbers on a quantum computer. That seems to come with the promise that it will take a quantum computer, a polynomial number of steps for a calculation. It would take a classical computer, an exponential number of steps. What that means in practice is that we'll be able to factorize large numbers on a quantum computer one day, that we wouldn't be able to factorize on a classical computer. And the relevance of that is that Shaw's algorithm could be used to crack the RSA encryption. That's very common in the Internet. But at that time, the discussion of the basic foundational concepts and the discussion of algorithms was an academic. It was a theoretical discussion. There were no quantum devices. In fact, some people thought that quantum computers could never be built. But this century, we actually have devices for the first time. And you can see that I plotted a graph of IBM, the scale of IBM device sizes. The reason for choosing IBM is that they have a clear roadmap, and they publish the size of their current device. And in blue, we've got the actual device size. In orange, we've got their plans for the next three years. And then in yellow, I've extrapolated what size quantum computers might reach. And I have to emphasize that to get to quantum computers with millions of qubits, then we need fundamental breakthroughs in research to overcome some of the problems. Say, for example, quantum error correction is a problem. So, quantum error correction is where you try and reduce the impact of noise by having, instead of one physical qubit that's quite prone to error, club the physical qubits together into a logical qubit. If one of the physical qubits loses its quantum state, it doesn't matter, because there's enough redundancy and information in the other quantum qubits that you can detect, correct, and detect the error. So, in summary, at the moment, we're in the near scale intermediate quantum era. So there's a few noisy qubits. And the algorithms that can be run in this era are quite specialized, and they're typically hybrid algorithms, where a quantum computer works side by side with a classical computer. But the promises is in that the future, the technological challenges will be resolved. We'll see large, universal, fault tolerant quantum computers. Fault tolerant means that there's error correction involved and that these devices promise to be truly transformational and help maybe with material science, developing new materials, maybe superconductors, new drugs, better weather forecasting, really quite transformational and quite dramatic effects on the world. And, of course, they'll be able to run Shaw's algorithm. And so they're a threat as well, because they can crack our encryption schemes. So, in the nisk era, to do anything useful, we can't have very deep quantum circuits. But what we can have, and what looks as if there might be a promising route of attack, is something called variational quantum algorithms. And the idea is that we take a parameterized quantum circuit. So that means a quantum circuit where there's some parameters on the gate that we can change. And that parameterized quantum circuit maps to an optimization function, maybe for quantum machine learning, it maps to some loss function, and then we run the quantum circuit a number of times. We get a classical output, we evaluate the classical output, and then we tune the quantum computer by using the classical computer to pass back in a feedback loop the parameters. And then the new parameters are used in a further iteration, and we continue around until, hopefully, our quantum computers will carry out a useful calculation for us. So now I'm going to hand over to my colleague Pippa, and Pippa is going to talk about quantum computing use cases. Thank you very much for your attention. Great. Thanks, Daniel. So, let's take a look at some of the applications of quantum computing in the near term. The key areas that have been identified as applications of quantum computing in the more nearer term are the following. So we've got optimization, quantum simulation of physical systems and quantum machine learning. If we start by taking a look at optimization, this is quite simply the ability to optimize processes, networks, facilities by utilizing quantum annealing or variational algorithms in the quantum circuit model. Applications of this can include optimizing energy networks. So as energy networks become more and more complex, with more and more assets on the network, being able to optimize that and make it as efficient as possible is going to be really key. Optimization of the telecoms network is another one, also optimization of logistics. So fleet. So is there a better way to send parcels around the country, send deliveries round, even optimizing air cargo routes, or quite simply, factory flows within a manufacturing plant or a factory? Secondly, you've got quantum simulation of physical systems. So quantum computing can simulate a physical system such as computational fluid dynamics. And using quantum computing to do this can enable more accurate simulation of airflow or fluid flow over an aerofoil or a vehicle or a marine vessel. And it can be also leveraged for pharmaceuticals. So it can actually simulate a quantum system, because molecules are a quantum system. So quantum computing can predict or simulate the structure and properties and the behavior of molecules, so it can help in drug discovery. And finally, we've got using quantum computing or certain machine learning applications. So these can be the machine learning applications that we have today. But quantum computing can help increase the speed and accuracy, also improve scalability, and help with more efficient use of resource in that context. So with all this potential that quantum computing can bring, it's really important for yourself and your organizations to be ready for when quantum computing is to be adopted into organizations. So there are things that you can do for future proof. Firstly, post quantum cryptography is so, so important. Quantum computing algorithm, known as Shaw's algorithm, could break our widely users RSA encryption in the next decade. So that means the data that you have around you today is not safe in the future. Therefore, you need to understand the timeline of this, the steps that you might need to take to make your business safe. There is massive amounts of information encrypted using the RSA encryption today. It could take an awfully long time for us to future proof that and make that safe against quantum computing. So we should be starting to do that now. Secondly, we still don't really know the full extent of how and when quantum computing will be used, but there really are some clear benefits and applications that we can see. But it's important to understand that technology today, because what happens if you have a business process or a discovery that is reliant on quantum computing, but you've not upskilled your organization or educated the organization in that technology, there will come a point where it could be too late and you'll be on the back foot. So look to derisk the investment today in quantum computing by accessing education, upskilling your employees, and exploring how the technology can be leveraged in your organization. And there are plenty of organizations and programs out there that are looking to do just that to work with you to help you understand and build a roadmap to support the technology. Digital catapult are running a quantum technology access program, which is part of a wider program called the Quantum Data center of the Future. And that program is looking to embed a quantum computer within a classical data center. And this is sort of translating from the lab environment into potentially a real world application. So how are we going to use quantum computers in the future in a real scenario? The technology access program aims to upskill and educate end users on the applications of quantum computing. And it will do this by providing training on what quantum computing is on the core principles, the core skills, and also provide access to expertise in the field, both in house at digital catapult and our external consortium partners, and provide you with the opportunity to explore relevant use cases, relevant applications with these experts, and experiment with the technology by running sort of quantum simulations and getting hands on experience with a quantum computer. So it's a great opportunity to get involved, start to understand the technology, upskill employees within your organization. If you are interested, our open call goes live the start of July this year, and you can apply via the digital catapult website if you're interested. The program will be a structured program and will be delivered over a five month period. And it's split into a few different stages, so you've got your onboarding. So bringing in the cohort together, starting to really understand where everybody is, some master courses to sort of upskill and get everybody to a foundational level, and also for us to understand what you want out of the program so we can tailor the program to support your needs. You've then got the discovery phase, so this is where there'll be a lot more training specific to your needs and also an opportunity to explore use cases in the three different streams. So you've got bulk tolerance, you've got optimization, and you've got machine learning. So this helps us tailor the program specific to what your use case is. Then an opportunity, as I said before, to experiment with simulations and demonstrate the algorithms on a quantum computer. So really great program, and it will be tailored to the participants of the program. It's a fantastic opportunity and will provide the following benefits to your organization. It's a free program, it's structured that will provide tailored support. So this helps ensure efficient use of your time of your employees time to join the program. It's a great opportunity to access experts in the field and explore use cases. So it doesn't matter if you don't understand how your organization could leverage quantum computing. This program can help you with that, so it can help explore what the potential use cases could be for you and develop those use cases relevant to the organization. You'll get access to quantum hardware and software without having to invest at this stage, so it's derisking those future investments. Access to network partners to help you build your network in the quantum computing space upskill employees within your organization and ultimately get on the front footing. So help you understand the technology, the applications, the timescales to better understand what you need to do as an organization to be ready for quantum computing. So get involved today. Future proof your business and if you are interested in the Quantum technology access program, as I say, the open call will be live the start of July on our website, but we can support you in a number of different ways. So if you'd like to have a chat with us, please get in touch with myself and Daniel at our quantum computing email address which is on the screen it now and thank you for listening. Enjoy the rest of your day. Thank you.", "words": [], "utterances": null, "confidence": 0.944273242623881, "audio_duration": 1556.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Digital Catapult is the UK authority on advanced digital technology. Future Technology Access program will give education, training in quantum computing. Three use cases for near term quantum devices are quantum optimization, quantum simulation of physical systems and quantum machine learning.\n- A quantum egg timer can be in a superposition of two states at the same time. It's parallel processing over mini qubits in superposition. That can give quantum computers huger benefits over classical computers for certain algorithms.\n- We're in the near scale intermediate quantum era. To get to quantum computers with millions of qubits, then we need fundamental breakthroughs in research. In the future, the technological challenges will be resolved. We'll see large, universal, fault tolerant quantum computers.\n- Key areas that have been identified as applications of quantum computing in the more nearer term are optimization, quantum simulation of physical systems and quantum machine learning. Digital catapult are running a quantum technology access program to upskill and educate end users. It's important for organizations to be ready for when quantum computing is to be adopted into organizations.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "Quantum computing algorithm", "timestamps": [{"start": 1143950, "end": 1146262}]}, {"count": 8, "rank": 0.09, "text": "quantum computers", "timestamps": [{"start": 46998, "end": 48054}, {"start": 349376, "end": 350854}, {"start": 729116, "end": 730066}, {"start": 766200, "end": 767374}, {"start": 773192, "end": 774638}, {"start": 851098, "end": 852026}, {"start": 946912, "end": 948054}, {"start": 1288512, "end": 1289766}]}, {"count": 1, "rank": 0.09, "text": "quantum computing use cases", "timestamps": [{"start": 958468, "end": 960538}]}, {"count": 1, "rank": 0.08, "text": "quantum computing simulation tools", "timestamps": [{"start": 87052, "end": 89014}]}, {"count": 1, "rank": 0.08, "text": "universal quantum computers", "timestamps": [{"start": 46406, "end": 48054}]}, {"count": 5, "rank": 0.08, "text": "quantum devices", "timestamps": [{"start": 37282, "end": 38210}, {"start": 53402, "end": 54570}, {"start": 554468, "end": 555370}, {"start": 607348, "end": 608378}, {"start": 726572, "end": 727442}]}, {"count": 3, "rank": 0.08, "text": "quantum simulation", "timestamps": [{"start": 57250, "end": 58314}, {"start": 980970, "end": 982034}, {"start": 1045472, "end": 1046454}]}, {"count": 1, "rank": 0.08, "text": "quantum systems", "timestamps": [{"start": 59978, "end": 61162}]}, {"count": 1, "rank": 0.08, "text": "quantum optimization", "timestamps": [{"start": 55476, "end": 56910}]}, {"count": 1, "rank": 0.08, "text": "variational quantum algorithms", "timestamps": [{"start": 898576, "end": 900570}]}, {"count": 5, "rank": 0.07, "text": "quantum circuit", "timestamps": [{"start": 904234, "end": 905562}, {"start": 906548, "end": 907274}, {"start": 914062, "end": 915330}, {"start": 925448, "end": 926274}, {"start": 1000164, "end": 1000986}]}, {"count": 1, "rank": 0.07, "text": "quantum era", "timestamps": [{"start": 826014, "end": 827410}]}, {"count": 1, "rank": 0.07, "text": "quantum cryptography", "timestamps": [{"start": 1138576, "end": 1139910}]}, {"count": 1, "rank": 0.07, "text": "quantum alchemist", "timestamps": [{"start": 566724, "end": 567718}]}, {"count": 1, "rank": 0.07, "text": "quantum circuit maps", "timestamps": [{"start": 914062, "end": 916382}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}