{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/6a596753-b129-4035-a30a-c0177ac79cc5", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["be", "bohr", "chief innovation officer", "come", "computing", "conf fourty two", "created", "died", "discoveries", "einstein", "from", "rich niemiec", "schroedingeretc", "susskind", "was"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "ab416576-7b71-480b-8d15-eb45ad423db6", "status": "completed", "error": null, "text": "Okay, great to have everybody here. We're going to talk about what Rod Serling called entering the fifth dimension and the quantum entanglement between electrons, photons, other types of particles. The agenda today is, first look at the economic potential of Gen AI and robots, and then what is entanglement, why it'll matter, and the effect on quantum computers. We're going to look at how accelerating Gen AI and robots is what's going to change things. Then we'll look at entanglement may change life as we know it in a very accelerated manner. So the economic potential, if you look at it, McKinsey had a study where they said 25% of your value is digital capital. But the problem is it can be copied perfectly, infinitely. That's the downside of it. So we have to protect our data as well. In the 1927 Solway conference, you could see some key people. Albert Einstein. You can see out right behind him here is Edwin Schrodinger. You can see Paulie here, a few others that you might recognize. Niels Bohr is also a key person. Wall born Einstein. During this conference, often debate about quantum theorem, Albert Einstein would say, God doesn't play dice. He does things in a very orderly way. It doesn't make sense to exceed the speed of light. And Niels Bohr would say, Einstein, stop telling God what to do. You know, we don't know exactly what they did. The quantum entanglement, what is it? It's this phenomenon where particles are generated in such a way, maybe you bring them very close together to electrons, and one is spin up and one is spin down. So the act of measuring one determines the result of the other. So if one is spin up, the other one spin down. It also polarize photons of light in the same way. But in that way, if you look here on the upper right, you can get a one or a zero. This is a dirac or bracket notation, or ket notation. It's ket zero or ket one. But when the particles are interact in such a way, now, no longer can I describe them independently of each other, so they depend on each other. If I measure one, or look at one and it's spin up on an electron, the other one will be spin down, where it will always be entangled, where they do the same thing together, or they do things together where you can't see one without changing the other in some way. A qubit is a quantum bit that says we don't know if it's a zero or a one, because we haven't tested it yet, and then having those two states of zero or one or spin up, spin down, it's an electron. It's called superposition. Now, when the quantum state is broken between the two, it's called decoherence. So when we get errors in quantum computers, it's often due to decoherence. In 2008, super position, they could do it for 1.75 seconds only. But once they knew they can lower the temperature and keep it longer. In 2013, they could do it for 3 hours. So Schrodinger would put it this way. He'd say if he had a cat and it was in a box and there was poison or radiation or something there that could kill the cat. And we didn't know if the cat was alive or dead. If we didn't, unless we looked in the box, the cat is really in alive or dead state. So it's a zero if it died, a one if it's still alive. And until we open the box and collapse that state, we don't know which state it's in at that point. Hence the cartoon from the New Yorker about your cat. Mister Schrodinger, I have good news and bad news. It's both alive and dead. Haven't opened the box yet. This is Schrodinger's house, actually, where they have a cat, which at different times of the day, it will look either alive or dead. But why will it matter with AI? Because classical algorithms already run on quantum computers, but quantum algorithms, such as a quantum neural network, it uses quantum entanglement between different particles and the superposition of those states. It accelerates algorithms like Shor's algorithm for factoring, and we'll see why in a little bit. But it's used widely in security and the Internet. Shor's algorithm is Rober's algorithm, used for searching unstructured data. Both of these are very key and run unbelievably faster than any other choice for doing the things they do, and that's why they're very important. And people feel like quantum computers could break those or enhance those. If we use it for cryptography, it also speeds up finding the k nearest neighbor. So if you've done some AI and you've done some vector searching, and you're looking with the indexes, you're often looking for that nearest neighborhood. There's also a quantum Eigen solver algorithm that can be used, may accelerate reinforcement learning, also with machine learning, which is part of AI. I like this book. As far as the title goes, Schrodinger's killer app is the race to build the first quantum computer killer app is the quantum computer actually works, and it's much faster, and we'll see why in a minute. The effects on entanglement in quantum computing, sometimes as we look at different pieces of data, cause decoherence and many errors. So you get those. The one there in the middle you're seeing is d waves, and on the left, you see the d wave chip. On the right, you see IBM's quantum computer as well. And they have to be at a very cold state, literally zero degrees kelvin. If we look at what we used to be able to address, you know, with mainframes, maybe we had eight bit, and we could directly address just 256 bits of information. 16 bit. All of a sudden, we got 64k. Wow. We got Windows 32 bit. All of a sudden it was four gig. What did we get? We got the Internet 64 bit, 18 with 18 zeros, roughly, or 16 exabytes, we can directly address. You can see we've gone from the windows to the Internet so much faster, 65,000 times faster. We're about to go 300 trillion mile an hour faster with robotics, machine learning. And you'll see with quantum computers, even faster in 128 bit, you can see as well. But when we get to that, there's a quantum leap there. Now, qubits allow multiple states, so we can look at all the possibilities or probabilities of what the future might bring at a time. So just 512 qubits where we store the zeros and ones, which store 512 bits of addressable memory of two to the 512, well over a Google Earth. So here's some things you'll have to know. Eigenvectors, eigenvalues, poly matrices. He did a lot of the matrices, but key is this block sphere of now, instead of a one or a zero, now it can be a one or a zero. So in three bit or two to the third, addressable memory is eight. I can, you know, have 0123 in the different numbers. So you can see addressable memory is eight, but with three qubits. And this is ket location. Again, I could look at all eight of those states at one time, and then it will be represented, you could see here. So all of a sudden, instead of something taking years of time, takes seconds of time, because I can store so much. And until I measure it or collapse that state, I don't have to worry about that. Big challenges, though, with the coherence and things like that. Now we'll see why Einstein called quantum intangible. Spooky action. At a distance in a minute. But something to also note is some people look at black holes, and they say on each side of the black hole, there could be entangled particles. And the entanglement itself are the things we're seeing in this state. But quantum computing is going to make AI faster than we'll ever need. It will make securing data more secure than we ever need, but a few things. Now, let's look at what spooky action at a distance is. But let's say we're shooting nerf balls at one slit. It will make a line on the wall, go through two slits, makes two lines. If instead we use water. Now, all of a sudden we get a different pattern with a different interference. Now, when we look at one slit with electrons and two slits, which we expected it to act like a particle with just two lines, all of a sudden it became this wave of probability possibilities. Sometimes goes through bow slits, sometimes neither, sometimes each one at different times. And this creates that same wave pattern, which, of course, didn't make sense to people. When I'm measuring it, it's either in one or the other. So now how do I connect those or entangle electrons? I can bring them very close together. Here's another way. I could split them. I could collide them. Here's what I was showing earlier. And they did a double slit experiment when they did one electron at a time, and it showed how sometimes it went through one, sometimes it split into two, sometimes it went through neither, and it built that wave pattern. Now let's look at it from further away. I bring a red and white ball together and I entangle them. They'll both have properties of each other. So they may be red and white, both of them. But now if I move them apart, maybe a galaxy apart, they stay entangled, which means I need one to understand the other one so they're connected in some way. If I move them a galaxy apart and I measure one, maybe it'll come up red or white or whatever. The other will come up the opposite white. If I measure it a different time, maybe this one will be white, the other one will come red. This is what Einstein called spooky action at a distance, because it does it instantaneously. It doesn't take nor they're a galaxy apart. They're entangled, and it doesn't take the time for the speed of light to get across that galaxy to instantly show us what they are. Now, what physicists have said is these particles aren't communicating across this large distance. And that's why it does not violate relativity. Theory of relativity. But it's a correlated. These two are now correlated. They're entangled across there. There's a correlation. Not communicating. They're just correlating. When one is red, the other one will be white. When this one is white, the other will be red, so on. But what this means is I can do quantum teleportation, separate entangled particles, red and white, then bring a green particle in. Maybe I get green, red, and white, how the other particle reacts to that, because it's entangled. Then if I look at the left, at the right time, when it comes up to red and white, the. The other one will automatically be green. So if I measure it at the right time or look at it at the right time, I have now moved the green particle from the left galaxy to the right galaxy. So, moving ones and zeros, maybe making a backup, that is from one part of the world to another, is instantaneous, given those particles are initially entangled. So why couldn't physics solve this? Well, they said it doesn't make sense. It's breaking relativity. They didn't look at that as correlation, where physicists look at it. Now, there were a lot of Nobel Prize winners that were very big on classical physics at the time. It didn't make sense for Einstein, who would argue with Niels Bohr for a lot of the period, but they had various people from different areas working on very different things. And something else you get is a lot of transfer learning between these. In AI, when we have maybe 15 algorithms, through transfer learning, one learns from the others as time goes on. But the reason they did come up with it is the people were quality. They had many, many Nobel Prize winners. The quality was incredible. And Einstein, who did not like this theory, wrote a paper called EPR. Einstein, Podolsky, and Rosen put this together that said, quantum computing, or quantum technology, or quantum theory, rather, is incomplete. Now, John Klauser saw this Bell experiment that was very old, and Bell said, based on EPR, said, you know what? You could just entangle photons. Not necessarily entangle them, but polarize them, and they'll become entangled. As I shoot a laser onto calcium atoms, I can then send them to different detectors and see if these are truly correlated, exactly called Bell's inequality. You can look it up. The experiment proved that these were, in fact, entangled, and he did win the Nobel Prize in 2022, eventually. So, quantum truly has entangled particles. And until I look like Schrodinger's box, until I look in the box, I don't see anything. I don't see if it's a zero or a one. I don't see if it's a red or a white ball. I don't see if the spin is up or spin is down. Now this, because these guys believed in classical physics. You can see some of them. You know, if quantum theory is correct, it signifies the end of physics as a science. That's pretty strong. Niels Bohr if it's not profoundly shocked, you don't understand it. Edwin Schrodinger, who came up with Schrodinger's equation, eventually became a Nobel Prize winner, said this quantum jumping that happens as electrons might jump from different places. Also used in psychology, by the way, to look at how people might go into other distant universes. But they were sorry ever even heard of quantum computing. But quantum computing is unbelievable and is fast enough for AI. If you look at Google just in 2019, their new quantum computer now has taken something that used to, based on their estimations, would take 47 years. Now it takes just 6 seconds. Just took them five years to make it that much faster. And they say some of those with a thousand qubits are now doing things that took over 1000 years in seconds as well. Now it's just in time. What for AI, how long did it take to hit 100 million monthly users? If you look at something very popular like Uber, 70 months, years and years to reach 100 million users, Instagram 30 months. Still over two years. TikTok nine months. Fast chat GPT jet AI two months. Now I'm gonna make it faster. Now we're going to make it faster with quantum computers. So where it may change life, quantum entanglement, this phenomenon where entangled particles instantaneously affect things across distance, challenges our views of space and time. So even though it's because of a correlation, I don't have to move the data across the country. I can instantaneously change it if I use entanglement. Also, several things in nature are entangled currently. Can there be human entanglement with that? University of Chicago said by quantum tech, will change our future. The day tomorrow began, they talked about it here in 2022. The day began. It's unbreakable encryption, speed of AI. Now in developing, using AI to develop things, drug treatments, discoveries, MRI, entangled through maybe fiber optics and tangled particles that are on each side of the year long fiber optics. And then what about AI? How is it going to be regulated? Are we ahead of that in time? As I said before, this team, many Nobel Prize winners, many greatly you see Murray Curie here, Madam Curie. Werner Heisenberg put it here. And Heisenberg. Uncertainty was a key part of this as well. Misses Pauley, this is Heisenberg. But through the possibility of exchange between the representatives of different lines of research, this conference has contributed extraordinarily to the clarification of the physical foundations of quantum theory. It forms, so to speak, the outward completion of quantum theory. Now, at the time Einstein said incomplete. Now, physicists say it didn't break relativity after all. It's just correlation. It's not traveling the distance. So I think you'd agree with it, huh? So it's going to accelerate AI. So now you gotta look at innovation. Might as well have some da Vinci here, right? Innovation introducing something new. How do people do it? Companies have quantum computing, AI, robots, Internet of things, big data, chatbots with large language models to create these innovative products or give you great support. Are you that organization now, there's a current technology, let's just say the telegraph, for instance. It's doing really well. It's going fast. And then it levels off when something new came out. Telephone. In the later stages, I can't spend money on this old technology anymore. Got to transfer over to what's new. And we see it in a lot of ways. Postal mail to email, telegraph to telephone. Then the cell phone. Trains to cars and planes. Computer to a smartphone. Tablet, floppy drive to a zip drive, then a USB, then Wikipedia. Encyclopedia to Wikipedia. Filing cabinet to a database. Then it went even faster, starting to become a little bit disruptive. Even Snapchat. Instagram, telephone to an implant. Some people even have virtual calls instead of getting on a car with a plane. Digital picture to even virtual reality where you can record things in your life or record at all. USB to cloud. Google Docs, Wookiepedia, Alexa and Siri database now autonomous database. Some jobs are gone. Brad Serling put it this way. Twilight Zone author, the competition between man's mind and the product of man's mind. With this, they're standing room only in the twilight. He's talking about robots with AI leveraging quantum computers to make things fast. But some things are obsolete. Pinsetters. Do we really need them? Ice cutters, street lighters, typesetters. In the twilight zone, he talked about how we're going to get rid of the people. The people started revolting. But robots look a little bit different than what we had in the past. Some really amazing ones. They have expressions. They're physically very active. They can do dangerous jobs for us. But it is time for workers to worry about it. There's a symbiotic relationship coming with you and a robot, the physical and the digital, where we start to take away, take the robot out of the human and use them, you know, for the innovative design for some of the mystery, some of the sentient feeling, some of the understanding of other people, maybe the customers. That was. That was from MIT classes. It was, by the way, their most expensive class. I might. What is it like? And we're going to build a mirror image of people, and this guy built somebody to do his lecture for a professor really scares people when they go into public. This guy went into public and the robot did not behave calmly. Banged the glass and broke the glass on the table. But really, actual robots are kind of beyond science fiction now. They looked Scarlett Johansson. The robot was on Jimmy Kimmel. They become much more lifelike than I think we ever dreamed at this point. The other thing is, I could use AI to actually take somebody from the past, like Marie Antoinette, and I could actually say, what would she look like today? Or Henry VIII or Queen Elizabeth or dolly snack cakes, who was not an actual person existed. I could build that. But now, in the future, I can actually build that robot of that person, take the knowledge from the web, put it into that robot, and I could have that one today. Now, leveraging the robotics might be as simple as just delivering things. Take away a monotonous job. But a robot may not look like what? Siri? Alexa, the robots autonomous database. It's robot managing the database. I remember an old IBM twilight zone where he was helping him with his love life. I looked this one with Siri. Hey, Siri, why don't my relationships work out? It's like, this is Alexa. Okay, now we know why they don't work out. We'd also start to build a robot of you. Eturdine has build a counterpart who will work for you. And once you build that, and they're building an electronic one. True. And this is something that exists now. Also use things like cosmetics to make that perfect replica of you. Cosmetics comes from the word camouflage, by the way. Savin toys, a lot of AI. You know, some people say these dolls are spying on you. Gather information. People want to gather so much information. I mean, here's a cartoon. $30 in bitcoin. Or the next time I smell smoke, you might. Might just let you sleep. Send me $25, or I'll tell people you're stupid enough to buy a connected, Internet connected broom. Turn off the heat. Unless you want warm up my bank account. The ransomware on the hacker side is a problem, but the gathering of information isn't going to stop because everything took off with chat. GPT November 30, 2022, you put a front end on AI where we can ask questions, what are the top databases that are out there? And you can see Oracle, mySql, SQL server, postgres. I could also do dal e where I could do images. Now they have where I could actually do text, and it will turn it into a video not to be undone. Google's barred now. Gemini over the top ten databases. Let me go back for a second. An OpenAI as of September 21, Gemini as of right now, these are the top ones. But what are they doing? They're gathering this information. So instead of what happened or why did it happen? When I look at my numbers, maybe as a CEO or what's going to happen next, what will happen next quarter, I can do prescriptive analytics with more and more of that data. If I use AI, I could do that even better, but I'm looking for those descriptive analytics. We're also seeing databases now do embeddings or turning an image, a text document, or a video into a vector with dimensions. So you might have a dimension of animals where cats and dogs are, and the cats may be in the upper left part of the dimension, the dogs may be in the lower right. Then may you might have locations in a different dimension, or you might have something else. But wherever I vectorize something, cats, images of cats, videos of cats, they're all going to root there because the vector embedding is going to put it in that same area. So it's going to be easy to find something. So for instance, Oracle does this. It says, hey, give me an image of your house. I'll look at maybe the type of the roof decoration of our stories. It vectorizes. That creates a vector. Embedding finds which houses are nearby. Then I can create an app and you can say, hey, give me a house like this, but in another city, and you're moving and you want the same house. And what does it really do? Well, you have a house photo which you put in, but also vectorize that. Then in addition to find one that is a vector distance nearby, just like those cats, find a cat similar to this that will be nearby in a dimension. I'll find a house nearby, but then I can also use relational type of questions or SQL to say, but give me a certain price in a certain city. I'm now joining vectors with other information in the database. So whether I'm doing relational searching for an individual record, where I'm doing a whole column to look at analytics and maybe summing up some salaries or something like that, or I'm looking at graphical information or JSON data and also now add vector database. This is in the Oracle and their vector database. Do charge, by the way, if you already own the database, what we're doing is think of how we're used to programming. Speed is less than four. I'm walking less than four, otherwise running less than four. But if it's less than less than four, it's walking less than twelve, running, otherwise biking. Then all of a sudden, someone's golfing is like, how do I do that? What am I doing? Maybe create some type of embedding that searches for a pattern. That's walking, running, biking, golfing. It's been basically what I'm doing. The world ahead is very complex. A lot of robots, you see people with prosthetics can grow this to some degree. Steve Wozniak, which is Apple's co founder, will we be pets or mere ants to be squashed? So Steve Jobs, Steve Wojnick was, is a key developer. Are you leveraging the database AI, virtual reality, or mixed reality to help people see how that product's gonna look on the shelf, or augmented reality to look through their iPad to see how it looks on the shelf? Are you leveraging that right now? There's a guy who built, I won't say a flux capacitor, but he built a time machine where does videos of conferences he goes to, and then he could dial back to that date and experience that conference again in virtual reality, how long will it be till you are in the movie? It's coming. Is there going to be a time like inception, the movie inception, where people could go into this virtual life with virtual world, and the person said, they come here to wake up. They don't come here to go to sleep. They work and they do that, but they come here and they want to be in this virtual world all the time. Is that what's coming? Will they be addicted to this? How is that going to turn out? How about leveraging the database in medicine, you know, we can set up a child however we want in different ways. Maybe as we use AI to do that more than movie. Gattaca started to look at this. I remember it was Pope Benedict talked about, you know, when you can build your own child, is it like building a robot? Is it a child anymore? You know, you know, have lost something great. Maybe Gartner 2020. These are things that were coming. Augmented intelligence, smart robots. These are things that were kind of. People got tired of hearing about machine learning, but no working products on the way up the hill. And then by the bottom, you're at 5%. So machine learning was only coming just over three years ago. GPU accelerators. The hardware was there, though, 2021. It's a lot about AI stuff. Generative AI, using quantum to accelerate that machine learning, which is part of AI. AI driven innovation, AI, augmented design, all coming. Nothing at 5% yet of these very leading edge products. But when moving from using digital, it went from the mainframe that was in that computer much faster. What was in your hand to wearing digital? Now we're starting to plant digital. People with prosthetics are kind of the early people and then the hive mind, as people implant things like neuralink. You know, you look at this guy, he's a tattoo artist. His arm is his job. If he became a barber, he'd be Edwin scissors hands. It's possible, but the connection to the brain currently works because a lot of things that are going to the brain are ones and zeros. What about black mirror? Is there this potential dystopian future with technology hated in the nation? Nosedive social media addiction? What if I invent somebody by back? Very similar to e tier nine. The entire history of metalhead, Roebuck, duck, like Boston dynamic. Not a very good person, though. What about leveraging the database in Iot? People hacking your car? He's a coder. He's fallible in black mirror. Some of the issues they said that are coming. Social engineering device takeover, data, extortion, corruption, augmentation. Extortion, we're already having those things. People are hacking. Even pacemakers thought it wouldn't take till 20, 2045. A big thing in AI and quantum computers going to help is AI leveraging. Leveraging the abilities of AI, rather, to improve security. And you can see some of the ways they're doing that right now. There's also the other digital site. Used to be magical. Somehow they made it manic and even toxic. So if you want to have a great company, keep it magical. Don't go to the other side. I mean, people get very frustrated with machines now. Make it easy. I remember when Star Trek looks so advanced. Now it's the age of entanglement. It'd be wormholes with entanglement. Star Trek, everything there has already been invented or is in the final stages of being used. Final thoughts. Things are going fast. We're starting to find out how to transport zeros and ones. With quantum entanglement, it's no longer spooky action at a distance, it's correlation at a distance. You looked at the economic potential. Huge. What is entanglement? Two particles come close together and I can only look at them and as correlated from that point on. And if that goes away, we have decoherence. And those are some of the issues we have. Why will it matter? Because I can use things where I can store multiple. I can store a zero to one. At the same time, the effect on quantum computers significantly faster. He looked at Googles that it took something from 24 years to seconds. Physics couldn't solve it all in 27. But it's just coming out at a time when Gen AI and AI is becoming very important, and it may just change life as we know it. It's certainly going to be the engine inside of robots in the future. It may give you enough time to build some cool things with AI that are accelerated with quantum computers. But things to still worry about robots like Sophia. She's a citizen of Saudi Arabia, wants to get a degree, wants to have kids. When they interviewed her. What's a. Why are there sentience issues? You look at, you look at a sunset and you feel something, or you hear music, you feel something. Robot doesn't have that sentience, but somebody could program it in. What are the ethical issues? Has it happened yet? The moving? I think we're in artificial general intelligence, where a computer is smart as a human across the board in certain areas, but eventually it has super intelligence, and it's going to come next. Things may come to those who wait, but only the theme is left by those who hustle. You need to hustle to get there. It's the angel age of entanglement. Somebody wrote a book on it, called it the God effect. Think of you. Pray to God. Can you help me with this AI project? Maybe. And maybe there's some entanglement that happened a long time ago, where your prayers can be answered instantaneously. We hope so. But think about it. 13.7 billion years after the big Bang. Or is that true? Take back. That's. Yeah, 13.7 billion years. Sorry, big bane, you're on Earth, rolling through space in just the right view to see the whole solar system. We're here in the Milky Way galaxy. You're here in the universe. What are you doing with it? You're at the best place in time. Why did God put you here at this exact time of history, where this turn is coming, things are just beginning of the AI boom and the acceleration with quorum. Make a living by what we get. Make a life by what we give. Make sure you give back. Be that future tech. Later tech leader. Using entanglement, I found this color picture of the Solway conference on Amazon. I could see Pauly, you could see Heisenberg, see Bohm, Einstein, Schrodinger, key people, Dirac. Also, it's another one. I had this picture with aces in the database world, Oracle, which, well, 98% of the fortune pilot in most countries. And I thought it's very similar. We have this entanglement with groups of people where we learn stuff together, and there's an entanglement just like in the Solvay conference, where people learn something, their brain changed by what they heard. That's entanglement. I look at talks, I've already had it with robots in it before, for years and years of time, probably 1010 years ago, but now much more amazing ones, like the Boston dynamic dog. You want to make a difference in the world. It is the exact time with the exact thing. AI is going to help you make a bigger difference. If you want to make a difference, understand these things and how to leverage them. I want to thank you and have a great day.", "words": [], "utterances": null, "confidence": 0.910239375223132, "audio_duration": 2333.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- The agenda today is, first look at the economic potential of Gen AI and robots, and then what is entanglement, why it'll matter, and the effect on quantum computers. We're going to look at how accelerating GenAI and robots is what's going to change things. Then we'll look at entangler may change life as we know it in a very accelerated manner.\n- Quantum computing is going to make AI faster than we'll ever need. It will make securing data more secure than we ever need, but a few things. Einstein called spooky action at a distance because it does it instantaneously.\n- Quantum computing is unbelievable and is fast enough for AI. University of Chicago said by quantum tech, will change our future. How is it going to be regulated? Are we ahead of that in time?\n- There's a symbiotic relationship coming with you and a robot, the physical and the digital. Robots look a little bit different than what we had in the past. They have expressions. They can do dangerous jobs for us. But it is time for workers to worry about it.\n- Are you leveraging the database AI, virtual reality, or mixed reality to help people see how that product's gonna look on the shelf? What about black mirror? Is there a potential dystopian future with technology hated in the nation?\n- With quantum entanglement, it's no longer spooky action at a distance. It may give you time to build some cool things with AI that are accelerated with quantum computers. But things to still worry about robots like Sophia. AI is going to help you make a bigger difference.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.06, "text": "other people", "timestamps": [{"start": 1332138, "end": 1332730}]}, {"count": 2, "rank": 0.05, "text": "different times", "timestamps": [{"start": 279924, "end": 280532}, {"start": 615766, "end": 616674}]}, {"count": 5, "rank": 0.05, "text": "quantum entanglement", "timestamps": [{"start": 32862, "end": 33926}, {"start": 128750, "end": 129606}, {"start": 294850, "end": 295962}, {"start": 1039019, "end": 1040263}, {"start": 2058661, "end": 2059741}]}, {"count": 3, "rank": 0.05, "text": "Gen AI", "timestamps": [{"start": 43654, "end": 44150}, {"start": 54838, "end": 55914}, {"start": 2110824, "end": 2111432}]}, {"count": 1, "rank": 0.05, "text": "AI stuff", "timestamps": [{"start": 1890200, "end": 1890928}]}, {"count": 1, "rank": 0.05, "text": "Generative AI", "timestamps": [{"start": 1890976, "end": 1891880}]}, {"count": 2, "rank": 0.05, "text": "key people", "timestamps": [{"start": 89136, "end": 89824}, {"start": 2271850, "end": 2272346}]}, {"count": 1, "rank": 0.05, "text": "different particles", "timestamps": [{"start": 296802, "end": 297818}]}, {"count": 10, "rank": 0.05, "text": "quantum computers", "timestamps": [{"start": 50094, "end": 51434}, {"start": 215610, "end": 216514}, {"start": 287732, "end": 288516}, {"start": 326316, "end": 327476}, {"start": 445284, "end": 446284}, {"start": 1034451, "end": 1035703}, {"start": 1274448, "end": 1275792}, {"start": 2000850, "end": 2001690}, {"start": 2094164, "end": 2095524}, {"start": 2127740, "end": 2129024}]}, {"count": 6, "rank": 0.05, "text": "quantum computing", "timestamps": [{"start": 374802, "end": 376174}, {"start": 563942, "end": 564774}, {"start": 857924, "end": 860788}, {"start": 972172, "end": 973340}, {"start": 973844, "end": 975184}, {"start": 1171134, "end": 1172086}]}, {"count": 1, "rank": 0.05, "text": "various people", "timestamps": [{"start": 820640, "end": 821392}]}, {"count": 1, "rank": 0.04, "text": "other information", "timestamps": [{"start": 1681434, "end": 1682122}]}, {"count": 1, "rank": 0.04, "text": "several things", "timestamps": [{"start": 1061798, "end": 1062350}]}, {"count": 1, "rank": 0.04, "text": "quantum teleportation", "timestamps": [{"start": 748414, "end": 749834}]}, {"count": 1, "rank": 0.04, "text": "other types", "timestamps": [{"start": 36694, "end": 37326}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}