{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/73bc46eb-6942-4bf5-bf74-59d5a5a46cb9", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["cms", "conf fourty two", "dont", "from", "fullstack developer", "groundbreaking", "insights", "jamstack", "juan felipe gomez", "make it real", "projects", "resources", "technologies", "wordpress"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "fcd0d6f3-6042-406e-b8d1-cae6de3640d6", "status": "completed", "error": null, "text": "CMS stands for content management system and this is a type of software that covers all the applications for modification and creation of digital content. The evolution of the CMS is at the same time the evolution of the web. So let's explore together how new paradigm, new technologies and even new devices have changed the web ecosystem landscape. Hi, my name is Juan Felipe Gomez. I'm from Medellin, Colombia. And since I started in this world in web development, I faced with this term of CMS. So I just want to share some of my experience with you. You can find me on my social network as Gomez one FA and first of all, I want to say thank you to Mari because he encouraged me to do this presentation. And just by the record, this is my first time as a speaker. Let's talk a little bit about the beginnings of the web. The World Wide Web started with static sites that provide content without database queries. These sites consumed minimal computing resources, resulting in fast loading times. This speed was due to the absence of a complex backend. It was in the middle of 1990s as the Internet popularities rose and the website started to require more frequent updates. When we saw the first CMS products, however, all those were proprietary and closed source, which was typically for that era. But in the early 2000s, we saw the emergence of open resources CMS alternative, like WordPress, Drupal or Joomla. In the case of WordPress, for example, it counts with a set of plugins, templates and many other tools that allow users to create website without knowing CMS or HTML. The rise of the open source is consistent with the development of the lamb infrastructure. Lamb means Linux, Apache, MySQL and either PHP, Python or Perl. This new structure marked the beginning of the monolithic web development, which facilitates the creation of dynamic websites. These websites uses database queries to provide unique content for different users, and as a consequence of this, the previous models of static sites began to fade. Now, let's discuss why to choose CMS. What is this important? And basically it's because it allows non technical people like content creators, to manage their content without advanced technical skills. So CMS allow the control for both the appearance and the content from a panel that is easily accessible to everyone. For example, let's imagine that you are food blogger amateur, and you want to share your experience with the world. So in the beginning of the web you would have needed extensive HTML or CMS knowledge or hire a developer if you want to build your website. But just with the help of a CMS, you can create, design and publish your website just with a few clicks, this level of accessibility has opened up the web to a broader audience. Now anyone with a passion and something to share can create their online platform. And this democratization of the web has led to a richer and more diverse online world. The mobile web came up and there was a new paradigm. And the monolithic CMS wasn't suited for serving content to diverse access device, often requiring different version of the website, typically simplified for mobile users. Some devices and IoT and devices such as Mars phones, gaming consoles or voice assistants like Alexa just further complicated this problem. The need for an omnichannel delivery became so evident. So now Disney concept has emerged, the headless CMS. And this is basically the separation, the backend from the dont end and what it's going to be new here. We are going to consume the content through an API. So this is very important because the backend is going to provide all the data through an API and can be accessed by any device. So it would be available for a smartwatch, a gaming console or even IoT devices. Also, it's important to highlight that this headless is not tied to a specific framework. So we can use our preferred framework like React or VOO to develop our user interface. Now what a headless CMS look like. So if we see it from a non technical perspective, for example our web visitor, we can see that there's not going to be a perceived difference. The traditional cms and the headless cms are going to look like the same. But if we see it from a technical user perspective, the main difference is that we're going to consume the content from an API. And this is the main difference that we are going to consume as a service. Now a new term has emerged and this is Jamstack, and it doesn't refer to a specific set of technologies. This is more definition set, an attempt to give a name to a set of widely used architectural practices. So let's zoom it out and see what exactly it is. So this is basically what Jamstack means. The J stands for Javascript, which is going to be our preferred language because it's front end oriented and we're going to be allowed it to use our preferred framework such as react, SBLD, angular or VuE, and the a stand for APIs, which is the way that we are going to consume our services. And here we can find some services as of zero cloudinary stripe or WordPress. And you will see that WordPress is just one of our services that we can consume. And finally we have the m that stands for the static size generators that will assist us in the prebuilding of our web page on markup. And maybe the most important thing here is that for a long time all the efforts were focused on the backend. But we have what we have now. It's a modular stack on the client side. This means that we're moving away from being monolithic to create an architecture based more on microservices. So now this image can give us a picture of what Jamstack ecosystem is and all the services and products that we have available. So as you can see, we have many tools to develop our applications. And finally I want to share some resources with you if you are starting with this approach of building application, which is pretty interesting. And the first one that I want to show you is this of bursell that we have here. If you go to Versaille and you go to the template section, you're going to find a lot of templates. And let's check for example here. If we select here CMS and then we have many examples of website, I'm going to choose this one. And the first thing that you're going to see here is that you can see the online demo here which is deployed now in Bercel. And you can go to the repository which is incredible because you can download this code, you can run it locally and start to analyze the code. I'm one of the person that thinks that one of the better ways to learn is reading others people's code and this is just incredible. And the next resource is the next JS application is the next JS page in the section of learn. And as you know, NextJs is considered the react framework and it's powered by Bursell and you're going to find a lot of resources here. The first one is this course about next JS which is 16 chapters. And you can learn all about Netjs. And you're also going to find this react foundation course if you need it. But what I want to show you also is those resources down here that for example they have building e commerce sites with next JS and Shopify. This one is with headless WordPress and net JS. And all those things are following this jam architecture. Okay, so that was all and I hope you have enjoyed this talk and I see you for the next time.", "words": [], "utterances": null, "confidence": 0.928935631500744, "audio_duration": 708.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- CMS stands for content management system. It allows non technical people like content creators to manage their content without advanced technical skills. Headless CMS allows content to be consumed through an API. It would be available for a smartwatch, a gaming console or even IoT devices.\n- And finally I want to share some resources with you if you are starting with this approach of building application. You can go to the repository which is incredible because you can download this code, you can run it locally and start to analyze the code.\n- NextJs is considered the react framework and it's powered by Bursell. You're going to find a lot of resources here. Building e commerce sites with next JS and Shopify. This one is with headless WordPress and net JS. All those things are following this jam architecture.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.07, "text": "open resources CMS alternative", "timestamps": [{"start": 137342, "end": 139332}]}, {"count": 2, "rank": 0.06, "text": "web development", "timestamps": [{"start": 61926, "end": 62732}, {"start": 185412, "end": 186308}]}, {"count": 1, "rank": 0.06, "text": "unique content", "timestamps": [{"start": 195010, "end": 195868}]}, {"count": 1, "rank": 0.06, "text": "content creators", "timestamps": [{"start": 219706, "end": 220976}]}, {"count": 1, "rank": 0.06, "text": "digital content", "timestamps": [{"start": 35742, "end": 36810}]}, {"count": 1, "rank": 0.06, "text": "CMS knowledge", "timestamps": [{"start": 252306, "end": 253892}]}, {"count": 1, "rank": 0.06, "text": "content management system", "timestamps": [{"start": 25190, "end": 26864}]}, {"count": 2, "rank": 0.05, "text": "static sites", "timestamps": [{"start": 90174, "end": 91136}, {"start": 201490, "end": 202776}]}, {"count": 4, "rank": 0.05, "text": "next JS", "timestamps": [{"start": 639678, "end": 640452}, {"start": 641374, "end": 641896}, {"start": 660406, "end": 661680}, {"start": 683902, "end": 684612}]}, {"count": 1, "rank": 0.05, "text": "headless WordPress", "timestamps": [{"start": 686830, "end": 688116}]}, {"count": 1, "rank": 0.05, "text": "new technologies", "timestamps": [{"start": 47256, "end": 47992}]}, {"count": 1, "rank": 0.05, "text": "dynamic websites", "timestamps": [{"start": 189326, "end": 191088}]}, {"count": 1, "rank": 0.05, "text": "non technical people", "timestamps": [{"start": 218204, "end": 219332}]}, {"count": 1, "rank": 0.05, "text": "diverse access device", "timestamps": [{"start": 303362, "end": 305084}]}, {"count": 2, "rank": 0.05, "text": "new paradigm", "timestamps": [{"start": 46160, "end": 47192}, {"start": 296578, "end": 297896}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}