{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/b715c25e-c074-49fb-8969-6f6d86691d44", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["aspects", "ceo", "conf fourty two", "cultures", "environments", "gamification", "integrating", "krit", "lives", "practices", "proactive", "promote", "ruslan zaripov", "transform"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "104949cf-39ec-4139-b8a0-42518b608034", "status": "completed", "error": null, "text": "Hello everybody, today we'll talk about safety and I will present you the concept of safety crowdsourcing. I am Bruce Lanzaribev, I am the CEO of greed company. And we'll show you the solution, and we'll show you the business benefits of risk hunting. When we talk about heavy industry, we always mean that it's connected with heavy risks. For example, these are two pictures of metallurgy plant of NLF refinery. And these enterprises are huge, so the size can be 10. Course at these size of enterprises, the incidents are inevitable. So if we look at some statistics for the United States in 2022 there were five and a half thousand of fatal work injures by different types. And the number of injuries is increasing. So why it's still increasing? And what's the problem with the conventional risk management? First of all, it's static procedures and policies. So we build the list of procedures and we always try to comply with them without developing the new culture. And this traditional safety is based on periodic inspection. So the health and security officer is performing his daily routines and checking the checklist. So it's very time consuming and we may not cultures the unforeseen risks. And what also I have to mention is that the conventional risk management is based on past statistics. We analyze incidents and improve the policy, rather than identifying and moving proactive. So it's a proactive approach to the safety, and of course the limited employee engagement. The employees are usually outside of the safety process, they have to follow, they have to stick to the rules, but they are not part of this strategy. So what we would like to achieve with risk Hunter is the safety crowdsourcing. What do we call the safety crowdsourcing? This is the process when every employee is becoming the proactive person and he's involved into the safety, involved into identifying new potential risks. So our concept is based on the bottom up motivation, how we call it. So conventional risk management is the top down motivation, and our concept is based on the bottom up motivation. So we want everyone to become part of the new safety culture and we want to engage and focus people on finding safety issues in the enterprises. So the focus safety is first and productivity is second. So safety is always more important than current duties. And this is the concept. So in practice we have a technology platform that supports this concept. It's called risk Hunter. And what's the idea that everyone has the mobile application, and if you spot the risk, you take a photo and you comment, you assign it to the category and send it to the risk manager. The risk manager validates this risk. And if he confirms that this is the real one, then the employee who reported is receiving the reward for that, the bonus points. Well, we have been speaking a lot on motivation in the system and we have currently two motivation models. First is material motivation. So when you reach certain number of points, then you can exchange them for some tangible practices, discount vouchers, certificates, subscription to the online cinema and so on. This is the material motivation. But what works better is the non material or personal motivation. Well, recent researches show that intangible motivation works better in long term. So that's why currently we focus on the personal motivation more than on material one. And we have the list of personal pages, so you can reach certain level within the department after you get certain number of points and you receive awards. So we want this motivation to be the foundation of our solution. So if you report, for example, 17 tasks, then you can get the level one hunter and so on. What is important is the hunting season. So in our solution we have the hunting season so that we can focus attention on certain types of risks. For example, in winter it could be one categories, in summertime or after rain it can be another one. So the hunting season allows us to focus attention on certain problems, lives, electricity risks, for example, next two weeks we look for the electricity issues and then we can focus and concentrate all the people on problems within the company. Well, hunting season is also connected with the gamification. We have the competitions in the system, so different plants can compete with each other and even different teams within one plant can compete between each other. So that really drives the involvement and more interest into the system. So we had some situations when the people were really keen to have the first place in the competition. So that's the competition spirit. And what's also important, that we can not only give rewards for taking the first place, but we can also can give rewards for passing safety training. Well, for passing safety exams. So it's not only about finding their risks, but it's also about being prepared. So it's the spirit of collaboration and loyalty of stuff. Well, of course, in the risk hunter it's very important to attend the training to properly identify the risks. And for this we also grant the bonus points for passing surveys, for taking all the trainings. And we integrate the risk hunter with corporate learning system so that we can also integrate the risk hunter into the learning process. In the morning, when the person is fresh and ready to work, we have the safety quests so that you don't forget the safety lessons and that's every morning. We can have some random tests, tip of the days, and it's pushed by the notification so that you don't forget to pass it. Depending on the location, in the large plans, there can be different risky places, risky locations. So we have a location based safety brief. When you enter, for example, the warehouse area, then you will get a video on risks related to warehouse management. And that's good for large enterprises. But what's important is that every reported risk has to be mitigated. And after it had been eliminated, the person who reported it should get a notification about the elimination of the risk. Because if there is no feedback, then the employees, they quickly lose the interest in this application. So the feedback is the core part of our application. And the risk manager also has the mobile applications, so he can be in the field and he can assign the task to other people, to other workers, to fix something or to prevent this from happening in the future. What's also important is the statistics, so we can always see the percentage of risks eliminated. We can see which risks are trending, for example, fall flung, hates or get contact with dangerous substances. So we always can stay on track and see how we progress in making the environment safer. It can be also aggregated by year. So we have statistics on the type of the risk, sleeps or trips, exposure to harmful substances. And we can always be informed on the progress and on the. Of course, the high priority risks should be eliminated first, so we can have the focus on these kinds of risks. And there are some examples, real life examples. For example, that's the open engine, and after it has been reported, so we have the protective cover with a sign on that, so that no one puts his hand into this. And that's the steam coming out of the pipe. So it had been fixed, and now this is the picture after the work had been done. Well, what's the advantages of our solution? It's that we involve all in place into the process. We use the gamification and we ensure the feedback, so every risk is spotted and eliminated. And we have the history of using this solution for three years now. And for that time we have registered more than 150,000 risks. And out of them almost 600 are extremely dangerous situations which could cause the fatal injury or death. So we also have the statistics that the risk hunter reduces number of injures by 25%. And outs of this number of fatalities also go down. So for the three years we have almost 50% decrease in fatalities. And so that's the last slide of my presentation. So we are working hard to improve the safety. And you are welcome to use the gamification and use the concept in your enterprises. Thank you.", "words": [], "utterances": null, "confidence": 0.936156074895982, "audio_duration": 842.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Bruce Lanzaribev presents the concept of safety crowdsourcing. He says conventional risk management is based on past statistics. Risk Hunter aims to engage and focus people on finding safety issues in the enterprises. Says the hunting season allows us to focus attention on certain problems.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "risk hunting", "timestamps": [{"start": 42730, "end": 44150}]}, {"count": 6, "rank": 0.09, "text": "risk Hunter", "timestamps": [{"start": 186908, "end": 187854}, {"start": 265336, "end": 266606}, {"start": 514312, "end": 515006}, {"start": 537516, "end": 538086}, {"start": 544736, "end": 545494}, {"start": 803508, "end": 804458}]}, {"count": 1, "rank": 0.09, "text": "heavy risks", "timestamps": [{"start": 51172, "end": 52010}]}, {"count": 1, "rank": 0.09, "text": "electricity risks", "timestamps": [{"start": 416184, "end": 417582}]}, {"count": 3, "rank": 0.09, "text": "conventional risk management", "timestamps": [{"start": 98656, "end": 100642}, {"start": 146016, "end": 147462}, {"start": 221448, "end": 223054}]}, {"count": 1, "rank": 0.09, "text": "new potential risks", "timestamps": [{"start": 208506, "end": 210750}]}, {"count": 1, "rank": 0.07, "text": "based safety brief", "timestamps": [{"start": 589606, "end": 590854}]}, {"count": 1, "rank": 0.07, "text": "safety training", "timestamps": [{"start": 490854, "end": 492042}]}, {"count": 1, "rank": 0.07, "text": "safety issues", "timestamps": [{"start": 239942, "end": 240778}]}, {"count": 3, "rank": 0.07, "text": "safety crowdsourcing", "timestamps": [{"start": 30748, "end": 32162}, {"start": 189072, "end": 190806}, {"start": 191888, "end": 193062}]}, {"count": 1, "rank": 0.07, "text": "safety exams", "timestamps": [{"start": 493382, "end": 494726}]}, {"count": 2, "rank": 0.06, "text": "certain number", "timestamps": [{"start": 311620, "end": 312362}, {"start": 366136, "end": 366802}]}, {"count": 2, "rank": 0.06, "text": "material motivation", "timestamps": [{"start": 308196, "end": 309630}, {"start": 327388, "end": 328530}]}, {"count": 1, "rank": 0.05, "text": "different risky places", "timestamps": [{"start": 584012, "end": 586930}]}, {"count": 1, "rank": 0.05, "text": "high priority risks", "timestamps": [{"start": 714232, "end": 715614}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}