{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/fe0913ab-fbd5-49c1-917b-488ea8d0f49e", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["aimed", "applications", "attending", "be", "become", "benefits", "bootcamp", "by", "case", "chain", "community", "competitive", "computing", "conf fourty two", "decisions", "demystify", "embraced", "emerging", "empowering", "enhancing", "executives", "forwardthinking", "from", "ibm", "investments", "launchpad", "lets", "operations", "organizations", "possibilities", "presents", "qiskit", "quantum solutions launchpad", "realworld", "revolutionizing", "showcasing", "software", "solutions", "stakeholders", "studies", "talks", "unlock", "vardaan sahgal", "womanium"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "412951ca-b572-4cbb-a082-e3b78d12e8af", "status": "completed", "error": null, "text": "Everyone, very warm welcome to the Conf 42 session on empowering executives to embrace quantum computing. This session is ideal for executives with little to maybe no technical background and who are extremely interested in learning more about quantum computing. My aimed in this session would be to provide you with an overview of what quantum bidding is, why is it maybe necessary for you to understand at this point of time and if it is essential for you to adopt this upcoming technology in your existing industry. My name is Vardaan Sahgal and IBM, the software head at Womanium where I also lead the Quantum Solutions launchpad headquartered in Washington, D. C. Alternatively, I am also an IBM Qiskit advocate and have a breadth of research experience in theoretical software domains of quantum computing. Talking about womanium Womanium is basically a nonprofit organization based out of Washington, DC, US. Womanium was started seven years back with the aim of educating young girls and promoting more women in STEM and essentially creating the scientific leaders of tomorrow. Till date, womanium has helped students get trained in STEM fields by providing over 1100 scholarships spelled across a staggering 88 countries. Womanium has been actively involved in training the next generation of workforce by education participants in STEM fields from life sciences to engineering to quantum computing, and has been the recipient of various international awards along the way. For the past couple of years, womanium, in very close collaboration with a lot of us national laboratories, has been working on providing training in all sorts of quantum domains, quantum computing, quantum hardware, quantum sensing and even quantum communication for that matter. As I mentioned before, the main purpose of this presentation is towards a nontechnical audience. My main aim in this session would be to provide a bit overview of what quantum computing is and why does it matter for executives level people like you to understand this upcoming technology? While I discuss quantum computing, I would delve into some real world applications and real world use case studies where quantum computing has already played a major role in defining industries in the recent years. I would also highlight some very good practices and some operations which you should take while stepping into this overhyped quantum computing industry. So stay tuned till the end of this presentation and I hope you like it. So the first question is, why should you be interested in quantum? After all, is it just hype? But the very important point is that even if you put aside the hype, I feel that the stats shown on the screen right now should be more than enough to get you interested. As of this year, more than $36 billion of public funding has been allocated towards the research and innovation of quantum technologies across the globe. You mind that this is a billion with the capital and Bolt B and add to the private players working in the quantum market, this figure grows even higher and this humongous investments is bound to make a very significant effect change in a lot of industries. In fact, according to a recent survey, 97% of the industry executives already believe that quantum computing is bound to disrupt the industries in the very near future. A few decades back, quantum was just heretical. It was just in textbooks and research laboratories. But now it is very real and very much alive with more than 100 active quantum players in the entire ecosystem. As expected, the tech giants of the industry were the very first adapters of this emerging technology. But apart from that, now we are actually seeing a lot of new startups with heavy capital backings move into this domain. And not only startups, we are also seeing a lot of pure quantum companies going public, making it more and more significant to actually work in the quantum industry. And gradually, with the trend of huge investments, the traditional non quantum companies are also slowly adopting this new technology. Judging by the trend, the investments in quantum are not stopping anytime soon. And with the fast paced research that is going on, we can definitely see that the early advantages quantum computing can be observed in as nearly as maybe next four to five years. Now that I have got all three at least interested in hype about what quantum computing is, the next question should be essentially, what is quantum computing? And technically, I would love to dive into the fundamentals of quantum computing and start explaining all about superposition, all about entanglement, maybe what is Schorz's algorithm? But honestly, I feel that you don't need that pipeline, especially the executives present here listening to me in this session. Because this technical stuff, it comes at a later stage. It is defined for a different audience. For you all this does not matter or should not matter, because, okay, let me ask you a question. You all use Internet, right? Obviously you are streaming this session right now online. So that answers my question. But honestly, try to answer this. How many of you actually know how the Internet works? Or maybe for that matter, how does your mobile phone work? Or maybe your laptop work? You don't know. And that is okay, because we have been using classic computers for a long time on a daily basis without worrying about the underlying electronics. And the same should go for quantum computing as well. Unless you're working at the very bottommost level of research in quantum computing, you should not be worried about what it is. Instead, I would suggest that the interest should be in the question of the high level stuff. Maybe why is quantum computing necessary for my business, or what are the advantages which I could get from quantum computing? What are the tangible benefits which my business or my organization could avail from quantum computing? And continuing along these lines, I would like to introduce quantum computing in a much more, I would say, easier manner for you guys. And this is, I feel, the best way to understand the tangible benefits of what quantum computing is. Try imagining the problem of solving a simple maze, a maze problem. Now, if you try solving this particular maze problem using a classical computer, it will intuitively just try solving each and every part. It will try going from one part into the next and to the next, and it goes on until it finds the correct path. That is how the classical computer works. On the other hand, if you look at the picture on the right hand side of the screen, the quantum computers solves the maze problem in a very different way. It is faster, but in a different sense. It would be incorrect if we say that quantum computers solve this maze problem by checking all the parts faster than a classic computer. No, it does not work that way. Even if we say that quantum computers are just checking all the parts in a more efficient way. Again, incorrect, because the quantum computer is inherently built different. It is not at all checking all the parts. It is, in a way, just changing the rules of the game itself. Quantum computers, using some, I would say, let's say, magical quantum properties, can directly understand the maze and instantly compute the correct solution. And again, these so called magical properties might seem a bit tacky to you right now, and you might be wondering what these are. How is this happening? But these are not important for you right now. You could easily skip this for the time being, because these magical properties, which might be very, very important for physicists and maybe computer scientists, maybe researchers, they might find this really interesting and very important to know. But for you, at this executive level, this does not make a difference. And now comes a very critical point in this presentation, because I just mentioned to you that quantum computing can outperform classical computers. So you are already thinking about all the various possibilities of what quantum users can do. Maybe quantum computers can help make your daily tasks faster. So why not just invite schrodingers cat to just do your daily talks for you? Or maybe you are thinking of finally colonializing Mars, taking humans to Mars, setting up colonies over there using quantum computers. Why not? It is faster than a classical computer, so it will solve all our problems. And maybe you are even thinking of making time travel possible using quantum computers. This is all nonsense stuff. But coming to the real stuff, can robots actually rule over humans using quantum computers again, right? So this is all just hype. All these possibilities are, I would say, fantasizing about quantum computers. This is not what is possible, even by a long stretch. And job's side, I would sincerely ask or request everyone to take a breather, take a few steps back. And yes, quantum computing does hold a tremendous advantage. Absolutely. But is it going to replace our loving old classical computers? Quantum and classical computers are bound to coexist, and they have very specific domains where both of them will exist. Quantum computers might have an impact in specific industries, huge impact. But they are not like superpowers, right? Sent from above, sent from the God itself to help us just reimagine things on earth. That is not. Quantum computers are, they are not magic. They are still very much science. They are still very much bound by the laws of the nature. So looking at the realistic and practical side of things, I would say optimization and chemical simulation problems are one of the clear winners in getting a quantum advantage, especially in the near future. And this is closely followed by quantum machine learning and cryptography use cases. All these fields, because of their interdisciplinary nature, very easily affect large industries like finance, healthcare, engineering, defense, and a lot of others. But at the same time, we should remember that we are still in the very early stage of this technology. We are facing a lot of technical challenges in getting to a quantum advantage. So although there are a lot of potential use cases, we are still a long way behind getting a realistic quantum advantage. A study by McKinsey actually reports the various industry sectors quantum computing could directly impact in the next five to ten years. And just as I mentioned just before, use cases in optimization and life sciences tend to be the emerging frontrunner. But the important thing to note over here is that, in fact, every major industry is bound to get affected in some way or the other by quantum computing. In the long run. The potential of quantum computing are vast and really varied. But let me now talk about some of the specific industrial case studies to try and give you a better understanding of the impact quantum computing can have on the industries. And one of the most promising applications, like I have time and again, is organizations. The traditional computers struggle to solve complex optimization problems due to their linear processing power, but quantum computers, on the other hand, can handle these problems exponentially faster. Companies could use quantum computing to potentially optimize the delivery routes and reduce the traffic and transportation cost. That is exactly what Volkswagen has demonstrated recently. Using quantum computers, they were able to create a very smart traffic management system, which provided effective public transport station support across the city. On a different note, again using optimization, quantum South, a company based, solved the optimization problem of distributing cargo in an aircraft. Indeed a very interesting use case. But the underlying fact is that optimization is a very broad term and these kind of optimization problems can be very easily translated to a lot of other industries. Optimization, like speaking in layman terms, optimizing anything and everything, eventually boils down to maybe minimizing a cost function, which chain be performed better using quantum computers. So I would say, looking for a better workplace timetable for your employees? Go quantum. Looking to improve your goods delivery schedules? Again, go quantum. And basically any kind of optimization or logistics problem, go quantum. Or I would say at least try quantum. Another example is of pharmaceutical industries where using quantum computing to accelerate drug discoveries by simulating molecular interactions at an unprecedented level of accuracy, quantum computers are able to simulate molecules and simulate molecular interactions at a much more accurately than the traditional ways which we have been doing so far. This allows for a rapid identification of maybe potentially new drugs to treat various diseases, cure a lot of the medical problems which we currently face. And this drug discovery might seem to be a very industry specific use case, which is no doubt being actively pursued by large companies like Fujitsu. But the underlying chemical simulations using quantum computing might hold the key to unlock large opportunities in various industries, because once we are able to simulate the chemistry, even in its most natural form, factory chemistry, food technology, material science, even nanotechnology, all that gets changed. And this change in various industries at the same time could impact most of the industries we know of today. Financial institutions could also use quantum computing to optimize their portfolio management systems and manage their risk analysis. And one such example which I would like to highlight today is of Morgan and case, which have been using quantum computing to optimize their financial portfolios. They do this by analyzing large amounts of data and running maybe some complex algorithms and simulations on quantum computers to identify the best investment opportunities, reduce risk in their portfolios, and ultimately result in significant cost reduction, savings and obviously improved returns for their clients. Great, right? Make money out of quantum and moving on to the final, but a very important caveat. I will say using quantum computing is its effect on the existing security. Quantum computers have the potential to be like extremely, extremely powerful machines, but this unfortunately comes with the risk of disrupting the existing communication and encryption protocols. While honestly we are still decades away from an actual quantum computing, being able to hack into our existing security. But the best time to start working on presents such a scenario in the future is now, right? Id quantique led the movement towards quantum communication protocols to replace the existing classical ones last decade and since then, there has been a lot of improvements on post quantum cryptography architectures, commonly known as PQC architectures, to secure the data of today from the threat of tomorrow. Companies like Sandbox AQ recently demonstrated that PQC security systems by pairing with software, yet another example of quantum computing making a significant impact in the existing industries. Yes, I mean with all these examples, yes, quantum computers are the future. But again, I would remind you to stay clear of the hype. You need to get ready for the quantum revolutionizing. But by staying well informed and staying clear of all the nonsense floating around quantum computing, it's very easy to jump on the hype train. But that is a very dangerous part to pursue because you have now understand what quantum can do. It is important to actually get well educated about the same too. You need to understand the underlying principles which majorly govern the quantum technology. You need to understand what are the various risks involved. You need to understand the scope of a quantum advantage which you might expect in the future, which is all necessary to eventually make you well equipped to take decisions within your organizations regarding anything quantum and this is where womanium can help in the quantum sector. Womanium maybe host an annual month long quantum workforce training program, partnering with over 50 national research labs, academic institutions and quantum companies. And this program is specifically designed to make you industry ready by providing you hands on training in advanced quantum technologies. This is, I would say an advanced quantum program. It is typically long, it is very thorough, it is providing you in depth knowledge, and typically it is suited for students or maybe professionals who are looking to work at the technical side or maybe the research domain of quantum computing. The registration of program is actually open right now. The link should be somewhere down below. It's basically womanium.org quantum if you do not see the link down below. And yeah, if anyone of the tech side is viewing this session right now, please feel free to enroll in this year's annual session. But you coming back to you, the executives, the high level professionals, you don't need to know all this technical stuff. You don't need to nerd yourself out right now, as I said before. Instead, for professionals, for investors, maybe policymakers and industry leaders like you, you need a different type of education. And that is where we offer an executive education course. Now, this course is delivered by industry experts on your demand and is customized according to your needs and requirements, right from the course content to the course duration. Everything we tailor make it for you, for your organization's need for your specific requirements. So since this is an on demand course, we conduct it on a rolling basis throughout the year. If you are interested in such a kind of course, please get in touch with us. I would love to discuss it more. You should find my email again somewhere below down here or maybe at the end of this presentation. And yeah, please feel free to reach out and I would love to discuss it with you. But the final thing which I wanted to discuss the most is something which I'm really excited about, which personally excites me the most, is the quantum solutions launchpad. What is it? I'll talk about that in a moment, but before that I'd like to talk about why did we have to introduce such thing? Over time, we realized that quantum computing is a very interdisciplinary field and even with all the essential education at the corporate level, companies are facing a very hard time taking the first step in quantum computing. And to solve this, we had to introduce this quantum solutions launchpad where we help and provide full stack quantum solutions to get you started on building your first quantum project for your organizations. And again, all this is customized to your professional needs. I hate to repeat that again, but if you're interested in any of these programs, get in touch with me ASAP. Become I end I wanted to take a moment and talk a bit more about what the quantum solutions launchpad exactly is and why should you maybe collaborate with us and join us. So as executives, I feel it is very important to recognize that quantum computing is not standalone solution, but it is rather an ecosystem that requires collaborations and partnerships. And that is a fact no one will deny, because the complexity of quantum computing solutions and quantum itself is such that it demands a multidisciplinary approach involving experts in all sorts of fields, from physics to computer science, mathematics, even life sciences, optimization specialists, machine learning experts, all sorts of things. So the first step would be to ideally build a diverse team with all the necessary skill sets. Tough, right? But with the quantum solutions launchpad, you get access to a truly global remote quantum workforce. We recruit the best talents from all over the world for you so that you never have to worry about the logistics on maybe onboarding different people with the right skills from all across the globe. You don't need to worry about that because the team which we select to work on your problem will be the best team tailor made for your problem. Secondly, because of a unique position in our quantum ecosystem, we can provide you with an honest opinion. We can provide you with an unbiased opinion of the various quantum service providers that maybe you can find best for long term collaborations. And this would include all the industry technical vendors, all the research institutions, all the other organizations that help provide quantum services which may be complementary to the project you're working on. You would never have to worry about the technical details when you're partnering with us of maybe which Quantum SDK to pay for, which quantum hardware service to subscribe to. You don't need to worry about that when you are working at the quantum solutions launchpad, because we take care of that. We take care of all the confusing hard decisions with input from very good industrial expert team we have. We help you choose the best quantum vendors suitable for the quantum project designed for your industry. And all this by being budget friendly. Since we are nonprofit, if you remember, all the funds which we receive go back towards student scholarships. And that is why we don't charge anything. We don't want to keep anything in our pockets if everything we receive goes back to training the future quantum workforce because of this budget friendly approach that we have. This essentially minimizes the risks involved for you as a company in taking the first step and getting started with quantum. That is what our partners love so much about us. And finally the best part, you take away the entire quantum project we develop for you with all the IP rights and 100% of the ownership, no strings attached. Great, right? Yeah. So just to summarize it, by partnering with the Quantum Solutions launchpad, you can accelerate the development and the deployment of your quantum computing solutions, while also mitigating the risk and reducing the cost. Just to remind you and repeat myself once again, my email should be somewhere down below. Please feel free to reach out to me. Following which me and my teammates would love to talk about any sort of collaboration opportunities we see in the future. We would help you guide your business into taking the first step in the quantum and yeah, I guess that's it from my end. Thank you for attending the session. I am. I'm always open to talk anything about quantum. Feel free to hit me up on LinkedIn or reach out to me by mail. I'm always there for you. Great. Thank you everyone. Have a great day ahead. Bye.", "words": [], "utterances": null, "confidence": 0.943492778214187, "audio_duration": 1641.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- This session is ideal for executives with little to maybe no technical background and who are extremely interested in learning more about quantum computing. Vardaan Sahgal is the software head at Womanium. Womanium is a nonprofit organization based out of Washington, DC, US. The main aim of this presentation is towards a nontechnical audience.\n- As of this year, more than $36 billion of public funding has been allocated towards the research and innovation of quantum technologies across the globe. 97% of the industry executives already believe that quantum computing is bound to disrupt the industries in the very near future.\n- The next question should be essentially, what is quantum computing? I would like to introduce quantum computing in a much more, I would say, easier manner for you guys. What are the tangible benefits which my business or my organization could avail from quantum computing.\n-  quantum computing can outperform classical computers. But is it going to replace our loving old classical computers? Every major industry is bound to get affected in some way or the other by quantum computing. But we are still a long way behind getting a realistic quantum advantage.\n- One of the most promising applications, like I have time and again, is organizations. Companies could use quantum computing to potentially optimize the delivery routes and reduce the traffic and transportation cost. This change in various industries could impact most of the industries we know of today.\n- Financial institutions could also use quantum computing to optimize their portfolio management systems and manage their risk analysis. But this comes with the risk of disrupting the existing communication and encryption protocols. Womanium offers an executive education course to make you industry ready for the quantum revolutionizing.\n- The quantum solutions launchpad provides full stack quantum solutions to get you started on building your first quantum project. With the launchpad, you get access to a truly global remote quantum workforce. If you're interested in any of these programs, get in touch with me ASAP.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.09, "text": "quantum computing solutions", "timestamps": [{"start": 1400788, "end": 1402234}, {"start": 1591088, "end": 1592582}]}, {"count": 42, "rank": 0.09, "text": "quantum computing", "timestamps": [{"start": 26706, "end": 28098}, {"start": 35692, "end": 36978}, {"start": 70808, "end": 71982}, {"start": 109636, "end": 110970}, {"start": 125938, "end": 127138}, {"start": 142992, "end": 143894}, {"start": 153780, "end": 154714}, {"start": 160692, "end": 161466}, {"start": 174654, "end": 175406}, {"start": 236716, "end": 238054}, {"start": 305514, "end": 306778}, {"start": 316760, "end": 317694}, {"start": 321640, "end": 323090}, {"start": 327164, "end": 327906}, {"start": 394448, "end": 395286}, {"start": 400288, "end": 401318}, {"start": 412292, "end": 413086}, {"start": 418008, "end": 419250}, {"start": 425672, "end": 427010}, {"start": 432082, "end": 432818}, {"start": 442208, "end": 443014}, {"start": 561268, "end": 562106}, {"start": 643390, "end": 644246}, {"start": 743766, "end": 744966}, {"start": 767816, "end": 769006}, {"start": 771928, "end": 772894}, {"start": 784946, "end": 785778}, {"start": 812404, "end": 813294}, {"start": 902356, "end": 903402}, {"start": 952436, "end": 953546}, {"start": 986892, "end": 987954}, {"start": 1000240, "end": 1001126}, {"start": 1035036, "end": 1036274}, {"start": 1057636, "end": 1058394}, {"start": 1098848, "end": 1099574}, {"start": 1126056, "end": 1127214}, {"start": 1210004, "end": 1211150}, {"start": 1328796, "end": 1330230}, {"start": 1343968, "end": 1345130}, {"start": 1388832, "end": 1389686}, {"start": 1400788, "end": 1401674}, {"start": 1591088, "end": 1591766}]}, {"count": 18, "rank": 0.09, "text": "quantum computers", "timestamps": [{"start": 472088, "end": 473550}, {"start": 483100, "end": 484354}, {"start": 493872, "end": 494982}, {"start": 510050, "end": 511370}, {"start": 573672, "end": 574894}, {"start": 594640, "end": 595942}, {"start": 606836, "end": 608270}, {"start": 617080, "end": 618414}, {"start": 629036, "end": 629986}, {"start": 661410, "end": 662646}, {"start": 677432, "end": 678446}, {"start": 805316, "end": 806138}, {"start": 825292, "end": 826146}, {"start": 874072, "end": 875570}, {"start": 911330, "end": 912426}, {"start": 1010532, "end": 1011466}, {"start": 1040670, "end": 1041766}, {"start": 1107140, "end": 1108394}]}, {"count": 1, "rank": 0.07, "text": "quantum cryptography", "timestamps": [{"start": 1079852, "end": 1080914}]}, {"count": 3, "rank": 0.07, "text": "quantum companies", "timestamps": [{"start": 276338, "end": 277158}, {"start": 289398, "end": 290218}, {"start": 1180748, "end": 1181720}]}, {"count": 1, "rank": 0.07, "text": "quantum communication protocols", "timestamps": [{"start": 1071240, "end": 1072894}]}, {"count": 3, "rank": 0.07, "text": "quantum workforce", "timestamps": [{"start": 1174456, "end": 1175498}, {"start": 1434402, "end": 1435910}, {"start": 1547936, "end": 1549210}]}, {"count": 1, "rank": 0.07, "text": "quantum services", "timestamps": [{"start": 1488480, "end": 1489580}]}, {"count": 1, "rank": 0.07, "text": "advanced quantum technologies", "timestamps": [{"start": 1190752, "end": 1192490}]}, {"count": 1, "rank": 0.07, "text": "pure quantum companies", "timestamps": [{"start": 275916, "end": 277158}]}, {"count": 1, "rank": 0.07, "text": "post quantum cryptography architectures", "timestamps": [{"start": 1079612, "end": 1081986}]}, {"count": 1, "rank": 0.07, "text": "quantum users", "timestamps": [{"start": 570696, "end": 571486}]}, {"count": 1, "rank": 0.06, "text": "magical quantum properties", "timestamps": [{"start": 513736, "end": 515518}]}, {"count": 1, "rank": 0.06, "text": "full stack quantum solutions", "timestamps": [{"start": 1352244, "end": 1354430}]}, {"count": 1, "rank": 0.06, "text": "overhyped quantum computing industry", "timestamps": [{"start": 173960, "end": 176046}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}