{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/51a185a2-0c40-41e8-aeaf-00ef8a148672", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["ai help energy industry accelerate smart", "based", "battery", "be", "bottom", "building", "by", "can", "candidates", "carbon", "challenge", "classification", "clean", "climatic", "come", "conditions", "conf fourty two", "contribute", "costeffective", "costs", "deployed", "dont", "etc", "facilities", "from", "harika chebrolu", "helps", "installations", "installed", "investments", "investorspolicy", "locations", "makersrailwayselectrical", "operates", "owners", "panels", "points", "portfolios", "prioritize", "production", "productionready", "project", "projects", "property", "provide", "providing", "pv", "red hat", "rooftop", "rooftops", "savings", "senior software engineer", "techniques", "terms", "todays", "transition", "uncluttered", "understandable", "unidentified", "using", "varying"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "d2f7122f-eb66-4f21-8b15-bd5b45fcbe50", "status": "completed", "error": null, "text": "Hey everyone, how is it going? I hope you are all doing good. This is Harika Chebrolu, working as a senior software engineer in Red Hat. So in this talk we will be going to discuss about how AI can be leveraged by energy industry to accelerate the smart green transition. So the main agenda that we will be going to cover in this session are the problem statement. That is what are we trying to solve and why are we doing this then how are we going to solve this? Using training and production ML pipeline and the sample solution architecture to solve this problem. So now coming to the problem statement, so we all know that by burning coal, gas and oil for our energy needs, we are adding carbon to the atmosphere which is tapping the solar heat control which is contributing to the global warming. And we also know that we are looking for a ways to go green and protect the earth. So I believe one of the most excellent ways to go about it is having solar panels. Solar panels. So we know that solar panels doesn't absorb heat from the sun and it does not penetrate the heat into the buildings and keeping the earth cool and also the building cool and it will direct the sun rays away from the house. And we also know that solar energy is very promising and freely available resource which will not be ended anytime soon. So that's the reason we have the increasing attention on solar energy as a renewable source of energy. But the problem is there is no proper knowledge and viable information on installing the solar panels on the rooftops. So that means the investors or the policymakers and the electricity and the railway department departments doesn't have the enough information to come up with the viable solar energy investments which are sustainable and cost effective. Hence high potential solar investments are remaining as an deployed. So along with it, the installation and understanding the rooftop efficacy is also a very cumbersome and time consuming process and which will take at least one to two day full day to calculate the solar protection of each rooftop and which is increasing the revenue of the solar economics. This has resulted to the cost of sales taking up to 30% to 40% of the total project cost, significantly worsening the unit economics of solar projects. So for this, if we come up with the smart system that can help to improve the integration of renewables in an effective way, will solve all these problems and also it will decrease the global warming. For this we can detect the rooftops and give the understandable rooftop classification to accelerate the growth of the solar installation in a given area in order to identify the potential of facilities solar installation depending on the uncluttered surface area and direction, location, surroundings, color, material, et cetera. So we can consider these data points as an input to calculate the solar potential. And as an output we can give the optimal location to place the solar installation to have the high emission of, I mean to have the high energy consumption but with less carbon emission. So we can provide this deep engine product, so deep engine vision product to the battery owners or to the property owners so that they can utilize this to get the optimal location of the solar panels and also they can decrease the investment on time and also on the money and also with less carbon emission. So that's what we are trying to solve in this way. So for this we need a training and prediction phase like every ML pipeline has. So in this training phase we'll have the rooftops images data set as an input which are completely unlabeled and not preprocessed. So we will extract the features of those images after having property, preprocessing and annotating them and removing noises and brightening the images, doing all the image preprocessing techniques, we can extract the features and after extracting features we can calculate the available rooftop area and we will send those data sets along with this data to the training, to the training phase. So here we can follow the batch process. That means 70% of the data we'd be sending to the training and remaining 30% of the data we can send it to the testing. So after application of proper training algorithm and after optimizing the training data set incrementally, we would get one trained model and we can validate that trained model by the use of remaining 30% of the data set. So this will come under training phase and now coming to the prediction. So by now we had a trained model already. Now we need to validate or to check whether our trained model is doing training property on the unseen data set. So we have already unseen data set. I mean we have kept this unseen data set aside. Now we use that unseen data set for this prediction process. So after running, after running the algorithm or the model on top of this unseen data set, we would get one energy variable as an output. So through which we can estimate the optimal location to install the solar panels. So along with it. So we will be getting this energy variable depending on various factors which would get trained based on those factors which I have already mentioned like surroundings, material, available, rooftop area and the type of rooftop and surroundings, et cetera. So coming to the solution architecture, as I have already mentioned. So we would be getting the rooftop data which was completely unlabeled and dropped. Now we need to clean that image data set for the algorithm to detect the features properly. So for that, first we need to annotate the data, like annotating the material, annotating the type of rooftop and whatever is required for the further process, we need to annotate them. Then after annotation those annotated images data set would be going to preprocessing and the noise remover stage where we do all the whitening or the grayscaling and removing the watermarks and all those things we'll be doing as a part of the stage. So those cleaned images, we will be using these cleaned images in the olact segmentation model where we will segment the images and also we will classify the images into these four types, that is flat, heavy, industrial, low, uncluttered and existing solar. So we will classify the rooftop as flat. If there is no equipments on the rooftop, and if it is completely flat, completely plate, we will classify the rooftop as heavy industrial as if it has more equipments, more pipes, et cetera. So if it has in that structure, then we classify that rooftop as heavy industrial. So if the rooftop has very few equipments, very few pipes, then we will classify that that as low cluster. If the rooftop has already a solar panel installed on it, then we classify that as an existing solar. So after applying the OLAT segmentation model, we would get the segmented image as an output and we would be using this segmented image for the further process. Something like calculating the rooftop area, available rooftop area. Sorry. And for predicting the material and for the prediction of color. And we would be using all these factors for the calculating of energy. So we can calculate the available rooftop area using mask r can algorithm or the grayscaling algorithm. Depending on the images and depending on the accuracy, we can use any of these algorithms and then we will calculate the material and the color. So for the color we can use CIE 76 algorithm and for the material. So we would be already allotating the data. For the material we can use that label data and using k means clustering, we can detect the material for the rooftop provided in the given image. And based on these factors, we can calculate the energy produced based on the few factors provided, which would be provided by the electricity department as an output, we would be getting an energy and we can ingest all this entire model into an engine or into some project. And we can deliver this product to the energy departments or the railway and electricity departments and they can use this model to get the output based on which they can decide the place where they can install the solar panels to get the efficacy of the solar energy. Thereby we can reduce the global warming and also the carbon emission. Yeah. So that's it from my end. Thank you.", "words": [], "utterances": null, "confidence": 0.938704129251705, "audio_duration": 669.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Harika Chebrolu: How AI can be leveraged by energy industry to accelerate the smart green transition. Using training and production ML pipeline and the sample solution architecture to solve this problem.\n- There is no proper knowledge and viable information on installing solar panels on the rooftops. This has resulted to the cost of sales taking up to 30% to 40% of the total project cost. If we come up with a smart system that can help to improve the integration of renewables it will decrease the global warming.", "auto_highlights_result": {"status": "success", "results": [{"count": 4, "rank": 0.09, "text": "solar energy", "timestamps": [{"start": 101712, "end": 102378}, {"start": 116532, "end": 117520}, {"start": 144982, "end": 145866}, {"start": 662068, "end": 662798}]}, {"count": 7, "rank": 0.08, "text": "solar panels", "timestamps": [{"start": 82220, "end": 83346}, {"start": 83538, "end": 84530}, {"start": 85996, "end": 86754}, {"start": 129468, "end": 130114}, {"start": 281292, "end": 282130}, {"start": 420280, "end": 421490}, {"start": 656884, "end": 657546}]}, {"count": 4, "rank": 0.08, "text": "available rooftop area", "timestamps": [{"start": 332170, "end": 333862}, {"start": 438326, "end": 439690}, {"start": 565960, "end": 567074}, {"start": 578892, "end": 580438}]}, {"count": 1, "rank": 0.08, "text": "image data", "timestamps": [{"start": 458116, "end": 458782}]}, {"count": 1, "rank": 0.08, "text": "solar projects", "timestamps": [{"start": 195728, "end": 196950}]}, {"count": 1, "rank": 0.08, "text": "high potential solar investments", "timestamps": [{"start": 152614, "end": 154294}]}, {"count": 1, "rank": 0.08, "text": "facilities solar installation", "timestamps": [{"start": 231132, "end": 233122}]}, {"count": 1, "rank": 0.06, "text": "energy industry", "timestamps": [{"start": 35212, "end": 36034}]}, {"count": 1, "rank": 0.06, "text": "rooftops images data", "timestamps": [{"start": 304068, "end": 305534}]}, {"count": 1, "rank": 0.06, "text": "viable solar energy investments", "timestamps": [{"start": 144480, "end": 146822}]}, {"count": 1, "rank": 0.06, "text": "proper training algorithm", "timestamps": [{"start": 354930, "end": 356826}]}, {"count": 3, "rank": 0.05, "text": "training phase", "timestamps": [{"start": 302212, "end": 302874}, {"start": 340844, "end": 341918}, {"start": 375032, "end": 375586}]}, {"count": 1, "rank": 0.05, "text": "annotated images data set", "timestamps": [{"start": 479708, "end": 481542}]}, {"count": 1, "rank": 0.05, "text": "rooftop data", "timestamps": [{"start": 451252, "end": 452110}]}, {"count": 1, "rank": 0.05, "text": "solar heat control", "timestamps": [{"start": 64728, "end": 66180}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}