{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/0b88e1e9-03f7-4035-98f6-f3645120481c", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["apps", "areas", "attendees", "be", "being", "beings", "budget", "but", "can", "concrete", "conf fourty two", "content strategist", "does", "dont", "embedding", "existing", "expertise", "goahead", "having", "hoping", "ideals", "identified", "im", "improved", "issues", "jessica wirt", "means", "needed", "oneperson", "online", "pro", "problems", "products", "professional", "professionals", "rainbowfilled", "resources", "sites", "skillsets", "software", "steps", "strengths", "teams", "thats", "things", "toptier", "towards", "truematter", "try", "understand", "unicorns", "users", "ux", "ux unicorns myth of oneperson usability", "uxwhatever", "weaknesses", "wellrounded", "youll", "youre", "youve"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "9038f155-16d9-468c-9357-731e9f08cf41", "status": "completed", "error": null, "text": "Hello, everyone. Thanks for joining. My name is Jessica Wirt. I am a UX strategist or user experience strategist at UX consulting firm Truematter. We are headquartered out of Columbia, South Carolina, which is also where I'm from. And basically our job at Truematter and my job as a UX strategist is to make sites and apps and Internet, whatever digital products easy for real people to use them. So that sounds pretty simple in theory, but it is a little more complicated in practice. And I'll talk a little bit more about that in a minute. But first, I'm really here to talk to you about unicorns, as you might have guessed from the title of my presentation. But I'm not here to talk to you about any old unicorn. You'll have to probably go to a different sort of conference for that type of thing. Im here to talk to you about UX unicorns. There's a myth running around in our industry today. A lot of companies hear about this fabled UX stuff, and Im kind of poking fun at that idea. But truthfully, a lot of companies hear about the amazing metrics and results that UX is producing for their users and for their competitors. And so they think, awesome, let's hire a UX professional into our internal team structure, and they're hoping to fix it for us. They're going to do Ux for our company. Now at Truematter, we jokingly call these new sites and these individuals UX unicorns because while they sound super fun and super magical, they do not actually exist in practice. UX unicorns do not exist because no one person can handle all of the aspects and experiences and disciplines involved in actually producing excellent user experience all by themselves. It inherently takes a team. So it's great that companies understand that UX is valuable, truly, and that they want to incorporate it into their teams, but they get themselves in situations where they hire a UX professional. They don't incorporate them in the correct way because they don't really know how to. And so hiring that UX professional doesn't actually end up producing the results that they wanted to see and expected to see. So it sort of youre the concept of UX for them. That's because they're operating under a few myths. Obviously, one of those myths is that UX unicorns do exist, but at a more fundamental level, many companies just don't understand what UX is. It's a buzzword, even the acronym by itself. I mean, who would know that UX stands for user experience on its own. That's kind of confusing, right? So because I know that some people watching things presentation might find themselves in that camp, I want to talk about what UX is, and I want to do that by talking about what UX is not. First of all, UX is not a band aid. So it's not something that if you have a poorly built, poorly designed, or envisioned digital product, you can simply slap on top and expect to see the sort of amazing results that you're hearing about or might be hearing about from other companies around you. So it's not a band aid, not a quick fix. UX is also not something that you can tag on at the end of a project. It's not a last minute fix, just like it's not a quick fix. UX is actually involved in every project where it is truly thoroughly implemented and thought of all the way from early discovery and definition through implementation, existing and implementing any feedback from launch. So there is no such thing as a UX phase or quick UX tag on to make surface level changes. It goes far beyond that. And of course, UX is not something that a single person can do all by themselves. Now if it's not something that one person can do alone, obviously that implies UX always takes a team. And really, if we think about it, it's not just that UX takes a team, it's thats producing any truly excellent digital product is going to take a team. So I want to talk about what a fully fledged products teams actually looks like. I want to talk about the five disciplines involved in a fully fledged project team. And a lot of companies are familiar, a lot of individuals are familiar with at least some of these disciplines. But if some of them sound a little bit nebulous or far off to you, don't worry about that, because I'm about to explain to you what exactly each of these individuals or people in each of these disciplines actually does. Im also, just to clarify, these are not every single person that's involved in producing a digital product. These are the hands on, day to day people that are doing that sort of grunt work, if I can call it that, as one of the people that does that sort of thing. So I'm not talking about business analysts, scrub masters, project managers, marketing, sales. All of those people are obviously incredibly important to the ultimate success of a product. But I'm talking about those hands on, day to day people because that is where UX expertise best lives. So if you're familiar with some of these disciplines, great, I'll go over them in a second. But another youre thing to understand about UX and how to incorporate UX expertise into a team is that, yes, you have these five core disciplines of a product team. Within each of these disciplines out there in the great wide world, there is a smaller group of people that are considered UX professionals. That just means that as they go about their daily tasks within this primary discipline, they're doing everything from a user experience standpoint. So I'll give myself as an example. My job title is UX strategist. That's what I do. It's obviously a strategy position. So I'm thinking about high level product success and users at every turn. But I come from a content strategy background, so I'm also considered a content strategist. But because I'm a UX professional, I'm sort of couched under that discipline. And that's how most UX professionals are. And that's truthfully where you'll find the most value in hiring a UX professional is someone who comes from a specific discipline but also really knows UX. So let's talk through each of these one by one, starting with developers. You probably know about these people extremely important. They build for product users and use cases if they're developers, that are also UX professionals. So UX developers or UX people in each discipline think a little bit differently than their counterparts that are not UX professionals. So UX developers also guard against extra features and functions that users don't actually need, and they really build towards usable patterns for experience, consistency. All of that helps that end user. In the same way, visual designers that are UX professionals think about layouts and styles for how humans actually operate and take in information online. They are always considering interactive behavior as it relates to design, so they work closely with other members of the product team in order to do so. And they're thinking task based design at every turn because that communicates how to actually use the interface, not just tone or style, but how it is used. Content strategist you may or may not be familiar with. These are the people that come from writing backgrounds. Some of them come from, honestly, all sorts of backgrounds. Psychology, marketing could be a lot of different things, but these are the people that are thinking about presentation of information and actions for how humans actually digest words online. They're thinking about the right words to guide users to the right task. So they work super closely with visual designers in that regard, and they're thinking towards reusable content patterns that support design and development. User researchers this is more of a traditional UX role. As you might think about it, they're different than market researchers or other type of resources because they are truly honed in on the user at every turn. They are observing real people using products in real life. They're designing and conducting activities leading to valuable interactive input. So in layman's terms, they're actually talking to individual end users and conducting activities with them to gain that valuable information. They're using task based tests with users to see what is and is not working. These are the people that really uncover all sorts of fun, unexpected things when it comes to UX, because across the board, people do not use digital products like you might expect them to. Of course, there are best practices within the UX community and within the digital product community. Yes, but people surprise us all the time. That's why user researchers are so pivotal to a product team. And last but not least, you have information architects. These people areas also more of a traditional UX role. They are thinking about organizational structures that make sense to real people. They are functional, or rather, they are thinking of functional but human understandable interfaces. And they're really bridging the gap between technical requirements and user interactions. So because they do that, they really do bridge the gap between how to structure and build a product for those end users in a way that's going to be intuitive to them and make sense at every turn. So that gets us to our final fully fledged product team in each of those disciplines. Obviously, it's important to have people that are specialists in each of those disciplines. Yes, but in a truly ideal state, each of those disciplines would also represent someone who is a true expert in UX, or at least has a functional, working understanding of how to incorporate UX best practices into their team. Now, what you'll notice is that obviously an entire group of professionals, whether or not they are UX professionals, far outweighs what any one single, even magical being can do all by themselves. So why do so many companies still think that UX unicorns exist? My take, it's either because they don't understand what UX is, which we've talked about already, or they simply don't understand what successful user experience looks like in practice. So I want to give you an example of what that looks like. I'm going to show you the before and after of a website for healthcare organization that we've actually worked with in the past. At true matter, the before will probably seem familiar to some of you. I'll go ahead and show you that. Yeah, it's a big sites here, lots of links, an attempt at organization, but obviously this digital product could not support it. It was not in any sort of organized cms so it needed a lot of work. This clearly needed a massive UX overhaul, so that's what we gave it. So I'm showing you the after version on mobile because obviously that's what we're focused on here. But you can see all the way from high level organization in this navigational structure down to the simplicity of the design on the screens, the content strategy, just high level statements, high level micro copy or extremely valuable microcopy. Functionally everything is vastly improved from that before. This is what user experience produces. These are the kinds of results thats you can see in your digital product with UX know how incorporated and it produces metrics too. We've had companies see 45% increase in site traffic, 65% reduction in maintenance over time, which is just massive. Everybody understands how critical that is. And this one's fun. 465% increase in mobile use from a before and after for a site super similar to the example that you just saw. That is what a fully fledged product team with user experience know how applied at every turn in every phase produces. But what about money? Of course, what about money and what but stakeholder approval? If you don't have the budget and approval to actually incorporate UX know how into your team in every single individual, that's okay. There are still things that you can do and that involves having a single UX professional. Now if you're thinking, isn't the entire purpose of this presentation to convince me that I shouldn't hire a single UX professional, you're sort of right. You don't needed to hire a UX unicorn. You needed to hire a UX professional and use their know how and their skill sites to bolster the strengths that your team already is producing with the disciplines that it already has. So it's not that you can't hire a single UX professional and be successful, you definitely should if you have the budget and approval to do so. It's that you have to go about incorporating that UX know how in the right way. So let's walk through those steps. It starts with identifying your gaps. Before you ever write a job description or look outwardly, to hire a UX professional, you need to understand your current product team's strengths and weaknesses thoroughly. So let's look at an example. Let's say this is your product team. You have Romeo and Juliet. We won't ask any questions there. Let's say Romeo is a front end developer and Juliet is a back end developer. This is what a lot of product teams actually look like, obviously, especially development teams. So out of these five key disciplines, you only have one area covered. That's not good, but you can work with that. That means when you hire a UX professional, when you actually do go to write that job description, you should target hiring a UX professional that has a background in one of the disciplines that you are missing from your team right now. Now when you complete this steps and you're sort of thinking through, okay, what do we have? Who do we have? Make sure youll analyze untapped potential on your team. If you have especially a lot of individuals on your product team thats are in a single discipline, look for any underlying skill sets or skill sets thats you can bolster really people that you can direct to sort of COVID one of the other disciplines if you have that available to you. So let's say someone on your team is a developer and this is kind of an odd scenario, but maybe they areas also a visual designer or they have worked as a visual designer in the past, they have a skill set there or there's something you can do to be able to give them a little bit of education, train them a little bit so that they can cover that discipline. Do it. Because when you go to hire a UX professional, that means you just have one more discipline already covered. You don't have to worry about it. You don't have to look for someone to cover it. So once you analyze your gaps, you needed to prioritize those gaps based on upcoming products needs. So obviously, if you only have developers on your team and you have all gaps in all of those other disciplines, youre going to need to do some prioritization based on what you have coming up. You basically need to ask the question, okay, based on the projects that I have coming up, who do I really need? What discipline am I hoping to have to have to do this? Well, for example, let's say you know your team is about to build a ton of forms. If you're full of developers, if you have all that developer knowledge, that's going to be a walk in the park to actually create those and build them out. But look at all of the copy that you have here. You need people that understand structure and how to write a form so that you get effective responses. So maybe the UX professional that you go to hire is a content strategist or an information architect by trade. Maybe for another example maybe you are doing some sort of patient facing application for a healthcare system like we talked about earlier. So there's a lot of design involved here and it's probably going to be pretty important to understand the types of patients thats are coming in and going to be using this and filling that out. So maybe the UX professional that you hire is either a visual designer or a user researcher. So that's sort of how you practically go about targeting. Okay, which of the gaps should I really focus on? Which discipline do I truly need to hire someone in? And if you can make thats person a UX professional, it's a win win situation. So the next step is supporting your new hire. And I say that knowing that there's a steps that I'm skipping pretty much entirely. You actually have to find the right person and hire them. That's actually the easiest step of this entire process. So I'm not going to cover it very much, but if you have specific questions there, I'm happy to answer them. You can find me on LinkedIn and just reach, but I can pass along some articles or some know how to help with that. Supporting your new hire is probably the most critical phase of this entire process. This is where a lot of companies misstep and start treating their new hire like a UX unicorns. You treat your new hire like a UX unicorn, they will start to act like one. Which means they will run away into the magical forest of LinkedIn and you will never hear from them again. They'll quit. You don't want that. You obviously can't afford thats for your project budget, timeline and sanity. All of the above. So don't treat them like a UX unicorn. That starts with where you place them in your organizational structure. If you leave your new Ux hire out in an island by themselves outside of youre existing team structure, everyone is going to look at them like some weird UX person, which is how most people already view UX professionals. And that's fine, but that's not going to help you get anywhere, practically speaking, when it's time to start incorporating UX knowledge into your actual product decisions. So instead of doing thats, always, always put your UX professional inside of an existing team structure. Like I said towards the beginning, that's where they belong. They belong doing that day to day discipline specific work. They're just hoping to do it with that UX focus and with users in mind at every turn. Now, beyond actually placing them in your structure, immediately involve them in that day to day product work that can involve even reviewing what other people have done for UX best practices, sharing some of that know how and that's really the last step to making a new UX hire successful. When you only have the budget or the go ahead for one person, you have to use what they know and use their skills to share UX knowledge with the rest of your team. But you have to be realistic at this phase. Just like one person cannot handle all of Ux by themselves, one UX professional cannot turn your existing product team into a group of fully fledged UX professionals. Maybe if you have ten years, sure. But one person is not going to be able to do everything required for their job and train everybody in all of the UX best practices. Provide them the experience. That stuff takes time, so they're not going to be able to do that. But what you can do and what you're aiming for is a UX happy team. Your single UX hire can share enough of the best practices knowledge for UX, the practical decision making, they can weigh in, they can review other people's work. Creating a UX happy team, all thats means is you have a product team where one person is a UX professional but everybody else is doing their best to incorporate UX best practices and think about users and that will make a world of difference. That is what progress looks like. It's not your ideal state, but it's good enough to start getting you some of those amazing results only if you do not treat them like a UX unicorns. So in order to do that, you have to make sure you follow the right steps when you're hiring a UX professional. Identify your gaps, prioritize project needs so look at your gaps and prioritize the person in the right discipline that you actually need to hire. Then support them by putting them in an existing team structure and from there share the UX know how from that individual to the rest of your team. That just might be enough to get youll the budget and the go ahead to hire another UX professional. At which point you would of course just go back through the process again. Continue sharing that UX knowledge. Continue relying on your entire team, not just one individual to come in and save the day. But even if you don't get the budget in the hire for another UX professional, at the end of the day, progress still looks like a team of individuals all collaboratively working towards one UX goal. And that starts with one UX hire that is not treated like a UX unicorns and that's about all I have for you today. So if you're interested in user experience, you want to learn more both about team structure and from a more basic perspective of what the heck is ux? Because I get it. What the heck is ux? We have additional reading@truematter.com slash ideas. That's our blog. We just put but educational materials so that people can learn about ux. That's where you'll find the post thats sparked this whole presentation. Ux unicorns do not exist. If youre from a little bit more of a technical background or someone that you work with might benefit from understanding how developers and UX professionals work together, we have an article specifically for that. And we have additional articles on mobile use. So what's the coordination between UX and mobile? All sorts of stuff. Design any discipline or area that you're interested in. We have more there other than that. Thank you.", "words": [], "utterances": null, "confidence": 0.960068879219403, "audio_duration": 1525.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Jessica Wirt is a UX strategist or user experience strategist at UX consulting firm Truematter. Her job is to make sites and apps and Internet, whatever digital products easy for real people to use. It sounds simple in theory, but it is a little more complicated in practice.\n- A lot of companies hear about the amazing metrics and results that UX is producing for their users and for their competitors. Truematter jokingly calls these new sites and these individuals UX unicorns. But they do not actually exist in practice. No one person can handle all of the aspects and experiences and disciplines involved in producing excellent user experience all by themselves.\n-  UX is not a band aid, not a quick fix. It's not something that you can tag on at the end of a project. UX is actually involved in every project where it is truly thoroughly implemented. producing any truly excellent digital product is going to take a team.\n- The five disciplines involved in a fully fledged project team. Within each of these disciplines there is a smaller group of people that are considered UX professionals. Where you'll find the most value in hiring a UX professional is someone who comes from a specific discipline but also really knows UX.\n-  UX people in each discipline think a little bit differently than their counterparts that are not UX professionals. User researchers are more of a traditional UX role. Information architects are thinking of functional but human understandable interfaces. These are the people that uncover all sorts of fun, unexpected things when it comes to UX.\n- To hire a UX professional, you need to understand your current product team's strengths and weaknesses thoroughly. Use their know how and their skill sites to bolster the strengths that your team already is producing with the disciplines that it already has. If you don't have the budget and approval to actually incorporate UX know how into your team in every single individual, that's okay.\n- A lot of companies misstep and start treating their new hire like a UX unicorns. Always put your UX professional inside of an existing team structure. Use their skills to share UX knowledge with the rest of your team. Creating a UX happy team.\n- What the heck is ux? We have additional reading@truematter. com slash ideas. We just put but educational materials so that people can learn about ux. Design any discipline or area that you're interested in.", "auto_highlights_result": {"status": "success", "results": [{"count": 22, "rank": 0.11, "text": "UX professional", "timestamps": [{"start": 98464, "end": 99638}, {"start": 152964, "end": 154330}, {"start": 160708, "end": 161594}, {"start": 419528, "end": 421010}, {"start": 431964, "end": 432786}, {"start": 873704, "end": 875170}, {"start": 881292, "end": 882466}, {"start": 888208, "end": 889366}, {"start": 902032, "end": 902934}, {"start": 923288, "end": 924478}, {"start": 961668, "end": 962634}, {"start": 967128, "end": 967966}, {"start": 1032828, "end": 1033666}, {"start": 1100788, "end": 1101626}, {"start": 1133548, "end": 1134386}, {"start": 1151568, "end": 1152454}, {"start": 1255668, "end": 1256858}, {"start": 1316152, "end": 1317006}, {"start": 1366568, "end": 1367918}, {"start": 1396544, "end": 1397510}, {"start": 1426120, "end": 1427346}, {"start": 1445040, "end": 1446246}]}, {"count": 1, "rank": 0.11, "text": "UX people", "timestamps": [{"start": 455492, "end": 456142}]}, {"count": 2, "rank": 0.1, "text": "UX developers", "timestamps": [{"start": 454020, "end": 455162}, {"start": 461956, "end": 462974}]}, {"count": 3, "rank": 0.1, "text": "UX strategist", "timestamps": [{"start": 22388, "end": 23514}, {"start": 37708, "end": 38866}, {"start": 402356, "end": 404030}]}, {"count": 9, "rank": 0.1, "text": "UX unicorns", "timestamps": [{"start": 73240, "end": 74930}, {"start": 113438, "end": 114894}, {"start": 123430, "end": 124858}, {"start": 176268, "end": 177138}, {"start": 711412, "end": 712394}, {"start": 1195888, "end": 1197158}, {"start": 1390048, "end": 1391370}, {"start": 1459268, "end": 1460510}, {"start": 1493810, "end": 1494750}]}, {"count": 3, "rank": 0.1, "text": "UX knowledge", "timestamps": [{"start": 1247206, "end": 1248294}, {"start": 1303700, "end": 1304778}, {"start": 1432348, "end": 1433490}]}, {"count": 2, "rank": 0.1, "text": "UX expertise", "timestamps": [{"start": 358644, "end": 360042}, {"start": 372462, "end": 373630}]}, {"count": 4, "rank": 0.1, "text": "UX best practices", "timestamps": [{"start": 689462, "end": 690822}, {"start": 1287148, "end": 1288786}, {"start": 1334028, "end": 1335410}, {"start": 1371342, "end": 1372878}]}, {"count": 1, "rank": 0.09, "text": "quick UX tag", "timestamps": [{"start": 259588, "end": 260874}]}, {"count": 1, "rank": 0.08, "text": "UX consulting firm Truematter", "timestamps": [{"start": 26476, "end": 28886}]}, {"count": 1, "rank": 0.08, "text": "product users", "timestamps": [{"start": 447872, "end": 449126}]}, {"count": 2, "rank": 0.08, "text": "product teams", "timestamps": [{"start": 926760, "end": 927602}, {"start": 944672, "end": 945414}]}, {"count": 1, "rank": 0.07, "text": "user experience strategist", "timestamps": [{"start": 23876, "end": 25922}]}, {"count": 8, "rank": 0.07, "text": "user experience", "timestamps": [{"start": 23876, "end": 24838}, {"start": 135826, "end": 136886}, {"start": 190752, "end": 191642}, {"start": 396208, "end": 397306}, {"start": 726590, "end": 727486}, {"start": 804052, "end": 804846}, {"start": 845600, "end": 846602}, {"start": 1466392, "end": 1467138}]}, {"count": 1, "rank": 0.07, "text": "day product work", "timestamps": [{"start": 1281052, "end": 1282760}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}