{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/06690a2b-a3c0-406e-88e1-fab374114449", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["baran ozdemir", "become", "computing", "conf fourty two", "developments", "independent entrepreneur", "materials", "opportunities", "ozfengineering", "represents", "these"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "40225401-52f5-4e28-bfd2-ac8432508c77", "status": "completed", "error": null, "text": "Today we will discuss quantum computing technology for material science, why material science is important and how can we apply quantum computing technology for material science? In every field of science, engineering or others we use material science and the quantum computing technology is the most advanced technology today. And we need to apply in the field of material science and how can we do it? Today we will discuss it. I prepared some slides to presentation about quantum computing technology for material science, why this is important, why quantum computing technology is the biggest challenge for the material science and how is it works. For the introduction part prepared the quantum computing technology. I will give some short information about the quantum computing technology because it is very deep. It is very deep topic about advanced technology, but I will give the short information about that. And after that we will discuss the power of computing, how this is, this is how it is, it is possible and how we are used. The qubits or classical computers. What is the difference between classical computers and the quantum computing and the power of computing is very essential, very important for the material science. And in the main topic, the material science and power of computing, how can we apply this technology in the material science, how we can change the power of computing in the field of material science and different industries and studies. I will give some example about that. And after that, material science for quantum technology, we design different materials for the quantum computing technology and quantum computing technology will design different materials. It is very complicated problem for science today, but I will give some sort of information and I will give some brief talk about it. After that we will make a conclusion and the quantum computing technology. This technology is the most important scientific discipline of our century and our future. Why I said like that? Because it is the most advanced technology, because we can achieve the most competing power of competing with the quantum computing technology in the material science. We can design any material. We can make anything with the quantum computing technology. This technology is the basis of the systems that can achieve high computational capability with the help of qubits. It is very different between the classical computer and the quantum computing because there are many qubits that are fair position in the qubits, which we can apply in the games, in the different algorithms, in the quantum computing with the help of the qubits and we can solve many complex problems. Help of the qubits and the inherent parallelism of quantum computing comes from the superposition of qubits. This parallelism allows a quantum computer to work on a million computations at once. It's very important because this is the huge amount of computational power of qubits. And we can achieve the thousands of qubits today at the help of IBM, it is very important scientific news. This technology can fulfil high accuracy and computational capability with different algorithms and a completely different concept of information processing. It is very different to use quantum computing technology in accordance with the information process because you need to design your algorithms, your gates and your problem in this field of competing. In this field of computing. This technology creates its own ecosystems with five different qubit models, different algorithm shapes, problems and solution. As I said before, this is a new concept and we need to design the material science in this field. And we can achieve anything. We can make anything with help of quantum computing technology and the power of competing. It is the main idea of the quantum computing technology because we can make a solution for the complex problems with help of the power of computing. How we take this power of computing because of there are qubits. This technology brings with it the computational power unimaginable to mankind because as I said before, we already reach more than 10,000 qubits due to the IBM arcs. This process capability increases exponentially as two power of n depending on the number of qubits. For example, at 30 qubit quantum computer would equal the processing power of a conventional computer that could run teraflops, trillions of floating point operations per second. Today's typical desktop computers run at speed measured in gjaflow, billions of floating point of operation. But that amount of power of computing, it is very unimaginable. And how can we use in the material science? I will show you this image, show the 10,000 qubit processor. Image d wave systems also d wave has a very good work about the quantum computing qubit processor. How can we obtain the qubits and how can we apply the qubits on the problem with different algorithms, with the different gains, how can we solve this problem and how can we apply in industry? Next slides we will discuss the material science, how it's related with the qubits. And this is the amount of qubits of IBM different years. We reach more than thousands, more than thousand in last year. It is very important and big news about it, because that amount of qubits gives us the unimaginable calculation capability, power of computing capability and material science. And power of computing in the material science, defining the specifics of materials, structure, property, process and characterization are taken into account. We can design all all polymers, all cells are metals. With the processing performance, structure properties and characterization values, we can combine them with new materials and achieve high performance materials and very different nanomaterials. And we can obtain different shape of structure, we can obtain different processes of materials. We can obtain higher performance materials with the change of atomic structure, with the change of molecular arrangement, and with the change of movement of molecules in the polymers. For example, when I give the parameter for the polymers, we can change the moment of the polymer chain, we can change polymer thermodynamics of the polymer. And how can we improve the process about this thermodynamic processing? Because there is a huge amount of problems inside of metaverse. This is the power of competing, we can apply, we can make a calculation, we can achieve the more and more high performance materials. Because we have the qubits, we can solve many problems. It is very important. Each parameter is carefully selected and combined to determine the performance of the materials. You can make different alloying elements and how can we solve the different kinetics of materials parameters. We can create a new material and you need to make assimilations. How can you make simulations? You can't even imagine the amount of the problem. This is why we are using the qubits. This is the power of computing. With the quantum computing technology in the material size, we can solve many problems. In the material size, we can design kinetics of materials, we can make relationships in the thermodynamics process. And this can help us to design our materials thermodynamically, in the atomic structure, in the performance of the materials, in nano parameters or macro parameters. It's very important and there are many different industries and studies about this. The pharmaceutical steel cell companies have devoted a growing share of their net revenues to RD activities, averaging about 2020 19% over the past two decades. By comparison, other research intensive industry like software and semiconductors average about 15%. This is very important. Pharmaceutical company companies can apply the material science is the main factor, why they are applied to quantum computing technology and the power of competing in the pharmaceutical industry and why we design new semiconductors. How can we do it? Because there are big solution, a big problem inside the atomic structure, thermodynamically and atomic arrangements and many calculations. We need to solve this problem. Accuracy, accuracy. And you need to be fast. And that's why the Cubans help us. And different industries and studies I will give the pharmaceutical industry and quantum computing's primary value for pharma lies in research and development. Disease understrength development, target finding. This is very important to use quantum computing technology to competing with power of computing, because this industry is growing very rapidly due to material science. In order to design materials, collect appropriate data and ensure chemical and physical stability. The big data network must be analyzed quickly and the right decision must be made. The pharmaceutical industry stands out as the important area where quantum computers and material science are combined. This situation grows even more with financial data and investments instruments. This is very important because in the chemical and physical tests, during chemical and physical tests, there are millions of data according to drugs and crystallization ratio, optimization ratio or anything. The analysis of the chemical structure. How can we solve this problem? Easily. And you need to give good decision about the set of industry, because it is very important in us. You need to be very fast. For example, pandemic and the Covid-19 you need to make good drugs. And how can you do that? Because you need to combine many things in the drugs. And there are four stages in the pharmaceutical industry to make a good drug. And this is why we are using this method and the quantum computing technology. And this is very important for this industry. And also there are other industries. For example, semiconductors. As the semiconductor industry, according to research in the 2000 previous slides. In the previous slides, you need to grow your crystalline structure in the semiconductors. How can you apply at the pressure level? The pressure level is important and atomic structure is the most important part. Because the stability of the electrons and the band gap, it's very important. It is another parameters, there are billions parameters and you need to combine these parameters very fast. This is why we are using quantum computing. The pharmaceutical industry is a significant contributor to the global economy and to health systems and health care across the world. According to data from IQVIA, revenue in the global pharmaceutical market is estimated to have reached 1480 2 billion American dollars in 2022. Why the financial growth is important for the pharmaceutical industry, as there is a Covid-19 and other diseases in the world. And you need to find a good solution. And how can we apply the completed power of competing? We need to change. We need to measure the drug crystalline ratio, solubility optimization and product formulations. In the organic product formulations, you need to know the material size and you need to be quick. You need to solve your problem as possible quickly. And that's why you need to apply the computing power of computing, because you need to know solubility optimization. You need to change ratio of crystallity in accordance with disease. You need to change product formulations in accordance with body in accordance with disease. You need to be quick. That's why we are using the turbines. And then we need to examine the other side of the other side of science, accordance with material science in the quantum technology. Material science for quantum computing technology and how can we apply the materials in the quantum computing technology. And this is other side of this technology. The electrical properties is one of the most important parameters for the quantum computing technology because you need to obtain good photons. The photon properties is very important in this semiconductor materials. You need to design your materials, especially two dimensional materials is important to achieve more and more stable photos. When I continue in the slides, electrical properties of materials emerge as the most important property for current computers. Different structures and materials groups can exhibit different electrical properties. It's very important. There are many semiconductors in this field and the different corporations and different industries work with different materials. I will give a tree of example in the next slides. And especially the evolution of two dimensional materials in terms of photonics is extremely important for quantum computing. And one of them, one of them quantum that technology and others broadband technology. It is very important to design the band gap and the quantum broadband technology is important to design your band gap to take the photos in the, for example, rapid ion system. It is very important and essential for broadband technology, for bandicap systems, for rapid ion systems. On the other side, quantum dot technology is very important for the superconducting quantum computing technology. And this is why important because these are different technologies used two dimensional matrix for the stability of the systems. You need to design your materials in the nanometer scale as possible as good arrangements and good appropriate. I said appropriate electrical characteristics. It is very important to combine different materials for the semi crystalline materials because you need to. You need to obtain good quality of the photon. And also lifetime is important because if you take the photons, you need to be processed with this photo. This is the lifetime of the photon, is the ascension and there are some parameters about that. For example, super competing conductors materials. In the most important parameters is the operating temperatures. Because the operating temperature is the source of energy. It is very important to obtain good operation temperatures to available systems, to common systems. You need to achieve for example -100 degrees celsius for the photos. Because the cryogenic temperature is very hard to make operation in the system. Because the cryogenic temperature is waste of time and waste of energy. A big energy and a big time. It is very important to obtain cryogenic temperatures for the photos. On the other hand, lifetimes, emission wavelength range and the photon priority and the back gaps of photons is the most important parameters for the photonic characteristics of the materials. Thus, the development of material science directly affects computer technologies and I will give some different materials and data values in terms of photonic properties. For example, molybdenum, molybdenum sul sulfide, tungstenium and molybdenum d selenium. These are different materials, shows different characteristics, different protonic characteristics. As shown, the lifetime is too short. This is very important to make a process in the quantum computing technology. You need to achieve to protect your lifetime, your photos to process range. This is very important to design algorithms on the quantum computing system because of lifetime. If you have good lifetime, you can make a processing time. You can have good processing time. It's very important also emission wavelength range is important to work specific, specific parameters for the system. Because every photons have different emission wavelength range and you need to simulate your system in the field of emission wavelength range. This is very important to work with different semiconductors and also pretty of the photos. I will give some examples about these materials for our work. The purity of the photon is important to obtain more clear information from the photos. It is also important and the operation temperature. And I said before, operation temperature is important to apply this technology in the industry because cryogenic temperature is very hard to obtain that for the industry and the every field of the life. And you need to obtain good temperature, good operation temperature to your process, to your system too. For work. It is very important because temperature is the cost of energy, mainly cost of energy is the temperature you need to make a good setup about that. And the belly gap is important to to arrange the electron volts between the minus and phosphine minus and p type, n for n type. And this is very important and technical issue for the obtain photos in this field of quantum technology. And when I make a summarize in the summary, a quantum computing technology have been used to determine the critical properties of magic. This has had a direct impact on the development of high performance materials, especially in the pharmaceutical industry. As I said before, the pharmaceutical industry in the financial is the most important area which depends on the quantum computing technology. Because as you remember, the solution ratio of crystalline solubility and formulation are very important parameters. You need to be quick about that. You need to gain good accuracy about that. In the pharmaceutical industry, the use of quantum computing technology has become widespread for processes that develop high computational technology such as finding the solubility ratio and appropriate dosage. Today, the number of qubits has exceeded 10,000 by ibms is very important. Will you achieve advanced technology? There are many sectors and there are many cooperation in this field. And this number is increasing by day by in order to increase this number, different materials have started to be developed in terms of photonics. The photonics is the main section for the material size for the quantum computing technology or photo technically developed materials, values such as operating temperature, band gap and pretty of the photon are very important. Why we are using these are factors and I discussed, and these are parameters, these are technic parameters, and I don't give any technical information about that, but it's a little bit short talk and I'm very happy to discuss these parameters with you. All the factors within the ecosystem, material science, quantum computer technologies, and the growing industries connected to them are growing in terms of financial and usage areas. As I said before, we are going to quantum age with the material size. How can we apply the material science in the quantum copy technology and on the other side, quantum copy technology for the material science, these are parameters, is essential for the quantum age. These are parameters, photonic behavior, two dimensional materials, pharmaceutical industry, and also high performance materials. They are related with the information technology. Maybe next day, maybe next day, on the next year, we need to obtain more than thousands qubits because our problems getting complex and we need to solve this in the field of the size. And I just want to say thank you about presentation and thank you for us.", "words": [], "utterances": null, "confidence": 0.88794251866277, "audio_duration": 1590.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- In every field of science, engineering or others we use material science. Quantum computing technology is the most advanced technology today. How can we apply quantum computing technology for material science?\n- IBM has more than thousands of qubits, giving it unimaginable calculation capability. The pharmaceutical industry stands out as the important area where quantum computers and material science are combined. Quantum computing's primary value for pharma lies in research and development.\n- The development of material science directly affects computer technologies. Electrical properties of materials emerge as the most important property for current computers. Two dimensional materials is important to achieve more and more stable photos. How can we apply the materials in the quantum computing technology.", "auto_highlights_result": {"status": "success", "results": [{"count": 7, "rank": 0.1, "text": "different materials", "timestamps": [{"start": 150498, "end": 151578}, {"start": 157178, "end": 158366}, {"start": 1050130, "end": 1051634}, {"start": 1133170, "end": 1134106}, {"start": 1239446, "end": 1240510}, {"start": 1252786, "end": 1253970}, {"start": 1475728, "end": 1476600}]}, {"count": 27, "rank": 0.1, "text": "material science", "timestamps": [{"start": 27688, "end": 28912}, {"start": 30040, "end": 31000}, {"start": 36304, "end": 37444}, {"start": 42928, "end": 44040}, {"start": 52448, "end": 53668}, {"start": 65916, "end": 67068}, {"start": 74580, "end": 75744}, {"start": 121018, "end": 122082}, {"start": 124194, "end": 125282}, {"start": 130450, "end": 131574}, {"start": 137002, "end": 138214}, {"start": 146874, "end": 147706}, {"start": 197244, "end": 198388}, {"start": 315562, "end": 316618}, {"start": 398306, "end": 399336}, {"start": 433758, "end": 434902}, {"start": 464118, "end": 465238}, {"start": 467630, "end": 468566}, {"start": 663248, "end": 664288}, {"start": 729540, "end": 730516}, {"start": 749322, "end": 750018}, {"start": 979126, "end": 980234}, {"start": 983034, "end": 983938}, {"start": 1232126, "end": 1232974}, {"start": 1519828, "end": 1520812}, {"start": 1539944, "end": 1540688}, {"start": 1546632, "end": 1547724}]}, {"count": 28, "rank": 0.09, "text": "quantum computing technology", "timestamps": [{"start": 25142, "end": 27052}, {"start": 34040, "end": 35752}, {"start": 44968, "end": 46376}, {"start": 63372, "end": 65332}, {"start": 69260, "end": 70824}, {"start": 81966, "end": 83646}, {"start": 87782, "end": 89206}, {"start": 152090, "end": 153614}, {"start": 154410, "end": 155934}, {"start": 175094, "end": 176954}, {"start": 195012, "end": 196588}, {"start": 204692, "end": 206064}, {"start": 283784, "end": 285456}, {"start": 323660, "end": 325304}, {"start": 331396, "end": 333064}, {"start": 596984, "end": 598816}, {"start": 667840, "end": 669288}, {"start": 720684, "end": 722604}, {"start": 823912, "end": 825644}, {"start": 984234, "end": 985814}, {"start": 990202, "end": 991654}, {"start": 1001130, "end": 1002426}, {"start": 1101838, "end": 1103394}, {"start": 1264322, "end": 1265994}, {"start": 1400742, "end": 1401974}, {"start": 1423962, "end": 1425414}, {"start": 1444116, "end": 1445452}, {"start": 1486332, "end": 1488344}]}, {"count": 1, "rank": 0.09, "text": "different technologies", "timestamps": [{"start": 1107382, "end": 1108470}]}, {"count": 1, "rank": 0.09, "text": "materials parameters", "timestamps": [{"start": 576792, "end": 578644}]}, {"count": 4, "rank": 0.09, "text": "high performance materials", "timestamps": [{"start": 492370, "end": 494194}, {"start": 555768, "end": 558056}, {"start": 1409058, "end": 1410898}, {"start": 1560448, "end": 1561944}]}, {"count": 36, "rank": 0.08, "text": "quantum computing", "timestamps": [{"start": 25142, "end": 26342}, {"start": 34040, "end": 35072}, {"start": 44968, "end": 45960}, {"start": 63372, "end": 64652}, {"start": 69260, "end": 70188}, {"start": 81966, "end": 82958}, {"start": 87782, "end": 88638}, {"start": 114722, "end": 116082}, {"start": 152090, "end": 152994}, {"start": 154410, "end": 155314}, {"start": 175094, "end": 176286}, {"start": 195012, "end": 195964}, {"start": 204692, "end": 205460}, {"start": 216450, "end": 217530}, {"start": 227242, "end": 228402}, {"start": 238338, "end": 239266}, {"start": 283784, "end": 284784}, {"start": 323660, "end": 324668}, {"start": 331396, "end": 332428}, {"start": 413692, "end": 415428}, {"start": 596984, "end": 598112}, {"start": 667840, "end": 668664}, {"start": 720684, "end": 721988}, {"start": 823912, "end": 824992}, {"start": 874296, "end": 875964}, {"start": 984234, "end": 985194}, {"start": 990202, "end": 991034}, {"start": 1001130, "end": 1001874}, {"start": 1064614, "end": 1065914}, {"start": 1101838, "end": 1102774}, {"start": 1264322, "end": 1265378}, {"start": 1276596, "end": 1277860}, {"start": 1400742, "end": 1401510}, {"start": 1423962, "end": 1424794}, {"start": 1444116, "end": 1444820}, {"start": 1486332, "end": 1487612}]}, {"count": 1, "rank": 0.08, "text": "new materials", "timestamps": [{"start": 489738, "end": 490978}]}, {"count": 3, "rank": 0.08, "text": "quantum technology", "timestamps": [{"start": 148066, "end": 149134}, {"start": 981322, "end": 982654}, {"start": 1394542, "end": 1395794}]}, {"count": 1, "rank": 0.08, "text": "materials groups", "timestamps": [{"start": 1034474, "end": 1035754}]}, {"count": 2, "rank": 0.08, "text": "computer technologies", "timestamps": [{"start": 1234262, "end": 1236194}, {"start": 1521412, "end": 1522588}]}, {"count": 4, "rank": 0.08, "text": "different industries", "timestamps": [{"start": 139122, "end": 140266}, {"start": 629080, "end": 630016}, {"start": 701956, "end": 703252}, {"start": 1046634, "end": 1048770}]}, {"count": 1, "rank": 0.08, "text": "many different industries", "timestamps": [{"start": 628536, "end": 630016}]}, {"count": 1, "rank": 0.08, "text": "quantum dot technology", "timestamps": [{"start": 1097270, "end": 1098342}]}, {"count": 1, "rank": 0.08, "text": "high computational technology", "timestamps": [{"start": 1448884, "end": 1450596}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}