{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/6e95bae7-00d0-432a-90f3-5dd27e40d9c8", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["be", "becoming", "best", "build", "can", "child", "childs", "childs mindset", "cockroach labs", "conclude", "conf fourty two", "conquering", "databases", "developer advocate", "editors", "examples", "from", "im", "issues", "javascript", "mindset", "mountains", "older", "progress", "provide", "rain leander", "rainbows", "recommendations", "skills", "started", "technologies", "these", "troubleshooting", "two", "unicorn", "using", "wants"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "ed10641e-27aa-4881-b112-8a4b4cdc2151", "status": "completed", "error": null, "text": "You on the road to conquering the world. You need to regress or get in touch with your inner child to make progress. I know what you're thinking right now. Do I want to conquer the world? Of course you do. And now you might be thinking, but my inner child is pretty messed up. Totally fair. Mine two. But your inner child is also incredibly wise. They know how to fall down and get back up, how to be brave, how to play, and how to explore and be curious. I'm rain Leander, developer advocate with cockroach labs. And today I would like you to use a child's mindset for growth, to embrace your inner child, to become the beautiful unicorn I know you are, and yes, to conquer the world. Who here knows how to ride a bike? Raise your hand if you're in the Netherlands. You've known how to ride a bike possibly since birth. But most of us learn at some point in our childhood. Unless you haven't. Unfortunately, if you don't learn how to ride a bike when you're a child, it is infinitely harder to learn. And not because our brains have shifted, but because at some point, some shitty person laughed when we fell down. And we develop this aversion to failure. We don't want to fall. We don't want to mess up. We don't want to be embarrassed. And when we're trying something new, we wants to instantly be the best. I've got news for you. When you're trying something new, you will not be the best. You are not a secret ninja if you have never taken any ninja training classes. You will not win the Tour de France if you've never learned to ride a bike. But you could, as long as you get back up. Because it is absolutely guaranteed that you will fall down. You will fail, you will mess up, you will make mistakes, and that is beautiful and totally fine. Fall down. It's part of life. And then get back up, child. I am asking you to embrace your inner child today. Maybe this analogy doesn't fit as well as the rest, because bravery is not something we're born with. It's something we develop. And from what I've seen with a seven year old and a pair of four year olds, children are not the bravest creatures. Because becoming brave is hard. Sometimes it feels impossible. Being brave is not a lack of fear. It's moving forward despite that fear. But if it's overwhelming, here are some baby steps. Two. Becoming more brave. Embrace that vulnerability. Admit you have fear. Do it anyway. And when you fall down, get back up. Nothing is impossible. Every big scary monster or dragon or problem can be broken down into manageable, bite sized pieces. And the key is to start. Listen to that fear inside of you. Acknowledge it. Admit it. Take a few minutes to make a plan and then do the plan. Just in case you're one of those skeptics who doesn't believe in the importance of play, I'd like to introduce you to the National Institution for Play, which gathers research from diverse play scientists and practitioners to prove that play is good for your physical and mental health. It increases harmony and effectiveness of relationship, it optimizes learning and it encourages innovation. How many here now want to become a play scientist? When we're children, play is built into our daily structure. But as we get older, there's less recess, no more breaks, and fewer naps, which is bullshit. These moments of play, of engaging in activity for enjoyment and recreation rather than a serious or practical purpose, are instrumental to enjoying life. Two becoming a unicorn and to conquering the world. Now, sadly, I can't tell you how two play. This depends entirely on you. What you enjoy doing for fun. Do that when it's not fun anymore, it's time to find a new fun thing to do. Now, sure, I can give you some ideas like baking cookies and sharing them with me. But most importantly, book the time on your calendar and these go play. It is absolutely possible to live your life sitting in your room doing the same thing day in and day out. But why? Im so glad you asked. Literally from birth, people are explorers, exploring surroundings, environment, relationships, limitations, potential. And what does this do? And how does that work? And what happens if I do this? To stop exploring is to stop being true to yourself. And the key to exploration is to stay curious. Curiosity pushes you to explore, yes, but also to network, to solve problems, to recognize and take advantage of opportunities, and to lead a happier life. But how? There are many paths to achieve an exploration can explorer's mindset. Mine includes being curious, listening a lot, ask questions a lot, avoid dysfunction, listen. Embrace learning as fun. Develop a beginner's mind. And please don't forget to listen. Here's a little secret. Come closer, a little closer. You are a unicorn already this label unicorn is a euphemism for being unique and fabulous and extra. And you. And if Dr. Seuss is to be believed, no one in the world is youer than you. And they're right. All of the experiences you've had in your lifetime, your education, your background, your ups, your downs, whatever brought you here to this talk today at this conference, no one else has that reality. Your experience, your truth, your existence and understanding. That is what makes you a unicorn. The neat part about all of this is if you follow those other steps, you will conquer the world. It's inherent in the steps. Be willing two fall down and get back up. Be brave, play, explore and be curious. Be the beautiful unicorn I know you are and you will conquering the worlds. It thank you. Many thanks to comp 42 python organizer, organizers and sponsors. If you have any questions, comments or just want to stay in touch, feel free. I am rain Leander on most media. Thank you so much. Bye.", "words": [], "utterances": null, "confidence": 0.944020982658961, "audio_duration": 549.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- You on the road to conquering the world. You need to get in touch with your inner child to make progress. Being brave is not a lack of fear. It's moving forward despite that fear. Here are some baby steps.\n- National Institution for Play gathers research from diverse play scientists and practitioners to prove that play is good for your physical and mental health. The key to exploration is to stay curious. Follow these steps and you will conquer the world.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.07, "text": "diverse play scientists", "timestamps": [{"start": 266712, "end": 268174}]}, {"count": 2, "rank": 0.06, "text": "children", "timestamps": [{"start": 189654, "end": 190186}, {"start": 288438, "end": 289020}]}, {"count": 4, "rank": 0.05, "text": "life", "timestamps": [{"start": 166328, "end": 166900}, {"start": 313198, "end": 313490}, {"start": 358228, "end": 358510}, {"start": 404890, "end": 405520}]}, {"count": 2, "rank": 0.04, "text": "rain Leander", "timestamps": [{"start": 65118, "end": 66014}, {"start": 542636, "end": 543794}]}, {"count": 1, "rank": 0.04, "text": "developer advocate", "timestamps": [{"start": 66142, "end": 67390}]}, {"count": 5, "rank": 0.04, "text": "inner child", "timestamps": [{"start": 32588, "end": 33382}, {"start": 44412, "end": 45078}, {"start": 51012, "end": 51678}, {"start": 75292, "end": 75974}, {"start": 173448, "end": 173922}]}, {"count": 1, "rank": 0.04, "text": "many paths", "timestamps": [{"start": 409588, "end": 410634}]}, {"count": 1, "rank": 0.04, "text": "fewer naps", "timestamps": [{"start": 296816, "end": 298410}]}, {"count": 1, "rank": 0.04, "text": "Dr. Seuss", "timestamps": [{"start": 464952, "end": 465662}]}, {"count": 3, "rank": 0.04, "text": "today", "timestamps": [{"start": 69032, "end": 69330}, {"start": 173976, "end": 174530}, {"start": 480140, "end": 480566}]}, {"count": 1, "rank": 0.04, "text": "play scientist", "timestamps": [{"start": 284524, "end": 285830}]}, {"count": 1, "rank": 0.04, "text": "organizers", "timestamps": [{"start": 533746, "end": 534642}]}, {"count": 1, "rank": 0.04, "text": "problem", "timestamps": [{"start": 233756, "end": 234358}]}, {"count": 2, "rank": 0.04, "text": "exploration", "timestamps": [{"start": 389632, "end": 390262}, {"start": 412484, "end": 413422}]}, {"count": 1, "rank": 0.04, "text": "relationship", "timestamps": [{"start": 276812, "end": 277400}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}