{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/ce786332-d93c-4d77-b4b9-ed717715119c", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["applications", "because", "bervianto leo pratama", "build", "ci", "cloud", "complex", "conf fourty two", "containers", "decides", "doesnt", "etc", "from", "has", "im", "leo", "lerna", "loves", "mitrais", "net", "opensource", "project", "projects", "selects", "software engineer", "tools"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "280dd921-6f44-4a90-b29e-65ab4d70ba39", "status": "completed", "error": null, "text": "Hello everyone, thank you for joining this session. My name is Bervianto Leo Pratama and you can call me Leo. Today I'm going to talk about why im moving Dana projects to the tech project. First of all as I mentioned my name Bervianto Leo Pratama and you can call me Leo. I'm a software engineer and yeah I'm also sometimes with a blog in devtool so feel free if you want to find me in dev two you can see my blog post in there. Other than that I also active in LinkedIn so if you want to connect with me or follow me, you can follow me in LinkedIn with name Birfintola Pratama. Today we will talk some points, the first points project goals and after that why I migrate the project the migration background also what is my strategy to migrate from learner to net and also the current states. So what the process and what the result. And also I have some plans to have more complex maybe or more features in my surfaces. And for the last I will tell you about the lesson learned, the summary and what I learned from duplication project. First I will talk about the project goals. So yeah it's just a simple goal. I want to create a simple service to manage my personal passwords or secrets. If you know some services that similar with this for example Lastpass or Bitwardern or anything else. I want to create a service for myself, a simple service and I can self host it. Yeah other than that I want to have an open source project for myself. But feel free if you want to contribute it. And for the last I want to easy to manage. Well maybe easy to manage it's relative with you but for me easy to manage its main I can handle it with a limited time, I can handle it and develop it with a limited time. So the background because my project in early stages I do not want have a complex projects for the early stages. Yeah I think it will better if I have a simple surface, simple structure and yeah my prefix structure. As you can see in the image I have three tier the first part front end I'm using few js and for the back end part I'm using filter js and for the last I'm using database. Basically I need to change the context in my mind because in my daily basis im using net. So it will need I mean I need more time to change the context. I need to learn how to coding with node js, how to coding with vgs and when I coding with front end maybe I will need change my context to backend. As you can see my preface structures, if you are already familiar with letter structures, is like the first part using packages and after that in front end using from end folder and also for the back end using back end folder. So it's basically have two projects. But the question is how the deployment target. So I was thinking about one year for this deployment strategy and also CiCD strategy because I have a limited time so I never implement it because it's really hard to manage multiple projects. That is why the last question how about the capacities? Well, because I have a limited time and this project only be so I decided to migrate. This is the migration strategies. First I will use analytic. Why monolithic? Maybe most of you will say I think better using microservices, but for myself with a limited time it will hard to manage microservices. So I will choose monolithic and two tier web applications. So as you can see in the diagram, I choose web app and also have other database in separate services. Why I'm using monolithic because it's more manageable for a person with limited time. I know if we have more modules, more services, it will hard to manage the monolithic. But because the project in the first stages are really simple, I think it will better using monolithic and also why I decided using net because I already familiar with it. Well the structure also happens similar pattern with Lerna. You can have multiple projects in one repo. Yeah we can say it's a mono repo Internet have a some structure. It will have some structure well so it will more easy for me to migrate into the net. So the current state the application is already deployed to AWS. Im using Azure DevOps for pipelines. I'm using Amazon ACR to host the Docker image. So the web app I containers using Docker and push the docker image into Amazon easier. Also I will host my web application into AWS app runner. It will use Docker image from Amazon easier. As I mentioned, the repository is opensource. Feel free to contribute or give feedback in the repository. You can check in the link for the next I want to apply clean architecture basically because it's mixed between infrastructure, the few or the business context. I want to separate the business context with the infrastructure like databases or the API. Yeah, always step by step to migrate to be more modular. Okay, so what I learned from migrating right now to. Net yeah, I think it cannot be applied to most of you, but I want to say if you want to rescoping your project, it's completely fine. If want to rescoping your project based on your offer data and also your needs, feel free to scoping. Don't think the best practice using microservices is fine if you want to use monolith well, so I think it's completely fine. It's okay if you want to use monolith in your first state donut, and you can migrate it step by step into microservices if you want to. All right, that's all from me. Thank you for joining this session. If want to connect with me, feel free to connect with me. In LinkedIn we can pratama. Also you can connect with me in dev two the same name befriend. Thank you everyone.", "words": [], "utterances": null, "confidence": 0.909528840996169, "audio_duration": 659.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Bervianto Leo Pratama talks about why im moving Dana projects to the tech project. He wants to create a simple service to manage my personal passwords or secrets. And for the last he wants to easy to manage.\n- Why monolithic? Maybe most of you will say I think better using microservices, but for myself with a limited time it will hard to manage microservices. So I will choose monolithic and two tier web applications. Feel free to contribute or give feedback in the repository.\n- Clean architecture is mixed between infrastructure, the few or the business context. Always step by step to migrate to be more modular. If you want to rescoping your project, it's completely fine.\n- All right, that's all from me. Feel free to connect with me in LinkedIn and in dev two the same name befriend. Thank you everyone for joining this session.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.08, "text": "multiple projects", "timestamps": [{"start": 348608, "end": 350098}, {"start": 454132, "end": 455322}]}, {"count": 1, "rank": 0.08, "text": "duplication project", "timestamps": [{"start": 140016, "end": 141260}]}, {"count": 1, "rank": 0.08, "text": "moving Dana projects", "timestamps": [{"start": 45458, "end": 47910}]}, {"count": 1, "rank": 0.07, "text": "more services", "timestamps": [{"start": 426066, "end": 427080}]}, {"count": 1, "rank": 0.07, "text": "more time", "timestamps": [{"start": 276268, "end": 277190}]}, {"count": 1, "rank": 0.06, "text": "simple structure", "timestamps": [{"start": 232754, "end": 234070}]}, {"count": 2, "rank": 0.06, "text": "Bervianto Leo Pratama", "timestamps": [{"start": 38764, "end": 40370}, {"start": 52948, "end": 54538}]}, {"count": 1, "rank": 0.06, "text": "name Birfintola Pratama", "timestamps": [{"start": 86972, "end": 88710}]}, {"count": 3, "rank": 0.06, "text": "front end", "timestamps": [{"start": 245232, "end": 245962}, {"start": 290976, "end": 291980}, {"start": 311716, "end": 312640}]}, {"count": 2, "rank": 0.06, "text": "end folder", "timestamps": [{"start": 314456, "end": 315490}, {"start": 318888, "end": 319742}]}, {"count": 1, "rank": 0.06, "text": "first points project goals", "timestamps": [{"start": 92592, "end": 95686}]}, {"count": 6, "rank": 0.06, "text": "limited time", "timestamps": [{"start": 207284, "end": 208320}, {"start": 212884, "end": 213906}, {"start": 342704, "end": 343690}, {"start": 357844, "end": 358880}, {"start": 388208, "end": 389162}, {"start": 419752, "end": 420660}]}, {"count": 3, "rank": 0.05, "text": "Docker image", "timestamps": [{"start": 492544, "end": 494090}, {"start": 502308, "end": 503338}, {"start": 516292, "end": 516938}]}, {"count": 2, "rank": 0.05, "text": "web app", "timestamps": [{"start": 405396, "end": 406240}, {"start": 495984, "end": 497002}]}, {"count": 1, "rank": 0.05, "text": "separate services", "timestamps": [{"start": 410852, "end": 412000}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}