{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/fef91efd-a031-402d-985a-fcc62ad287ba", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["adw", "arrived", "atp", "chief innovation officer", "cloud", "conf fourty two", "emerging", "has", "organizations", "processing", "rich niemiec", "transaction", "transform", "trends", "viscosity north america"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "4d58467a-ffe5-4833-984e-5979159e0461", "status": "completed", "error": null, "text": "How can you make a bigger impact in the world? How about getting a robot to do some of your job for you? Well, this is going to be a talk that talks about autonomous database and how you can get Oracle to manage some of your databases in an expert manner. I'm going to start with the DBA and autonomous in the cloud and how it works. A robot may not look like one. Is an autonomous database just a robot? How about Alexa? How about Siri? We'll look at do you want to manage something that's more transaction processing related, getting rows very fast? Or do you want to do something more like a data warehouse where I want columnar storage and where I can use the entire column in memory instead of individual rows. Then we'll look at machine learning and how it plays into all of this and get a copy of the notes. You can send me an email. You could just go to conference 42 with DevOps and they'll get it to you as well. I work for a company called Viscosity. We focus on data, means the database, data lake, you name it, Apex, and apps on the front end of that then infrastructure, whether it's Oracle cloud, whether it's Google Cloud, whether it's Azure, or whether it's AWS, we can help you. We've got many Oracle aces on the Oracle side if you need more help there. Things are coming very big in AI with Oracle, with the new vector database, and we'll see a little on that at the end of this talk. We wrote many of the books out there, not just Oracle Linux you see there, and also things like ASM virtualization and cloud storage. One thing to note, if you are an Oracle DBA, be on at least 19 c. That is a long term release of Oracle. The next one is going to be 23. The releases in between there are innovation releases where they show you some things that you might test out. When I look at autonomous database, is it going to take my job? And the answer is some jobs are gone. Computers surpass them. These operators work faster. Will they keep their job if a switch is going to replace them? No. Rod emerging. Put it this way, the competition between man's mind and the product of man's mind. And he was speaking about robots with this, they're standing room only in the twilight zone. I've seen robots at Oracle's conference maybe seven, eight years ago and then again five years ago at more of their product conference. If you look at this robot, this is pepper the robot. A thousand units of pepper being offered September years ago, sold out in 1 minute. That's how you know something is hot. But it is time for workers to start to worry about AI. For a DBA, the workloads are increasing. As you see, 78% of the dbas have unplanned downtime. 95%. Automation is lacking. Autonomous database is going to make this number go down where there's automation everywhere. Two out of three dbas are struggling to give full security protection. The answer from Oracle, we're going to give you something, a self driving, self securing, self repairing database. Is that gonna leave me unemployed? I don't think so. The autonomous database, you could see how serious they are with their advertisements. I think the vendors think the cloud and databases in the cloud, it looks like this, but really they want to take you down this very narrow path to get there. If you go quickly, sometimes it's very dangerous and you got to be very careful. But I can tell you this, with the cloud, a few years later, it looks like this, especially with autonomous database. A long time ago, and I mean probably a decade ago, economist magazine has talking, actually 2017, talking about how data driven organizations are much more productive, much more likely to find customers and retain them. And if you look at it, it makes sense, because if you look at how to make an impact, the better you know your customer, the better you can find customers, the more effective you're going to be. As I have more and more data, I start to get where a very small population, kind of like a survey, gives me a very high result in what I'm trying to give to my customer. But data is often very big. The volume is high, coming at me very fast, velocity is fast, different values of data. A lot of people don't take that into account. Different varieties. People sometimes use different databases and maybe they cloud do it with the same database and then different truths of data. How accurate is this data? I could do each database individually, or I could use Oracle's converged database. Oracle gives me relational JSON key value graph spatial files. Now we're moving into where they have a vector database. And if I look at that, you can see all of the features that are already built into that. If we look at IoT, it's another thing that's coming very fast. We don't have a lot of security sometimes in IoT because it's a very small device that you can't store as much. So you got to be a little more careful what you have there. But this is just going to add more data. I can go to my refrigerator, and my refrigerator might say, I've talked to the bathroom scale, and unless you order some of these vegetables, we're locking the refrigerator on you. This is reality in the world we're living now. But big data took us from we used to say, what happened? Why did it happen? The could happen. Give me a prediction now. We could say, what's the best thing that can happen? So if we do things right with data, we'll do prescriptive analytics. Prescribe what needs to happen for the best solution, for us to hit our numbers or for us to solve the problems we're trying to solve. Emerging jobs you could see data engineer DevOps if I can handle twice as many databases because I use autonomous database, how much better am I going to be at this job of data engineer? But also in the world of machine learning, the data scientist is only 20% of the job and the other 80%. The most of it is a DBA, but a lot of it is also a developer as well. The robot may not look like one. As I said earlier, alexa, Siri, they're robots. They don't complain. They work 24/7 they never ask for a raise. Well, they ask you for whoever sells them ask for more. Their autonomous database is really a robot. It just doesn't get up and walk around. Self healing. How about a database that can put the patch on before I even know there's a security risk? Self driving manages all the dials that I need to do. Self tuning as it finds things that are problematic. Self recovering, self administrating it came out with Oracle's 18 C database over five years ago. The reality though is will your job change if you use this? I hope so. I hope it will help you to find more time, help you to manage more databases. Should get you closer to the business and innovation. Maybe you go into the data side, be more of a data manager. Autonomous database spreads to online transaction processing so Oracle has an autonomous data warehouse which was very good for analytics, did columnar storage and also in memory queries. Automatic transaction processing made transaction processing faster, faster at the row level. So am I doing a report where I'm summing up columns and comparing things, or am I looking for individual rows? Oracle created a database that is going to be perform and tuned for that application specifically. The other thing is it withstands errors. Server outage well, real application clustering rack also gives you multiple servers. Going to the same database gives you availability. Also has autonomous data or active data guard that allows you if one there's an outage in a region. Now all of a sudden it's going to fail over takes seconds of time. Rack I could tell you is pretty much automatic. You don't even notice data corruption. I can use data guard to recover it has well patches, rack and so on. So another thing it does for me is gives me an incredible SLA. 99.995 is amazing with data guard. What about the autonomous database in the future? Well, first of all, I always tell people before you go there, make sure who's tuned it before it gets to the cloud, because you want it to be has fast as possible because you'll pay less for the cloud. Who makes sure the vendor is charging me correctly for the Cloud? A lot of people make mistakes when they order. They buy the cloud and they're not watching what's costing them money. They don't shut things down when it can save money. Who builds the policies? Who makes sure the security is working correctly? The answer is the DBA. The DevOps person is going to set that up. So how easy is it? Well, first of all, it's free. Cloud oracle.com try it or cloud slash free and you create your first autonomous database here. Here I go to it and it shows you what you get for it. Compared to AWS, I get two databases instead of one. I get four instances instead of one. I get 200 gigs of block volume instead of 30, ten gigs of object storage instead of five. So you get a lot and it's free. We'll ignore that. Get started for free ATp oracle.com cloud slash free when I sign up gives payment information I always want to know when I sign up for something, how do I end it? And the answer is your account automatically gets decommissioned. So free cloud will continue on as long as you're using it. There's no limit to it, but it does give you the first 30 days where you can use all the different things within the Oracle cloud, and you put in your account information, your name, your email, and pretty soon you can see all these new features you could try out now with the free version, you could do the cloud in the exact number of databases, instances I showed you earlier. But in the first 30 days you could try all these different things. I want to try some big data, I want to try some AI type of things. As I said, you could do autonomous data warehouse autonomous transaction processing I'm going to show you jSon in a minute, but basically you could see the hamburger icon here. You click and you get a pull down menu where I could either do things at the block level, I could do autonomous database. And this shows how I look at autonomous databases. And there's some of the things that I would set up on the right that I might want to know. When 19 C came out, this is five years ago, they already had it on 18 c. Larry Ellison said, we're going to automatically tune it. So with autonomous transaction processing, he literally made it so machine learning will look and monitor potential indexes. Do I need new indexes? How does the execution plan work? Do I want to go a different way? And it would change it if it was needed, has to be tested, validated, et cetera. Of all the different sqls on the system, how hard is it? Well, basically create an ATP database. Click on that when you're ready. Once I do the free version, I first of all get on the cloud. Once I log in there, I'll see that menu. When I go to create that database, it's going to ask me what I want to call that, whether I want to do transaction processing or data warehousing, what version I want to have it on, and then some administrative privileges. If you are a current Oracle customer, you bring your own license and save money with this too. Now the free version, you don't need any of it. Autonomous transaction processing to provision a database, two minutes, 70% growth rate in Oracle's first Q four after they release this, stop the database. All I do is go up here, more action. Stop. Are you sure you want to stop it? Stopping. Stopped. Very simple to use. How long did that take? Provisioned it in two minutes. Got it built two minutes. Once I knew the settings I want stopped the database, 25 seconds. Restarted. 30 seconds. I can scale it. Oh, I've got one cpu to start with here. Let's scale it up to two. Now all of a sudden it goes to two. Once it's available, as it's scaling, can also stop and start a database in 40 seconds. So it shuts it down and it restarts it. You can see, very easy to do this, just pulling up a pull down menu. Restart, stop, start, whatever you want. You also can have an auto start stop schedule that you could set up as well. So this thing is unbelievably easy to use, free to try. What else is in there? I can cloud the database, do a full clone. Everything included in this database is somewhere else in another place. Or I can do a refreshable clone. This is my main database. I'm going to keep updating it. I'm going to build a clone, but I want to make it refreshable. So this one refreshes it every seven days in this case, or within seven days rather. I also could go to database actions, do SQL to my database and you cloud, see some of the other. I can do rest objects, I can do JSON and so on. There's several choices in here of things I can do. I'll show you a few more in a minute. There's also a performance hub, what's taking a long time, how many users are doing things, what are they using? There's also a service council where I can look at activity and I can look at individual pieces of SQL and how long it's taking of database time or I o time or cpu and so on. Could also do provision a database for autonomous data warehouse. So we just saw autonomous transaction processing. So is data warehouse any harder or easier? Took all of a minute and 20 seconds to provision. That means create it. But I find autonomous database is very optimized depending on what you set it to. So autonomous database originally was autonomous data warehouse, built for things like columnar storage and doing calculations and doing analytics and things like that. But then they came out with ATP, autonomous transaction processing that worked more at the record level and it had automatic indexing as well. And here's just some more examples of different ones. One optimizes complex I'm looking at a lot of information, summarizing data maybe of a whole field or computing all the salaries, whereas autonomous transaction processing response time. I'm looking for just one salary. Columnar format autonomous data warehouse row format for autonomous transaction processing creates data summaries, creates indexes and does auto indexing. Memory is unbelievably fast for columnar in memory storage and querying things in autonomous data warehouse. And the memory is used generally for caching individual records. When I look at autonomous transaction processing. So depending on which one you want to go to, you pick one or the other if you have something more in between. I tend to go with ATP compared to Amazon. As I talked about earlier, if you have things in memory, if you have a lot of performance tuning type of features built into the product, and automatic tuning, it's going to be faster and the price is going to be a lot lower when you look at the cost of what you're producing, whereas Amazon, I mean, obviously you buy a lot more cpus and do the same thing. Maybe you're doing at Oracle, but with Oracle your price performance is substantially better. My benefits, patching, automatic patching is probably the biggest one. I think it takes a lot of time for people. Automatic tuning is another one. But most of all, you get to sleep at night. Here's all some of the best features. We'll say automatic provisioning, you saw it under two minutes. Automatic configuration of all the different things to optimize for the workload you want. Automatic indexing, automatic scaling if I want to do that, automatic data protection, things like patches, automatic security backups, patching. Security is encryption, by the way, that's built in as well. Detection and resolution. It's always looking for different issues as well to try to solve those and then automatic failover to other regions if needed. It also has a cost analysis. I can go to billing and costs when I have autonomous database and then this will tell me what I'm doing and maybe I'll shut some down or close some databases to lower the cost over time for a given month. There's not just ATP and ADW, but there's also autonomous JSON database. It's not covered here. And there's also Apex, which is a front end application. Roughly 2 million people working on that, currently building applications. I forget how many applications a day it was, but it was substantial. Create and run notebooks in Oracle if you're not familiar with notebooks. Some people use Jupiter, some people use Zeppelin, Oracle has Zeppelin. But there is a way to use Jupyter as well through Oracle. But basically I'm listing SQL or PL SQL or something, or could be Python. And then I'm querying that data and I want to graphically show it and I do it all within a notebook. So I have a list of sequentially listed statements. Then I could do graphical analysis. But what I think people really need now is predictive and prescriptive analytics. And I talked about how that is, and this is an old twilight zone where this guy could predict what you need. But we're really moving to prescriptive now with AI and advanced machine learning. And I'm going to show you a little more on Oracle's machine learning. But if you look here in the Oracle autonomous transaction processing we're looking at here and going to development, we have Apex, which I talked about over 2 million apps I think built a year. We also could use Oracle developer, but we also have machine learning notebooks. And I'm going to talk a little more about that. And then here's just a dashboard as well of different performance metrics, alerts and so on. Let's go into that machine learning now. What does it give me? Well, first of all, all kinds of documents to learn about it, create jobs to do things and so on. I can just run some SQL or SQL scripts, or I could build a whole notebook or set jobs up. But some of the examples that are out there are either in Python or SQL. Could also do it in r, but things like classification, things like anomaly detection, association roles. Here's some more Python, just to give you some examples. If you do go into machine learning, first, it's what's the business problem I'm trying to solve? What is the function here on the right that I want to perform? And then what algorithm do I want to use? So let's say I want to classify data into good bad customers, or, I don't know, maybe three groups, or maybe it's age groups. So has my problem. I want to know my good and bad customers. Then what function do I want to use? Oh, I'll use classification. What algorithm do I want to use? Maybe I'll use support vector machine. I'll show you the algorithms and the functions. In a moment, though. I want to build and train the model with data I have because I know what my good or bad customers are. And then I'm going to go and test and I do that with 60%, train the model and then the other 40%. I'm going to say, how well did this algorithm do? Should I use a different one? But you can see some of the functions. Am I looking to classify data? Maybe I want to cluster big data into age groups, or maybe I want to look through customers to see any anomalies that are out there. What makes a very good or bad customer? What makes a potential security risk regression? Or maybe I want to do predictive analytics and then do prescriptive analytics after I find the answer of how to fix that. Or maybe I want to find the attributes of good or bad customers. These are things I want to do in machine learning, but I have to define well what I want to do. Not target the best customer, it's what makes the best customer. You have to know what makes a best customer for you. Is it how much they buy? How often they buy? Do they buy in the right season? Do they buy highly profitable items for you? Whatever that is, that's where you're going to classify into good and bad customers. Maybe it's age groups and I'm going to go to big data. Let's consider this big data. Maybe we'll separate things into age groups. After I find my best customers by age group, I'll go to big data and see if I could find some of those same age groups and customers. Now let's look at an algorithm. What is an algorithm? It's just math. We don't have to do any of the math. Somebody wrote it 50 years ago. Some of it goes back to the 18 hundreds. But anomaly detection says, make a circle around all the good data and the outliers are out here. Maybe it's fraud, maybe it's something else. Maybe it's a good customer or a bad customer. But whatever it is, I'm looking for an anomaly. There's also support vector, linear support vector machine. And this is a support vector machine, SBM, where I separate good and bad customers, not by the green line, not by the blue, but by the red line. So future points will land on the right side, hopefully. So a one class support vector machine looks for anomaly detection now within Oracle. And you're not going to learn machine learning here. I'm just showing you that once I build an autonomous database, I could start to do machine learning. So I want to maybe select star from customers means select all the customers. And then I also have ways in the settings to then graph all of those customers. And I could pick the kind of graph. Obviously I have a bar graph here, but I could stack things into different colors by the marital status of the person. And then it also shows what year they were born. Let's go one step further. How did I build the anomaly detection? Well, have to have some algorithm if this is the best one. There's more than one support vector machines. A little bit of SQL here. I'm going to put some settings into there, and then I'm going to go and call that algorithm and say the probability from this customer table that it's null, which means it's anomaly. Then I want you to graph that. So I do a bar graph in this case again. Or I could change my SQL to say, what are the attributes making them anomalous? And I could find that very quickly. You're not going to learn machine learning here. You're not going to learn SQL here. You could see if I build an autonomous database now, I could write SQL and start to build machine learning inside. And it's not a lot of lines of code. Here's another example of an algorithm decision tree algorithm maybe. I'm a lawyer and I want to decide whether I should take a case or not. They're offering me a settlement of $30,000. Well, if I proceed, I may win, I may lose. There may be costs, there may be damages. If I win, there may be lower or higher damages. Should I proceed? What the decision tree algorithm will do is calculate all of these paths of this tree and say, overall, you're losing $2,500. Take the settlement. How's the code look? Not that you're going to learn it all, but let's see how easy it is. First of all, these first three are just comments. Then I'm using an algorithm that's a decision tree algorithm. Then I say the function I want to do is classification. In this case, I'm going to classify whether somebody will buy the Chicago Bears logo credit card. Are they going to buy it? Then I want to take that data. I have a list of data. Some people are very likely to buy it, and some people are not at all likely, and you end up with, oh, there's the Bears fans, and these are packers fans or something else. But very quickly, what do I do? I give my salesperson a list that they could very quickly look at and say, what part of the list should I focus on? What are the Glengarry leads there? Other algorithms include time series algorithms. Sales are very seasonal. Airbnbs fall around events that are happening. You can also do exponential smoothing, time series algorithm, where you do single or double exponential smoothing to smooth out that very rough stock market line to a smoother or very smooth line. What do you want to do? Do you want to classify things where you have all of these algorithms that are out there, separate maybe into good and bad customer? Do you want to cluster data? Oh, by age groups have several algorithms here. K means is separate them by distance, o cluster means separate them by density. I want to do anomaly detection. You'll see in the later version. There's more than one algorithm there, time series. I want to do regression. Not just simple regression, but very complex regression. Once I find those good customers, wouldn't it be nice to find the attributes that made them good customers? What are the people buying together? Maybe I cloud build a chatbot to ask them, do they want to buy part b? Because everybody who bought part a wanted part b. So you know that with association rules, a priori algorithm, specifically Oracle has many predictive queries and SQL analytics built in. They've written them for the last 30 years. Do I want to do feature extraction or text mining support? Things like Chat GPT have to do with text? We'll look at that a little bit later. There's also statistical functions. What kind of machine learning algorithms are used in healthcare? Well, guess what? They did a graph. The guy just read articles and I had the computer read them and figure out, do they ever say any of these algorithm names and they did support vector machine. I wonder why. Neural network. Maybe we're doing image classification, looking for tumors or something like that. There's also auto machine learning. I did a machine learning notebook, took me maybe two, three days. I went to auto machine learning, tried the same one. You could see how quickly it does it. It can try every algorithm for you, tell you the accuracy of that, and then it can say, create the notebook. I said okay, and created the notebook. And there's my answer in Python. The entire notebook is built in four minutes, something that took me two or three days. Amazing. There's also auto machine learning. So what do you want to do? Is the biggest issue? Do people in your company have algorithmic business thinking, so they know they want to classify things or cluster things, or look for anomalies, or find out what people buy together, or look for regression, not simple regression, like a straight line, but complex regression. What are they trying to do exactly? But machine learning is big machine learning. I can have supervised means. I have some data to train it, as we saw earlier. Maybe I'm going to classify that data and look for fraud. Or I have some data, I'm going to train that data. 60% of the data use 40% to pick the right algorithm. Then I'm going to do image classification. We're going to build an autonomous car. Maybe I'm going to do regression, forecast the weather or forecast my own market. Maybe I don't have the data. Somebody just gives me some data. I want to just cluster it into targeted marketing of age groups. There's all kinds of ways to use this. You have to know what your business needs the most. But with Oracle, everything in autonomous runs on exadata, which means it's multi tenant, so it could separate different business units into different places physically from each other. It does in memory database, where it can put the entire database in memory, but with autonomous data warehouse, it'll also put columns of data in memory. Real application cluster allows me to fail over to other nodes automatically, so I have multiple nodes going to the same instance. Active data guard gives me recoverability so I can clone something somewhere and then send that last bit of data over. If one region fails and I go into another one, partitioning makes everything faster because I cloud now, segment my data into smaller pieces to not look at all of it. Then they also have things called storage indexes, where they're building indexes on the fly and also putting things in memory on the fly. Don't want to write it yourself? Well, guess what? I could use Oracle analytics that's not free. Machine learning is free with autonomous database. But I could use Oracle analytics, and it's very graphical and very intuitive for the people that are using it. If you write it right, you could see all the different kind of graphs. It's not just a pie chart and a bar graph. I could do a tree map graph where I'm putting things to show different quarters. Obviously, my quarters are getting smaller. That's not good. Maybe, unless it's losses. There's also much more complex. Maybe I want to look quarter by quarter, but by customer group. And maybe the profit is the width and you can see different things. The size, the width of it is the profit, the color is the customer segment, and this is quarter by quarter. Or I could do it in other graphical ways, but I also can do machine learning with Oracle analytics. It's often called OAC, where I just say, you know what I know, I want a k, means I want to cluster some big data into age groups, separate into five groups, and do it by age. Very simple to do. So, a very intuitive way to do that. Oracle also has AI and machine learning built into things like manufacturing, financials and things like that. Also have IoT connections and chat bots as well, if you're interested. But we're moving into this future world that really is enabling innovation now. Why are we going so fast? Feel like things are getting faster? It's because there are, if you look at it, four bit was 16 bytes of addressable memory. Eight bit was 256, although they had extended, if you remember, bags around the original windows, 16 bit. Sixty four k. Thirty two bit came out around the Internet. Oh, we jumped to four gig. And what happened? We got the Internet. It was huge. And this is two to the fourth, two to the 8th, two to the 16th, two to the, now two to the 64th. 18 with 18 zeros, roughly 16 exabytes of data, and you got to do 1024 times 1024. That's why it comes out to 18 and 18 zeros. But think of the jump we're about to make with robots and AI with 64 bit coming into play. I put in miles an hour. We went to 16 bit. We went from mainframe basically to a pc. And if I call it 1 mile an hour, 16 to 32 is like going 65,000 miles an hour. We got the Internet. We went to 64 bit just recently. It's like going 300 trillion mile an hour. So if you feel like things are just going so fast, I can't believe it. We're getting to robotics, AI even we're about to jump to 128 and then I don't know, I would say the next three to five years, three to seven years, 5 trillion trillion billion miles an hour, it's going to be implants and things like that. But here come the robots. This is robots maybe we grew up with, we saw in movies. Real robots, though, are much more realistic. This is a twilight zone. I like this guy. Hey, Siri, why don't my relationships work out well? This is alexa service. Robots are already out know. Can I seat you at your table? Can I take you to your meeting? Can I check you in at the hotel? Can I show you what's on the menu? Oracle also has pepper the robot connected in can also connect in all the different things like Siri or SMS, WhatsApp, you name it. Oracle has a virtual assistant interface that I can use with pepper the robot as well to see what people are asking pepper the robot if, let's say pepper the robot is here at a conference like it was. Remember what rod emerging say the competition between man's mind and the product of man's mind. It was about robots. And it's the only time he ever said for this. They're standing room only in the twilight zone. Everybody is waiting to see what happens. We have Amika with gestures. Spot and atlas could dance and do somersaults. Tesla bot Elon Musk says will sell more than Tesla the car Sophia robot is a citizen of Saudi Arabia. Robots and automation what is the impact of jobs? Well, in some countries that have lower skilled jobs, it's a much higher impact. You can see the lower skilled jobs are much higher than higher skilled jobs, but all of them will be effective. And you can see the Amazon warehouse here. How do you make a difference? How do you lead the way? You leverage technology. That's what Amazon does. That's what Oracle does. That's what Microsoft does. Robots and automation impact the jobs are ready delivery. What about the talked about it earlier. Is autonomous database going to make me obsolete? So the twilight zone called the obsolete man we're seeing. We used to have pinsetters and ice cutters and street lamp writers. Do we really need that? Is it replacing the DBA or DevOps? No, of course not. 11% growth rate to 2026. Although that is the government telling you that I think the DBA is going to be more important or the data engineer or the DevOps person is going to be the most important person because they're going to find a way to leverage that data through virtual reality mixed reality. Augmented reality. What if somebody has Covid and they can't get to the store? Well, wouldn't it be nice if they could see those on the shelf? Or maybe if they had an iPad, they could do it there. So whether it's virtual reality or augmented reality on an iPad, there's ways to leverage this in your company. I find Apple a great tech innovator, I find Amazon a great retail innovator, I find Google a great marketing innovator, and they use Tensorflow to actually do basically image recognition. You saw the algorithm earlier, but Oracle's focus is really making you the innovator and building the technology for you. Although with the acquisition of Cerner, they're going to be much better at medical things and building applications where they can vet them out to make sure they're doing well. But Oracle has machine learning in the autonomous database, which I've mentioned many times here, also bought a company called Datascience.com, and they have it in all their applications. They also have it in Oracle analytics, cloud or OAC, rather. If you look at machine learning, it involves a lot of things we saw earlier, and there's also natural language processing, things like Chat GPT. And these start to give you AI, but there's all kinds of things that go with it. But the most important thing, I think, to remember is how can your business leverage it? Which piece of it can it leverage? If we look at Chat GPT, I mean, OpenAI, I remember a guy speaking who knew them very well, and he said, we came out of the first version of GPT, it was GPT one, then two, then three. Nobody ever noticed. Then when we did Chat GPT and it was four, we thought it wouldn't do any better than anything else, and it just took off notice. How long did it take to hit 100 million users? Google Translate, 78. I mean, it's something I use all the time. Pinterest, 41 months. TikTok, nine months. Chat GPT-2 months. Is it going to be big? Yes. Developed by OpenAI, I think leveraged most by Microsoft, but every data company will leverage OpenAI and things like Cohere and other AI that are out there. But basically, what is it? It's a large language model that has used algorithms, and you'll see a little bit more than algorithms to look at language. Here's Chat GPT. Once you sign up for it, it has dolly. Here's Chat GPT itself. I said, hey, what are the top ten database databases out there? Oracle is number one, but the data is only as of September 2021, came out in November. Notice GPT four, which passed three, take it back. 3.5 was the initial hit. And then four is even better because it includes images and words like Chat GPT. But I actually like Google barred leveraging alumina leveraging Gemini even better. Here's the top ten databases. And all this is slightly different, especially atp the bottom, because Google is looking at the most up to date information. Why did Chat GPT get so popular? And the answer was a transformer paper that found a way to feed back in the information. As I'm building a story, I say once upon a time and it starts to build the next word, it will find the next word, then it will feed that back in on the right side and then create the next, and so on and so forth. And then it keeps doing this over and over. But the most important thing compared to recurrent neural networks, GRU lstm the reason it's much more amazing, I'll say, is because the old algorithms we're using might be able to build you a story of 50 words. This can build you a story to build you a novel that's five inches thick. Could use Shakespeare, read all Shakespeare's works and then build the next one for today. If we wanted to do that, what are we searching for? Well, we're searching for what's known as a foundation model. So we're doing all kinds of tasks. Remember the business problem we have, then we use some algorithm and then we find some important information has a result of that. Maybe I want more sales, maybe I want more customers. They want to find out which are the good customers. But we're moving from machine learning to maybe deep learning, which looked at image recognition and I can even look at pattern recognition and things like that. But the foundation model is all those things you want to do for your given company. How do I do that? And Stanford says this will be what's next. And these are the many model way of doing things. Or I could build one foundation model which will learn from the different things called transfer, learning from different things. And Oracle is now partnered with Cohere, similar to OpenAI, it's basically generative AI, and they're doing it with healthcare because they bought a company called Cerner and they're going to build a lot of applications and that's going to make Oracle's tools even better. Something I should note here, though, when we're using things like chat, GPT and Bard and so on, is it also hallucinates. So what's a hallucination. A hallucination means they came up with a fact. Since it's generative AI, it generates something it thinks is right and it's not necessarily a fact. So you got to watch out for that as well. And the way you solve that to some degree and cohere does this specifically is you can go to your own data, which they'll keep private to give a better set and give you a better answer. The other thing Oracle came out with is the vector database for those in DevOps or DBA. Basically, I could build a house hunting app and know, here's my house, find me one that looks just like it, and it'll tell me in a vector how close they are based on all the different attributes that are out there. It will vectorize that house. How hard is it to do? Create a table or just make one a vector, put the photo in and then vectorize it. Then if I want to find a house, maybe I'm in California and I want to move to Texas. I'm just thinking of Oracle's headquarters. Recently. I could say I want something within my price range, something in the city, but give me a vector that's very similar to what I have now. I'm going to show you the house I want and get me one just like it, but somewhere else in this price range. So vector search, I showed all the different things Oracle does, JSON, relational image, spatial, et cetera. Now they have a vector database as well. Oracle's eight a stack. They have a digital assistant. They do speech recognition, language vision, anomaly detection, forecasting. But this generative AI is a big one. But you want to look to build your foundation model for your company. What pieces are there? Not necessarily what somebody should tell you, but what you know are the ones. I want to finish with some tech trends that Gartner has. So notice at the beginning, it's kind of this mass media hype starts to continue. You have a product, but guess what? There's no working products yet at this point. And first generation products, negative press, maybe some failures. Finally out here, less than 5% adoption, and finally out here, 30% adoption. So let's just look at the world of tech over the years. 2013. What was coming, coming was prescriptive analytics. Well, you know, it's here now because I just showed you how to do it. Internet of Things was coming. Big data was coming very close. Cloud computing still not even at 5%. Virtual reality, not at 5%. Predictive analytics was finally at 30%. Prescriptive analytics was coming. And notice the different shapes are different number of years, how long something will take. You could see quantum computing more than ten years. Don't go down, though. 2015, all of a sudden, it was all about robots coming. Human augmentation, brain computer interface we're working on, but it's going to take a long time. Connected home that's coming, and it's coming pretty fast. In five to ten years, you know it because it's already here to some degree, autonomous vehicles were coming. Virtual reality, finally at 5%. See how fast it's happening. 2016, all of a sudden, its implants are coming. Quantum computing still is going to take a while. You can see virtual personal assistant, brain computer interface. They're looking at more 2018, all about robotics. Quantum computing, first time ever now is coming very fast, and we're starting to see some of them. Brain computer interface not so far away that it used to be digital twin. I want to build. I'm the DBA or DevOps, and I want to build an autonomous one that does the work for me. 2020 hype. Augmented intelligence coming. Smart robots coming, but coming very fast. Machine learning in 2020 has not even at 5% yet. Chat bots were still not even at 5%. Gpus at 30%. That was just three years ago. And then the latest one I have is Gen AI coming fast. Quantum machine learning. Now I'm looking at. I do machine learning, but with quantum computers. So the final thoughts is the world is changing fast. Those who use things of the world should not become too attached, for the world is present form passing away. Boy, it seems to be passing away every month in a different way. Things that used to be popular. If I look at all the things that used to seem so advanced in Star Trek, all of them are either here or they're coming. Things may come to those who wait, but only things left by those who hustle. Are you hustling? It used to be the mainframe that was using digital wearing digital implanting. Digital has already started the hide mind, the Internet, leveraging it with things like chat, GPT already. And then I have Elon Musk, also with neuralink with it something that will be implanted in your brain so that you can access the Internet. Just thinking about it, I think a big thing is autonomous database giving you time enough atp last. So when I look at autonomous database, it does a lot of that work for you. So first of all, you want to leverage a robot for yourself, get an autonomous database. A robot may not look like one. Autonomous database can do that for you. We saw how fast we can build it. We saw how fast we get started, shut it down, add cpus if we wanted. We looked at the machine learning. We can access no charge with autonomous database and then the future ahead. With robotics. We make a living by what we get. We make a life by what we give. I think conf 42 gives a lot to you. Education is probably the best thing out there. And I certainly appreciate all that they do to make that. There are some books I've written in the past. Those are the two most latest. A few references, a little bit about me. I've done a few things. And if you want a copy of the notes, I want to thank you all for coming. I think anything you want to build is out there and ready. You just have to do it. Make a difference. Leverage technology. This is your time. You got to say, why did God put you hear at this point in time? It's got to be for a reason. But with AI, with machine learning, with autonomous database, you can make that impact. I'm looking forward to it. Bye now.", "words": [], "utterances": null, "confidence": 0.950183089390346, "audio_duration": 3188.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- This talk talks about autonomous database and how you can get Oracle to manage some of your databases in an expert manner. Things are coming very big in AI with Oracle, with the new vector database. For a DBA, it is time for workers to start to worry about AI.\n- Autonomous database spreads to online transaction processing. Also has autonomous data or active data guard that allows you if one there's an outage in a region. Free. Cloud oracle. com try it or cloud slash free and you create your first autonomous database.\n- Get started for free ATp oracle. com cloud slash free when I sign up. Your account automatically gets decommissioned. In the first 30 days you could try all these different things. You could do autonomous data warehouse autonomous transaction processing. Easy to use, free to try.\n- There's not just ATP and ADW, but there's also autonomous JSON database. There's also Apex, which is a front end application. Create and run notebooks in Oracle if you're not familiar with notebooks. What I think people really need now is predictive and prescriptive analytics.\n- Once I build an autonomous database, I could start to do machine learning. What is an algorithm? It's just math. Am I looking to classify data? Maybe I want to cluster big data into age groups, or maybe to look through customers to see any anomalies that are out there.\n- A machine learning notebook can be built in four minutes. It can try every algorithm for you, tell you the accuracy of that, and then it can say, create the notebook. What kind of machine learning algorithms are used in healthcare?\n- Oracle also has AI and machine learning built into things like manufacturing, financials and things like that. Also have IoT connections and chat bots as well, if you're interested. We're moving into this future world that really is enabling innovation now.\n- Robots and automation impact the jobs are ready delivery. Is autonomous database going to make me obsolete? How can your business leverage it? Which piece of it can it leverage?\n- Now they have a vector database as well. Oracle's eight a stack. They have a digital assistant. But this generative AI is a big one. You want to look to build your foundation model for your company.\n- Gartner: The world is changing fast. Those who use things of the world should not become too attached. Things may come to those who wait, but only things left by those who hustle.", "auto_highlights_result": {"status": "success", "results": [{"count": 8, "rank": 0.07, "text": "autonomous data", "timestamps": [{"start": 525144, "end": 525862}, {"start": 571064, "end": 572418}, {"start": 739168, "end": 739882}, {"start": 977816, "end": 978742}, {"start": 999968, "end": 1000702}, {"start": 1043286, "end": 1044202}, {"start": 1062116, "end": 1062942}, {"start": 1958244, "end": 1959134}]}, {"count": 26, "rank": 0.07, "text": "autonomous database", "timestamps": [{"start": 46876, "end": 48354}, {"start": 63848, "end": 65070}, {"start": 164148, "end": 165194}, {"start": 229210, "end": 230514}, {"start": 252304, "end": 253434}, {"start": 278332, "end": 279830}, {"start": 434732, "end": 436162}, {"start": 470472, "end": 471534}, {"start": 519510, "end": 520862}, {"start": 605748, "end": 606826}, {"start": 656676, "end": 657802}, {"start": 755412, "end": 756474}, {"start": 990976, "end": 992454}, {"start": 996816, "end": 998358}, {"start": 1178668, "end": 1180050}, {"start": 1523208, "end": 1524382}, {"start": 1600128, "end": 1601658}, {"start": 2008612, "end": 2010030}, {"start": 2341888, "end": 2342854}, {"start": 2436572, "end": 2437794}, {"start": 3089552, "end": 3090838}, {"start": 3096112, "end": 3097366}, {"start": 3104948, "end": 3105834}, {"start": 3108036, "end": 3109034}, {"start": 3121752, "end": 3123246}, {"start": 3182268, "end": 3183730}]}, {"count": 8, "rank": 0.07, "text": "different things", "timestamps": [{"start": 711348, "end": 712542}, {"start": 732172, "end": 732614}, {"start": 1145328, "end": 1145754}, {"start": 2051136, "end": 2051862}, {"start": 2249552, "end": 2251286}, {"start": 2714328, "end": 2714930}, {"start": 2716712, "end": 2717620}, {"start": 2834364, "end": 2834774}]}, {"count": 7, "rank": 0.07, "text": "autonomous data warehouse", "timestamps": [{"start": 525144, "end": 526466}, {"start": 739168, "end": 740486}, {"start": 977816, "end": 979266}, {"start": 999968, "end": 1001402}, {"start": 1043286, "end": 1044902}, {"start": 1062116, "end": 1063950}, {"start": 1958244, "end": 1959626}]}, {"count": 1, "rank": 0.07, "text": "autonomous JSON database", "timestamps": [{"start": 1192064, "end": 1194246}]}, {"count": 1, "rank": 0.07, "text": "different databases", "timestamps": [{"start": 336092, "end": 337350}]}, {"count": 1, "rank": 0.06, "text": "autonomous data warehouse row format", "timestamps": [{"start": 1043286, "end": 1046006}]}, {"count": 1, "rank": 0.06, "text": "database time", "timestamps": [{"start": 969048, "end": 970114}]}, {"count": 2, "rank": 0.06, "text": "more data", "timestamps": [{"start": 309892, "end": 310846}, {"start": 378572, "end": 379480}]}, {"count": 1, "rank": 0.06, "text": "more databases", "timestamps": [{"start": 508996, "end": 510110}]}, {"count": 1, "rank": 0.06, "text": "cluster things", "timestamps": [{"start": 1881436, "end": 1882182}]}, {"count": 8, "rank": 0.06, "text": "big data", "timestamps": [{"start": 395056, "end": 395610}, {"start": 733468, "end": 733942}, {"start": 1396902, "end": 1397402}, {"start": 1451248, "end": 1451866}, {"start": 1453264, "end": 1453802}, {"start": 1460548, "end": 1461022}, {"start": 2074152, "end": 2074926}, {"start": 2908020, "end": 2908590}]}, {"count": 1, "rank": 0.06, "text": "medical things", "timestamps": [{"start": 2428396, "end": 2429270}]}, {"count": 9, "rank": 0.06, "text": "data warehouse", "timestamps": [{"start": 78348, "end": 79106}, {"start": 525618, "end": 526466}, {"start": 739638, "end": 740486}, {"start": 978482, "end": 979266}, {"start": 982092, "end": 982786}, {"start": 1000458, "end": 1001402}, {"start": 1043958, "end": 1044902}, {"start": 1062698, "end": 1063950}, {"start": 1958922, "end": 1959626}]}, {"count": 9, "rank": 0.06, "text": "autonomous transaction processing", "timestamps": [{"start": 740518, "end": 743654}, {"start": 775048, "end": 777586}, {"start": 845280, "end": 847254}, {"start": 979932, "end": 981666}, {"start": 1012106, "end": 1013806}, {"start": 1035762, "end": 1037966}, {"start": 1046432, "end": 1048630}, {"start": 1069368, "end": 1071166}, {"start": 1276910, "end": 1278706}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}