{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/6c63ffaf-829c-4db7-a937-f9adaa3597e0", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["atyeti", "banks", "boosting", "by", "conf fourty two", "cuttingedge", "enhancing", "from", "giriprasad manoharan", "leveraging", "positives", "rates", "senior data engineer", "showcases", "stories", "techniques"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "fe94a82b-d80b-4777-b71a-a4fa4d68d971", "status": "completed", "error": null, "text": "Hello everyone. Myself, giddy Prasad Manoharan. I work for a company called Citibank Investment Banking side as a senior artificial intelligence data engineer. And here I'm going to talk about enhancing banking security with artificial intelligence. So here's the introduction of the banking security and AI. So table of contents enhancing banking security with hey, welcome to a pivotal exploration of how artificial intelligence is transforming the landscape of banking security. As a financial crowd becomes more sophisticated and frequent, the need for robust reduction and prevention systems becomes crucial. Today, we will speak about the innovative intersection of AI and data engineering that is setting new standards in fraud management. So, limitation of traditional fraud reduction systems traditional fraud reduction systems are often constrained by inadequate reduction rate of percentage coupled with high false positive rates of approximately 30 percentage. These limitations not only strain resources, but also compromise customer trust and financial integrity. So data engineering plays a crucial role in enhancing AI capabilities and enabling the development of sophisticated data pipelines. So these pipelines facilitate the real time processing and analysis of vast transactional data sets, achieving unprecedented processing speeds and accuracy beyond conventional methods. And although advanced feature engineering, we effectively reduce data dimensionality and transform it into a more refined format. This process significantly improves the quality of input data of our A models, resulting in enhanced reduction accuracy that reaches up to 90%. So improvement in a model accuracy. Our optimized AI models demonstrate significant advancements, resulting false positives by up to 25 percentage while maintaining high deduction sensitivities. These enhancements ensure more reliable and efficient fraud reduction systems. Model interpret interpretability and scalability. So this is very important for any A models, but in financial it is more crucial. So a models need to be interpretable and scalable, particularly in dynamic banking environments because of the security and the high level data is coming from the systems. So these qualities ensure that our system are transparent to regulatory bodies and adaptable to ever growing data volumes. So this is the main thing. So leading financial institutions have seen remarkable success with the integration of our AI driven systems. Case studies reveals reductions in fraud occurrences by 40 percentage and substantial improvement in operation efficiencies. So this is the case study which follows very fact for customer trust. So advanced fraud deduction systems are pivotal in enhancing customer trust by securing the financial environment with AI, we provide customers with accuracy that their assets are protected against increasingly sophisticated threats. As I mentioned earlier. So all the data sets which coming in investment banking side is more crucial, so, so that we want to prevent the data. So using AI techniques. So this is the most crucial thing that we can do, comprehensive guide and implementation. So our discussion today serves as a comprehensive guide for banking entities eager to implement cutting edge AI and data engineering techniques in their fraud direction systems. We have outlined essential strategies and implementation considerations, so here is our conclusion on future outlook. In conclusion, the integration of AI into banking security is not just a trend, but a necessity in today's digital age. Looking forward, the continued evaluation of AI techniques promises even more sophisticated and effective tools to combat financial fraud. So thank you so much for this opportunity. Hope you enjoyed my conversation. Thank you. Have a great day.", "words": [], "utterances": null, "confidence": 0.882442195121951, "audio_duration": 335.0, "webhook_status_code": null, "webhook_auth": false, "summary": "-  AI and data engineering is setting new standards in fraud management. Leading financial institutions have seen remarkable success with the integration of our AI driven systems. Integration of AI into banking security is not just a trend, but a necessity in today's digital age.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.1, "text": "traditional fraud reduction systems", "timestamps": [{"start": 86270, "end": 88554}, {"start": 89254, "end": 91006}]}, {"count": 1, "rank": 0.09, "text": "advanced fraud deduction systems", "timestamps": [{"start": 246232, "end": 248752}]}, {"count": 2, "rank": 0.08, "text": "AI techniques", "timestamps": [{"start": 276406, "end": 277470}, {"start": 320474, "end": 321426}]}, {"count": 1, "rank": 0.08, "text": "financial fraud", "timestamps": [{"start": 326296, "end": 327444}]}, {"count": 3, "rank": 0.08, "text": "data engineering", "timestamps": [{"start": 80384, "end": 81280}, {"start": 113214, "end": 113822}, {"start": 294286, "end": 294918}]}, {"count": 1, "rank": 0.08, "text": "AI capabilities", "timestamps": [{"start": 116166, "end": 117206}]}, {"count": 1, "rank": 0.08, "text": "enhanced reduction accuracy", "timestamps": [{"start": 157254, "end": 159374}]}, {"count": 5, "rank": 0.08, "text": "banking security", "timestamps": [{"start": 41780, "end": 42692}, {"start": 46860, "end": 47572}, {"start": 53540, "end": 54220}, {"start": 61760, "end": 62776}, {"start": 311098, "end": 312026}]}, {"count": 1, "rank": 0.07, "text": "vast transactional data sets", "timestamps": [{"start": 127030, "end": 128894}]}, {"count": 1, "rank": 0.07, "text": "data dimensionality", "timestamps": [{"start": 141830, "end": 143454}]}, {"count": 1, "rank": 0.07, "text": "inadequate reduction rate", "timestamps": [{"start": 93110, "end": 95302}]}, {"count": 1, "rank": 0.07, "text": "input data", "timestamps": [{"start": 152014, "end": 153886}]}, {"count": 1, "rank": 0.07, "text": "data volumes", "timestamps": [{"start": 219172, "end": 220052}]}, {"count": 1, "rank": 0.07, "text": "reductions", "timestamps": [{"start": 232924, "end": 233676}]}, {"count": 1, "rank": 0.07, "text": "prevention systems", "timestamps": [{"start": 71120, "end": 72072}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}