{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/ebd4a450-5117-4980-80ab-dd9f0789f711", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["altering", "automation", "because", "benefits", "break", "can", "conf fourty two", "deploying", "devops advocate", "easytouse", "env", "etc", "isnt", "process", "questions", "required", "resources", "tagging", "tim davis", "tools", "uses", "youre"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "d31df71f-5234-4b57-890b-cbe38e5c4fcf", "status": "completed", "error": null, "text": "Hey there. Tim Davis, DevOps advocate with M Zero and this is tag your it. So I am a DevOps advocate and what that means is that I get to create content and speak to people like yourself. I want to thank the comp 42 folks for having me. Really. I can't do my job if I can't help show up at conferences and teach people things. This isn't my first conf fourty two that I've gotten to talk at, so I'm really glad to be back. Before doing what I'm doing now, I kind of did the same thing for VMware and the cloud and developer advocacy team. And before that I was a pre sales se in the networking and security business unit. And before that I just did pretty much a bunch of infrastructure stuff. Everything from basic systems administration, infrastructure architecture. The overall arch of my career has been on the infrastructure side. Now these days I think it gives me a nice view into the DevOps space. I know a lot of folks tend to look more on the developer side of the house, but coming from the infrastructure side, especially getting into architecture, I learned that you're not just delivering infrastructure for the sake of infrastructure, you're delivering it for the application that runs the business. So I've made sure to always keep the application top of mind. That's always been kind of what I've been focused on in my job throughout history and up until now. So this is tagurit. We are talking about tagging. But really, what is tagging? I'm sure youre heard this before, I'm sure you've seen it. Anytime you've deployed a resource, I'm sure you have ignored it exactly as I have in the past as well. If we want to break it down as easily as possible, a tag is just a filter. It's a tiny piece of metadata that is attached to a cloud resource that can help you filter when you're searching for stuff. Now, there's lots of different reasons why you would want to have those filters set up, why you would be searching for certain resources in a certain way, but to just break it down easily. A tag is a filter. It's not going to affect how your infrastructure is deployed, it's not going to affect what's deploying on it. It's just a little thing that tells you what it is. You can find it in pretty much every major infrastructure platform these days. All of youre major clouds, all of your private clouds and everything like that. Pretty much everything has tags available. Now that doesn't mean that every single resource is taggable because there are certain types of resources that aren't, but most of the ones that you're probably using, if not all the ones you're probably using, are taggable resources so you can affix this information and that'll allow you to more easily find that. So why should you care? What do you have to gain from what seems like adding extra work to whatever you're already doing? Well, you're going to make your life easier by making their lives easier. Folks in finance who are trying to run reports, figuring out how much the developer teams are costing, how much the infrastructure teams are costing, how much application a costs. Are we spending too much money this month on databases? How much are all of those lambda functions that we're using all the time costing? What are these lambda functions that you keep talking about all the time? The finance folks? If you're utilizing tagging, it's a lot easier to run, more complex, easier to view, and better to understand financial reports so that everybody can make sure that you're not overspending, that there are certain teams that aren't going crazy with resources. It'll just overall put you in a better financial spot if you're able to youre easily run reports and categorize workloads into who's using it. What about security? From a security standpoint, what resources are deployed out there? Do we have certain resources that are connected to this insecure VPC that should be connected to this other VPC working with security to figure out what's out there, what it's talking to, what it's connected to, why it's out there, what it's running on. It can absolutely help you have an easier life simply because they're not just going to keep bugging you of, hey, what is this thing? What is it doing? If there's tags there, they can click on that resource, they can see exactly what's happening. Or if youre generating reports off of what's out there, they can quickly go through, filter that and see what's happening. Let's not forget, of course, though, the middle managers that are desperately trying to justify their existence, we always have to look out for the middle managers. Having all of these tags can help them run report after report after report to make sure that they can justify that they absolutely have to be here and that they are absolutely essential to the operations that we know that they are. Anyways, long story short, helping to be able to run faster reporting, answer questions faster, tell the finance folks what's running that's costing them money, the security folks, what's connected to what and what's talking to what and what it is. These are things that can absolutely help you have a better and easier time. So you like easy. You like the idea of this, but how you've already got so much stuff deployed out into the cloud, it seems like a big job. How do you go from having no tags to tagging everything and getting where youre want to be? It can definitely seem like it's a big task, but that's pretty much the same for all things DevOps. Getting organized is a big piece of this. A lot of folks think that DevOps is just, hey, I'm going to throw a tool in here like, oh, we have a CI CD pipeline now we're doing DevOps. And that's just not the case. DevOps is like the combination of people, process and tooling that kind of come together and help everybody be more successful. And that's the same thing here. You're not just throwing a tool at it to try to solve this problem. You have to get the people and the process on board and then you can use tooling to help solve this problem. Remember, DevOps is a marathon. It's not a sprint. Get it? Anyways, you're not going through and you're not going to be able to get to this crazy DevOps Nirvana in a day. It doesn't work that way. Going from what some say, legacy or just whatever you're doing today to become more efficient and more DevOps in the future, it's not something you can just snap your fingers and have done. It's all about baby steps now. That doesn't mean that youre going to take a million little steps and it's going to take you forever. It just means that you have to take one little step at a time and change one thing. So let's take today from today on, start tagging every single new resource that you have deployed into your environment. Just start right then. What that's going to do is that's going to make it so the backlog of resources that you already have deployed into your environment isn't going to get any bigger. So you'll be able to slowly work on that backlog and get caught up, but you won't be adding on new stuff and making that bigger and bigger because you're just tagging everything from now on. Now youre also have baby steps in how you're going to add your tagging. You're not just going to go through and I mean, maybe youre do start today and just tag everything of this is prod. This is a database. This has this installed on it. This is connected to this. This is high security. This is low security. Youre can absolutely start doing that. Make sure that you set a nice tagging structure first before you start doing that. But what about the backlog application rationalization and kind of figuring out what is deploying, why it's deployed, what it's running and everything like that? That's a big, big deal. A lot of companies don't necessarily know what all they have deployed. So figuring all that out, it can be a big, daunting task. You don't have to do it all at once. A lot of folks have like production resources split into one cloud or on one account and dev resources and QA. Why don't youre just take the baby steps? First of finding all your production resources, tagging them as environment for the key and then for the value as prod. Bam, all of youre prod stuff is tagged as prod. Do that for the dev, do that for the QA staging. However many different environment stages you have, just go and tag those with what they are. That's a great first step. Next step, maybe take all your web servers, tag those as all as web servers, or take all your databases, tag all those, kind of start moving inward of hey, what environment this is in? What is the main function? What is it running? The answer of what tags you should have and how many. The answer is always, it depends. We're engineers. That's how it works. So I can't tell you what your tagging structure will look like. I can't tell you the best way to do that. But really, just think about it one little step at a time. Change that people and process of from now on, let's tag everything and then you can go through and start working on the other stuff. But what about the tooling? You want to be lazy? You want to do it even easier because we all like to automate things and do stuff so that we don't have to do it again and we can go just do something else. Well, there's an answer for that. Automating tagging these days is pretty easy, especially if you're using infrastructure as code, like terraform. There's your from bridge crew, there's terra tag by m zero. If you're using AWS with terraform, there's the default tags that you can add straight into there. If youre using Pulumi, then you can add tags there. If you're in Azure, you can utilize Powershell, vMware. There's power Cli, all of these different tools that can help you automation the tagging process, not just from automating the deployments from now on, but also working through those backlogs. Go through and find all of those resources and update them and allow those tags to be added systematically. So we always want to make sure that we're making our lives easier by possibly having to do a little bit more today to get there. But future you is going to be really happy with you because now you don't have to get hassled for reports or answer a bunch of questions. You're now being able to provide all of this information a lot more easily so that you can go off and do a lot cooler things. Remember, work hard today to be super lazy tomorrow. That's the best way of going about it in my mind. I have no problem going out of my way today so that I don't have to do that again tomorrow or the next day or the next day. Just taking those repeatable processes and making your life easier. Utilizing this tiny little tag thing that you've been looking at or possibly avoiding up until now, you could end up saving yourself a ton of time. Feel free to reach out on Twitter at vtimd. That's probably the fastest way to get a hold of me because I'm on there wasting away constantly. But feel free to look up tagging. If you have questions or anything, feel free to let me know. And I appreciate you checking out the session. Have a great day.", "words": [], "utterances": null, "confidence": 0.961156886930985, "audio_duration": 807.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Tim Davis is a DevOps advocate with M Zero. The overall arch of his career has been on the infrastructure side. He says you're not just delivering infrastructure for the sake of infrastructure, you're delivering it for the application that runs the business.\n- A tag is a tiny piece of metadata that is attached to a cloud resource that can help you filter when you're searching for stuff. If you're utilizing tagging, it's a lot easier to run, more complex, easier to view, and better to understand financial reports. Getting organized is a big part of DevOps.\n- Automating tagging these days is pretty easy, especially if you're using infrastructure as code, like terraform. Utilizing this tiny little tag thing could end up saving yourself a ton of time. Remember, work hard today to be super lazy tomorrow.", "auto_highlights_result": {"status": "success", "results": [{"count": 2, "rank": 0.07, "text": "certain resources", "timestamps": [{"start": 217112, "end": 218286}, {"start": 352852, "end": 353706}]}, {"count": 2, "rank": 0.06, "text": "production resources", "timestamps": [{"start": 614024, "end": 615570}, {"start": 624328, "end": 625662}]}, {"count": 1, "rank": 0.06, "text": "infrastructure stuff", "timestamps": [{"start": 129388, "end": 130374}]}, {"count": 1, "rank": 0.06, "text": "taggable resources", "timestamps": [{"start": 263816, "end": 265070}]}, {"count": 1, "rank": 0.06, "text": "dev resources", "timestamps": [{"start": 619272, "end": 620046}]}, {"count": 1, "rank": 0.06, "text": "infrastructure architecture", "timestamps": [{"start": 132754, "end": 134390}]}, {"count": 1, "rank": 0.05, "text": "DevOps Nirvana", "timestamps": [{"start": 510980, "end": 512234}]}, {"count": 1, "rank": 0.05, "text": "financial reports", "timestamps": [{"start": 327004, "end": 328870}]}, {"count": 1, "rank": 0.05, "text": "terra tag", "timestamps": [{"start": 704378, "end": 704906}]}, {"count": 5, "rank": 0.05, "text": "things", "timestamps": [{"start": 109380, "end": 109902}, {"start": 432188, "end": 432374}, {"start": 463812, "end": 464062}, {"start": 688722, "end": 688934}, {"start": 760138, "end": 760720}]}, {"count": 1, "rank": 0.05, "text": "tiny little tag thing", "timestamps": [{"start": 779340, "end": 780662}]}, {"count": 8, "rank": 0.05, "text": "folks", "timestamps": [{"start": 102052, "end": 102314}, {"start": 147504, "end": 148170}, {"start": 291174, "end": 291654}, {"start": 317182, "end": 317534}, {"start": 424846, "end": 425470}, {"start": 428284, "end": 428674}, {"start": 468728, "end": 468974}, {"start": 612628, "end": 612922}]}, {"count": 1, "rank": 0.05, "text": "new stuff", "timestamps": [{"start": 564868, "end": 565682}]}, {"count": 1, "rank": 0.05, "text": "prod stuff", "timestamps": [{"start": 632012, "end": 632662}]}, {"count": 3, "rank": 0.04, "text": "baby steps", "timestamps": [{"start": 529436, "end": 530514}, {"start": 571752, "end": 572526}, {"start": 622488, "end": 623166}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}