{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/e9917097-b486-4066-b35a-45e4eb0b8c90", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["bb", "conf fourty two", "differences", "generations", "myths", "pawel zajaczkowski", "proving", "software development manager", "talks", "those", "tips", "xebia"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "91c99217-b477-4c91-9116-cf617b306dc8", "status": "completed", "error": null, "text": "Hi everyone, my name is Pablo. For a quick background, I used to be have a developer, but then I kind of moved to the dark side. And currently I'm taking care of several teams of developers and DevOps at CBapoland. And today I would like to tell you a story about generations and generational differences and how it all applies to our industry. Here's our plan. We'll start with some general information. So what's the concept around the generation? What are the different generations? What's the thing with differences? Is it all just mess or is it really true? I will give you some theories about that. And in the second act, we'll move to particular generations and we'll see about those differences. Also, a disclaimer. There are a lot of memes about generations. We have those boomers and those millennials that are barking at each other. So this is kind of mammical topic. So most of those memes are kind of offensive. I was trying to bash everyone equally. But be advised and just keep your distance or we will all die. For starters, let's look at movie, quick movie that will show you a difference in how people born in different decades would react to hitting themselves in a frame of the door. Let's look at that. Okay, we have some idea about this. All right, so let's move on to general information. What's the generation or demographic cohort? Do those differences even exist? Or they are just myths? And what are the theories about this? The idea of generation or demographic cohort is the ideas. We understand it. So boomers, millennials, those ideas, we know it is kind of connected with a western world. What is a western world? Well, it kind of changed over time. Like, for instance, Poland was initially in the eastern bloc and moved to the western bloc. In general, there's an idea that we can kind of segment the population to those cohorts that are roughly 20 years long. And the idea is that when we are young, when we are up to 20 years old, the events that take place, the technology that is currently developing that we are using shapes us. Of course, we can adapt at later ages to that, but mostly the impact is during the first 20 years of our life. You can find some references to early ideas, early topics around that. Up to 100 years ago, Karl Mannheim was working on that in Germany. You can find some sources dating back to 1952, 53, something like that, because that was when works of car were translated to English. And I can see some pictures here. So some, let's say milestones of in technology, but also global events might be wondering what's up with this boat there. So the idea is that the boat is kind of like a shotgun over the fireplace in the first act. If you see the shotgun over those fireplace in the first act, then you know that somewhere at the end of the story, somebody will take this shotgun and fire from this. So we will get to those boat and we will be proving at the end of our story. So stay with me. So, in order to be on the same page, what is the meaning of those particular generations? This is the image taken from Wikipedia. A little bit enhanced. On the right, you have ages of particular generation, right? So alphas are currently several years old. Then we have generation z, which is roughly ten to 26. We have millennials, which are 27, 26 to 42, more or less. We have generation x, which is 42 to 58. Baby boomers, 58 to 77. We have the silent generation, which is over 77 years old. By the way, disclaimer, don't be attached too much to those numbers because they vary depending on the source. Sometimes it's one, two, three, even five years into one or the other direction. So this is more or less the consensus, but it's not always very strict. So, regarding the geometry of this picture of this trapezoid, we have the date of birth. Then we are going to 18 years old, or starting the productive period, let's say. Then we are going roughly to 60, and then the shape is proving to 70. So the end of the productive period, of course, we would like to live out a little bit more than that. So in reality, there should be, say a tail at the end. But this is in general to give you more or less understanding of the timeframes of particular generations. So, to visualize how it looks in a population. So, for example, this is a population of Poland, probably would be something similar in the western countries. So we can see that we have this red peak of baby boomers just after the end of born, after the end of world War two. Then it's dropping into the x generation, then it's starting to rise again. We have older exes and younger millennials around the second baby boom, then it's dropping again. We have generation Z and generation Alpha. We would expect to rise again into the third baby boom. However, we have some changes currently in, say, approach to having children. Not many people want to have a lot of children, so it kind of flattened at the end. So how this relates to an article, technology industry. So here we have two examples. Start with a software house in Poland. We have a distribution of people. What's kind of striking is that most of them are generation Y. So millennials, roughly 80% are millennials. We have a little bit of generation z on the right, the green color, and we have a little bit of generation x on the left, the orange color. Then the second example is a software house, or rather consulting company from Netherlands. It looks similar, a little bit different. We have, say, the dominance of millennials, generation Y. We have a little bit of generation Z, but we have much more of generation X and just a few of boomers at the far left with the red color. The reason for that is that because the industry started a bit earlier, Netherlands, and also this particular company is more consulting. It's more on the consulting side. So they rather hire a little bit more senior people. So there is not too many people from generation Z. But just to give you a general overview, most of the people in it currently are millennials. Generation Y. What's the idea with those myths and facts? If you google for generational differences, you will get a lot of materials saying that, hey, boomers are like this, millennials are like this, you should do this or that in order to handle them. On the other hand, if you google for generational differences myths, then you will find a lot of articles saying that this is all bullshit. Everyone is equal. We shouldn't discriminate based on age or the generations. And now the question arises, which one is true? Probably the answer is something in between, right? If you look at the price from last several decades, you can see the pattern that the younger generation, which was the baby boomers, maybe in seventy s, then generation x, then millennials, generation z, this younger generation, agoistic, those mid generation, they want everything to themselves and don't have respect for their elders, et cetera. And it kind of repeats over time, right? Each younger generation is kind of treated like the same. If you look at some scientific papers, you can see a lot of articles on the generations, conflicts that arise like 3000 years ago, 2000 years ago, some ancient athens, some medieval times, France, in United States, in Africa, all over the place. So all over the place, those different generations kind of clashed against each other. We have this idea of generational narcissism. So we kind of assume that our generation is the best, right? Those younger are immature, they don't know how to live. They have no respect. Those older ones kind of stopped progress. It's difficult to talk to them. And we kind of in the middle. We are the best generation. You can see the quote that was found over 3000 years ago on the clay tablet. And also, if you read little bit of research, especially over 20 or 30 years. You can notice that usually we have four generations on the work market. And it's usually divided into two halves. We have two younger generations and we have two older generations. Those younger generations are immature. They don't know their life, they have no respect. Older one are kind of like the last adult generation. So usually the younger generation from those two oldest. So currently it would be the x generations are described as those last adult generation currently research. But if you look like 20 years ago or something like that, the baby boomers were the last adult generation and the exes were those still immature and generation without respect for their elders. So it is kind of shifting. The perception of generation is shifting with time. To make matters more complicated, it changed as we age, right? So our personality, based on, let's say, the genetic lottery, what kinds of genes we get, what is our neural system, and also how we were raised for the first 20 years, say the most forming factor. So most of our personality forms up to 20 years ago, 20 years old. However, over the next roughly 30 years or something like that, from 20 to 50, there are also some changes. So as we age, we get more conscientiousness, so more orderly. We have those life figure out more or less. Let's say we are more agreeable, so it's a bit easier to negotiate with us. Maybe we are even getting a little bit of naive if we speak about older people. On the other hand, our openness is going down. So we have our schemes, our approach to doing things, and we are not that open to new experiences. Our extraversion usually goes down, right? So if you are 20 years old, going for a pub crowd is a great idea. If you are 40, maybe you should get a little bit more sleep or something like this. Also, our neuroticism goes down. Neuroticism is the measure of how uncertain you are about the external words, how afraid you are, what is the level of your emotions, strong emotions, stuff like this. So as we age in general, we are tending to get more stable. So our neuroticism goes down. We can say that, we can describe it that with age, just stop to care that much about what others think about this. And it's kind of healthy to an extent, of course. And to make things even more complicated, there are other factors at play. So international differences is one thing, but also we have cultural differences. So depending on where you were born, whether it was United States, Germany, Japan, Poland, anything else, you have a different baseline of behavior. And those cultures differ in many dimensions. And probably the most important thing is individual difference. Right? So we have this personal preferences, how your nervous system was formed over the first 20 years of your life. And those is the most important factor. And just somewhere in the background over those two, we have also general differences that have some statistical impact. But you know how it is with statistics. If I go for a talks with my dog, statistically we have those legs. So use it a little bit. No, the idea is that the whole point of this chapter is that there are some statistical generational differences, but we have to use it with caution. Right. Don't use it as a hammer labeled millennial or boomer and just use it on everyone. In the same way. I think it should be rather used as a delicate tool in your people skills arsenal just to have this understanding that there are some differences, but don't rely too much on them. Let's move on the second act of our story. So we talk a little bit about our particular generations and how to deal with them. General. So we start as a framing device. We start with the silent generation. So those are people who are currently over 77 years old. So probably you won't put as many of them as in our industry. They are mostly retired by now, with some exception. Old ceos or some people in corporation don't just stay there forever. Wouldn't like to focus too much on them just as a framing device. But I would like to give you some examples from our industry. So we have Sir Gordon Moore. So the famous Moore's law about the power of processors growing over time. And also co founder of intel. We have Margaret Hamilton, who was writing a software for Apollo spacecraft and also did a lot of research papers. We have Donald notes, who is called the father of algorithm analysis. He's still writing this book about the art of computer programming started somewhere in the 60s. We have Barbara Liskov. So from this name we have Liskov substitution principle, the solid acronym. But she also had a lot of contribution to the scientific field of computer science. We have Alan Kay, who is known for working on the first graphical user interfaces even before Microsoft and Google and decided to borrow them. And also he is the inventor of the small talk language. We have Brian Kerrigan and Ken Thompson, who worked on Unix, wrote the first book about C C language. Ken Thompson is also an author of Go language. And we have Larry Ellison, who is one of the founders of the Oracle Corporation. So those are all people from the silent generation and move on to the baby boomers. So baby boomers born just after the World War II. So currently age between roughly 58 77. We can kind of call them the analog generation. So when they were starting to work, we were using pen and paper, not computers. But of course, over time they migrated to digital technology as well. Some differences for baby boomers. So we had a cold war in the full swing. So we never knew if you wouldn't be obliterated by the atomic bomb blast. At some points, we had the landing on the moon. Technology wise, the television started to be widespread, maybe more in western countries, not necessarily in Poland in particular. In eastern countries, on the other hand, we have this growing communism with the Cold War. If you ask Americans, they would probably say that assassination of JFK was kind of the event that impacted their life. And computers are basically just starting to be used, right? So they are rather used by scientists in white coats, not really in mainstream business yet. So what's the approach to baby boomers? So baby boomers kind of like the face to face conversations. They have the high power distance, meaning that if you have some formal title, such as manager, maybe even a doctor, you are being granted the respect out of the box value structure, hierarchy, loyalty. Often they worked their whole life or a large portion of their life in a single company. They also value hard skills, right? So what you can do technically what you are skilled at, not necessarily soft skills. So how smoothly you can talk and stuff like this. If you want to make them happy, you can put them in some formal position of power. So give them some formal title, such as senior just manager, et cetera, and give them some opportunity to mentor younger colleagues and show them the business and stuff like this. Some example of baby boomers. In it we have Biann Strozrop, the author of C Plus plus, we have Steve Wozniak. From Apple, we have James Gosling, the author of Java language, Bill Gates. From Microsoft, we have Guido von Rosso, the author of Python language, Tim Cook. And from Apple, we have Anders Heidezberg, who is the author of C Sharp language. And we have Jeff Bezos, the bookseller and also the virtual machine seller Amazon. So let's move on to our next generation, X generation, born after 65, so currently roughly 42 to 50 air, 58 years old. The name came from the unknown. X is the unknown. So world was changing quite fast, new technology. We didn't really know how this generation will turn out. There was a book, the X generation. There was a song, the X Generation, and kind of somehow stuck. We can also call them digital immigrants. So it's often the case that when they were young, the world was more analog. So pen and paper. And only after some 20 years or something, they started to use computers, or maybe not even yet computers, but let's say more of an electronics and digital world. Sometimes they are called latchkey keys. So because of the social changes, parents tend to work a bit longer. And those were more divorces. So there were more single parents. And often children have to come back to an empty house. So they had those key around at their neck, and they have to open the doors themselves. In those United States, you can sometimes see the name, the MTV generation and the current research, you can see the name that they are the last adult generations. Those generation younger are still not adult yet. This is about generation. The idea about generations X. What were the influences of Generation X? So, in Poland, we had the martial law in 1981. In general, the dissolution of Soviet Union at the end of the Cold War, the disaster in Chernobyl, 1986. Most influence on the Eastern Europe. They have some first computers, like Commodore, Atari, Amiga, stuff like this. Pop culture is coming to Eastern Europe, the western culture regarding cell phones, it's still rather a thing of. Maybe some executives or directors are using those brick like phones that we have here. I saw the walkman that was quite popular at those times. So how to deal with Generation X then? So exers tend to be very autonomous, right? Sometimes it's connected with the statistical upbringing. Like if they needed to get back alone to home, they kind of develop those sense of autonomy. So they want to do stuff on their own, not necessarily with the team or other people. They're quite focused on results. So they want to know where they are currently, where they are going, how fast, what are the tools at their disposal, and kind of have the ability to measure the progress. They still kind of feel this authority to people that I hire in the hierarchy, but not as strong as baby boomers. They still like a little bit of. To have a little bit of rules and procedures around that. They're quite focused on the career. So often they say that, hey, I'm a manager, I'm a software developer, not that I'm a pava or John or any other person. So they are kind of prone to burnout, like if you are a manager or team leader or just a good colleague, it's good to look for those symptoms if they are not really working too much, too hard on the path to burnout. So be careful with that. Some examples from our industry. We have Michael Dell, the producer of computers and hardware. We have Satya modela from Microsoft. Currently we have Rasmus Lerdorf, who is the author of PHP language, Linus Torvald. So first, Linux and Git, we have John Carmack from the gaming industry, Quake of Stein, doom, stuff like this. We have Elon Musk, let's say, from Tesla and SpaceX, and currently being a great manager, or Twitter or X, or however it is called. Now we have Larry Page from Google, or Alphabet rather. And we have Jack Dorsey, who is actually the founder of Twitter. All right, so let's move to our millennial Austin, born after more or less 1981. So currently 27 to 42, more or less years old. Why the name? Why? Kind of stems from the fact that millennials like to know why they do things like those. It's not enough to tell them to do things. They need to know the reason. And it's better be some sensible reason. Sometimes they are called 90s kids. Disclaimer here, 90 skits is not about being born in the SE, it's about being kid in the. If somebody was born in 1999 and says that he or she's a 90s kids, you can a little bit frown upon this. Milayas are also sometimes called digital natives. So usually computers were quite widespread when they were children. Computers, but not really on Internet or online presence. So they are a little bit more used to technology and to the digital stuff. What are some other influences? So we have the first Internet when millennials were young or in their teens. So we have this great example of dialing attempt with a modern. We have a globalization in full swing. So more countries are joining NATO and European Union in general. The cold war is over and war seems to be quite at peace. We have this 30 years of globalization and global peace, which is currently going maybe to an end because the situation is quite not very stable at the moment. But while millennials were young, it was very peaceful. We have some first social networks on Facebook. Gigi was a communicator, those messenger in Poland specifically, we have some first really accessible smartphones that were really kind of more interesting than whatever we have now. Smartphone is basically the same as another. If you ask Americans about some experiences of that time, we'll probably hear about 911. This is kind of like a point between millennials and Generation Z, because the oldest Z generations, people from Z generations were around four years old when 911 happened. So they usually don't remember that. If you remember what you were doing at this time, you are millennial or older generation, some other electronics. So we have a discount here. Computers are quite popular, as I mentioned. And the economic crisis was also after 2008, 2009 had quite a lot of impact on lives of many millennials, especially when they were starting to look for a job. It was not that easy back then. So how to deal with millennials? So millennials are probably the most educated generation so far. For instance, in Poland in 1990, there was 300,000 students, but just 15 years later, there was over 2 million. So millennials like technology. There's this term, helicopter parents. So often it was the case that parents of millennials were helping, going into the chopper, getting the chopper into the helicopter, flying to their chill, to help them in some difficult situations. So millennials are maybe statistically not that autonomous as the X generation. They like to work in teams. There are also the first generation who really appreciated the life work balance. So they are not really working to work, just to life. And it's good to have some life besides work. So they are not that keen to do overtime compared to excess. Again, on average, they have much lower power distance. Right. So my boss is rather my body. Not necessarily very formal approach. And they're generally more flexible than an earlier generation, more geared toward teamwork. They like to spend some time on their personal brands. It's often the case that they are freelancers, because it gives them more flexibility to work at whatever hours they want. For instance, they are more open to changes, they are more direct and general, more open to new experiences. Some examples of influential known people from millennial generation in technology so we have Ryan Dal, who is the author of Node Js. We have Zankimik, who is the founder of TikTok. Daniel actor, the founder of Spotify. Mark Zuckerberg, probably most well known person here from Facebook. Mela Iparkis from Canva, those designer software, Patrick Collison from Stripe, Whitney Wolfhardt from Tinder and Bumble, and Yvonne Spiegel from Snapchat, so we can move on to our next generation. Traditional Z is mostly just entering the work market, at least older of them. They are between ten and 26 years old, sometimes not very creatively known as post millennials. Snowflakes, that's the term from sometimes can be attributed to like a snowflake server in it. So every server has a different configuration. Also every member of those nation, those unique individual are different. Sometimes called zoomers, the playworth of boomers, three c's. So connect, communicate, change, and we can call them the online natives, because the Internet and those online world was there since the beginning, since they were born. They are used to be online. They are used to is that everything is basically to be found in the Internet, some influences, right? So probably the greatest influence for generation Z was the Covid-19 pandemic. So there was those remote schooling, maybe finding the first job remotely. The world kind of has shifted around generations that are used to having this technology at the fingertips of smartphones. With all those access to all the knowledge of humanity. Basically we are kind of nearing those end of 30 years peace period right after the end of Cold War. So currently the geopolitics is getting tricky. We have some contenders for the world order as we had after the World War II. And times are not very stable. We have some next social network. So Snapchat, basically, when I was doing this presentation, when I was doing some research, I found out that Snapchat is no longer, let's say no longer those newest social network, and it's still stuck on a Facebook level. So TikTok is more. Also, what's important for generations is that they are more focused on environment, more environment conscious. So we see that over our previous decades, basically what happened is that the climate was changed, right? We have this extreme weather phenomena. Currently, the current generation is more aware of that. It's kind of important matter for them compared to some earlier generation. Of course, again, on average, statistically, we have a great polarization currently, political polarization. So we have those people to simplify, people on the left, on the right. And it's even more difficult to talk between those two groups compared to years ago. And it's even more fueled by social media because there's controversy. If there are different bubbles, there's a lot of discussion, a lot of hate speech, et cetera, generates a lot of traffic and ads like that. So it's not helping us. It's getting difficult. And we have technology that starts resembling magic, basically, especially after, especially last one or two years with the advances in AI, it's a kind of different world. So how to deal with Generation Z then? So Generation Z is even more educated than the previous generation. We have a lot of knowledge at our fingertips because basically whatever you want to learn, if it's a front end framework or how to cook some meal or how to do your tie, you can find a tutorial on YouTube somewhere there. So just need to look and grab for that. Generations Z is used to globalization and diversity. So they have friends all over those place, basically online, different countries, people are different. And it's kind of natural for them. They're very individual. They have a very different approach to different things as compared to previous generation. As of workplace, the workplace is no longer some subplace where you have to go to make money. It can be fun. You can cheer in there. It's kind of more civilized. Also, generation Z kind of looks for the greater cost in their work. So basically, if the company is doing something else besides earning money, like takes care of the environment or some local communities, et cetera, it's more attractive for generation Z. Some kind of gamification at work or in the recruitment process might be helpful. Generation Z is also even more entrepreneurial than previous generation because they have a lot of tools to monetize, right? They are used to social media. You can create some content, get those money from that. If you have some hobbu where you're buying some not very typical stuff, maybe some paintings, some figures, stuff like this. Maybe you can set up a small shop and sell some access that you have. It's quite easy right now. For generation Z, the quick feedback loop is important. Again, probably it might be something connected with social media where you write something and then you get some reactions and comments. So if you are a team leader or a boss, you shouldn't be waiting one year to give any feedback to number of generations. It should be shorter, quicker, some appreciation, like just even liking some message on work teams or stuff like this, it's helpful. And for Gen Z, the hierarchy flattens even more. So if you are a formal boss, well, it has some meaning, but not a lot of meaning. In fact, you have to earn your respect to be respected by Gen Z. It's not just a formal title, formal hierarchy. And you might expect that I will give you another eight people from the next generation that were influential. I was trying to find them, but it seems that it's just a little bit too early. There's a lot of Gen Z people that are running some very successful startups. They are just not that big. So that we know which one of them, we really have some kind of impact on our world. So maybe when I will be doing this presentation in five years, ten years, then we'll see. I hope I will be adding some people here. And our last generation, I won't be focusing on them too much because they are just few years old. Don't know yet how they will approach the work. They might just assume that, hey, they can install some application on a smartphone, because before they are able to walk or something. So it's going to be tricky. We still have several years to prepare our workplaces for the generation alpha. We'll see. I promised you a boat that will be rolling a boat presentation. So here we are as a boat. Let's do an experiment in mind. Experiment with different generations. How different generations would approach being told to roll the boat. So let's start with boomers. We have a captain. We have a crew of boomers. The captain says, start proving. And the boomers would say, okay, boss, this is enough. If you take the X generation, we have the X. We have those, captain, we have the X crew. The captain says, let's roll. The crew might say, hey, wait, captain, what's our target? Where are we going? What's our speed? Do we have a device to measure our speed? What's those direction? How fast should we go? What's the deadline? So how fast should we rowing? If they get this information, it will be much easier if they have this control and those sense of target. Let's move to millennials. Let's assume that we have this millennial screw. The captain says, we are rowing. Millennial would say, hey, hold on, captain. Those is an engine on this boat, right? So why should we roll manually? If we can just start the engine and get some rest, right? So perhaps the captain would then say, okay, we are in some kind of special ecologic zone. There are different type of animals. We need to keep silent. We cannot use engine area like masurian lakes in Poland, for instance. You have to use those if there is no wind on your boat. And, well, it makes sense. From Milan, they know the reason why we should do this, in order not to disturb some wild animals. All right, then we can roll in silence. Okay, and what about Generation Z? So basically, let's say the captain says we are rowing. And what would those Gen Z member say? Hey, what are we proving towards the right island? Is the island called profit the right target? Maybe we should also visit some other islands, like environment or local communities or some other just causes. And this is something that would make Generation Z more happy, not just earning money for the company. All right, so those is our trip in a boat. So in the end, I was telling you about different stuff that different generations, let's say, put emphasis on, right? Some of them likes this, some of them like that. But in the end, if you look at this, basically all of us need some kind of stability in the company. We want to have some leader that knows the direction. We like to be a little bit independent. We like to see the result of our work. We don't want to spend the whole life at job. We want to have some private life. We enjoy some kinds of. A little bit of flexibility. We are a little bit individualistic. It's nice to have good atmosphere in the job, to get some feedback, to have this feeling that we are doing some greater good, not just earning money and of course getting respect from others. So basically all of those things is important for all of the members of different generation, maybe with a little bit of different emphasis. So we can look at this tale about generation, but this is basically like a story of evolution of our. Those slide was blurred on purpose. Don't worry. It's from the book reinventing organizations by Frederick Lalou, who is describing, let's say, different types of organizations, how they evolve over time. And most of those types evolved over not that many, like last hundred years. Many organizations are at different levels, and we can see that those organizations put different emphasis on different stuff. And those different generations kind of invented some parts of our workplace for us. And currently you can take advantage of all of that. All right, so we are nearing to an end, so called those last slide. So this QR code actually leads to my LinkedIn profile. You're very welcome to join my network. I'm inviting you, if you like to have some. Excuse me about that. If you want to add some notes from this lecture or you would like to look at the slides again or some recording from different instances of this talk, I have it all on my blog, which is called how to train your Java. It's not about Java anymore, don't worry. It's mostly about general software and people work. If you'd like to reach me in private, ask some questions, you are very welcome to do so. Take care of yourself, take care of people around you, and thank you very much for your time. Thanks.", "words": [], "utterances": null, "confidence": 0.929313895582327, "audio_duration": 2453.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Pablo: I would like to tell you a story about generations and generational differences. In the second act, we'll move to particular generations and we'll see about those differences. A disclaimer: Most of those memes are kind of offensive. But be advised and just keep your distance or we will all die.\n- The idea of generation or demographic cohort is the ideas. When we are young, when we are up to 20 years old, the events that take place, the technology that is currently developing that we are using shapes us. Do those differences even exist? Or are they just myths?\n- The ages of particular generations vary depending on the source. This is more or less the consensus, but it's not always very strict. To visualize how it looks in a population, look at a population of Poland.\n- There are myths and facts about generational differences. The perception of generation is shifting with time. Our personality has changed as we age. We shouldn't discriminate based on age or the generations.\n- We talk a little bit about our particular generations and how to deal with them. We start with the silent generation and move on to the baby boomers. If you want to make them happy, you can put them in some formal position of power.\n- Next generation, X generation, born after 65, currently roughly 42 to 50 air, 58 years old. Generation X tend to be very autonomous. They are prone to burnout, so be careful with them.\n-  millennials like to know why they do things like those. Sometimes they are called 90s kids. They are more flexible than an earlier generation, more geared toward teamwork. How to deal with millennials?\n- Traditional Z is mostly just entering the work market, at least older of them. Generation Z is more educated than the previous generation. They are more focused on environment, more environment conscious. Some kind of gamification at work or in the recruitment process might be helpful.\n- Experiment with different generations. How different generations would approach being told to roll the boat. All of us need some kind of stability in the company. Different generations put emphasis on different things.\n- All right, so we are nearing to an end, so called those last slide. QR code actually leads to my LinkedIn profile. You're very welcome to join my network. If you'd like to reach me in private, ask some questions, you are very welcome.", "auto_highlights_result": {"status": "success", "results": [{"count": 6, "rank": 0.08, "text": "different generations", "timestamps": [{"start": 50528, "end": 51446}, {"start": 547984, "end": 549046}, {"start": 2149168, "end": 2149990}, {"start": 2150288, "end": 2151254}, {"start": 2298464, "end": 2299558}, {"start": 2390576, "end": 2392166}]}, {"count": 4, "rank": 0.07, "text": "particular generations", "timestamps": [{"start": 61412, "end": 62650}, {"start": 239564, "end": 240822}, {"start": 321752, "end": 323250}, {"start": 847776, "end": 849158}]}, {"count": 1, "rank": 0.07, "text": "millennial generation", "timestamps": [{"start": 1677240, "end": 1678430}]}, {"count": 3, "rank": 0.07, "text": "previous generation", "timestamps": [{"start": 1923864, "end": 1924702}, {"start": 1963684, "end": 1964850}, {"start": 2008612, "end": 2009562}]}, {"count": 21, "rank": 0.05, "text": "little bit", "timestamps": [{"start": 243264, "end": 243674}, {"start": 310788, "end": 311182}, {"start": 403028, "end": 403534}, {"start": 408468, "end": 408846}, {"start": 420424, "end": 420834}, {"start": 427224, "end": 427678}, {"start": 449328, "end": 449850}, {"start": 581644, "end": 582246}, {"start": 692304, "end": 692666}, {"start": 716504, "end": 716914}, {"start": 810724, "end": 811406}, {"start": 846384, "end": 846874}, {"start": 1324424, "end": 1324786}, {"start": 1325384, "end": 1325746}, {"start": 1446768, "end": 1447434}, {"start": 1463780, "end": 1464370}, {"start": 2086204, "end": 2086566}, {"start": 2314964, "end": 2315338}, {"start": 2325464, "end": 2325778}, {"start": 2327468, "end": 2327766}, {"start": 2347184, "end": 2347626}]}, {"count": 2, "rank": 0.05, "text": "different stuff", "timestamps": [{"start": 2296944, "end": 2297930}, {"start": 2386588, "end": 2387490}]}, {"count": 1, "rank": 0.05, "text": "older people", "timestamps": [{"start": 694480, "end": 695466}]}, {"count": 1, "rank": 0.05, "text": "different world", "timestamps": [{"start": 1916872, "end": 1917682}]}, {"count": 1, "rank": 0.05, "text": "several years old", "timestamps": [{"start": 250880, "end": 252010}]}, {"count": 1, "rank": 0.05, "text": "other people", "timestamps": [{"start": 1299968, "end": 1300826}]}, {"count": 1, "rank": 0.05, "text": "different things", "timestamps": [{"start": 1961412, "end": 1962320}]}, {"count": 2, "rank": 0.05, "text": "different emphasis", "timestamps": [{"start": 2347808, "end": 2349302}, {"start": 2384828, "end": 2386354}]}, {"count": 1, "rank": 0.05, "text": "millennial or older generation", "timestamps": [{"start": 1551476, "end": 1553790}]}, {"count": 1, "rank": 0.05, "text": "different type", "timestamps": [{"start": 2228188, "end": 2228614}]}, {"count": 1, "rank": 0.05, "text": "different decades", "timestamps": [{"start": 97312, "end": 98182}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}