{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/fea3deec-7ea1-4616-9cc4-fba18429acdb", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["ankit gupta", "applications", "build", "by", "can", "component", "components", "conf fourty two", "conflict", "consistent", "creating", "developers", "founding member", "from", "improves", "intelekt ai", "isolates", "maintainability", "reduces", "reusable", "unlocking", "using"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "c891ba7d-b805-4027-bb92-ffc2da4526ee", "status": "completed", "error": null, "text": "Hi, I'm Ankit and I have close to four years of experience in web development. Today we are going to talk about unlocking the power of Shadow Dom. So let's get started. So here's what we are using to cover. We'll start with what is Shadow Dom? What are the different types of Shadow Dom? Real world examples of Shadow Dom in action. How you can implement Shadow Dom in popular web developers frameworks like React and angular. Then we are going to end with a hands on demo to put it all together. So what is Shadowdom? In simple terms, it is a fundamental web technology that helps you encapsulate your web components and styles, making them immune to global scope. Think of it as a protective shell around your components, ensuring that your code won't interfere with or be interfered by other parts of your web application. Shadow Dom comes in two flavors, open and closed. The distinction between them is how much they expose the outside world. Open Shadow Dom allows you to style your components from the outside. To create an open shadow dom you can use this code, whereas the closed shadow Dom keeps everything hidden away from the global style. To create a closed shadow dom you can use this code. Shadow Dom has been embraced by some of the most popular web applications including YouTube, Google Maps and even material UI. YouTube utilizes shadow Dom for its video player, ensuring that your custom styles don't break the player's layout. Google Maps uses Shadow Dom to encapsulate the maps component, providing a seamless integration experience. You can also use shadow Dom in all popular frameworks like React, angular or just simple web components. Here you can see to use Shadow Dom in react, we use the attached shadow function on the reference of a JSX element. Shadow Dom is at the core of angular's component encapsulation. You can see that we can add can encapsulation property in the component directive of any angular component. You can also create shadow DOm and simple web components using the attached shadow function. Now comes the fun part. Let's look at shadow Dom in action. Here you can see we have created a simple web page. Here we have a tag that says custom button in the script. We have reference to this custom button element using the query selector. Then we are creating a shadow dom using the attach shadow function. Note that the mode is closed. That means other components cannot access this shadow Dom. We are also creating a style for our button. Then we are attaching the styles to the shadow Dom. Then we are creating a button using the create element and we are naming the button unlocking. Then we are attaching the button to the shadow dot here you can see the output. Now since this is closed, if I just add in a style on the button and say background color equals to green and save it, you can see that no changes occur. Now if I just change this mode to open then also this doesn't work. This is normal in shadow Dom because how shadow Dom works is it creates encapsulation, right? So to access the open shadow Dom what we can do is we have to create a script tag and then we'll just type in document getelement by Id. Then we have our custom button shadowboot queryselector. Then we will select the button style. Then here we can change the background, choose the background color and set it to green. Now you can see the color of the button has changed. Now if I just change this mode open to close and save it, you can see that the color is reverted back to blue. If I check console, you can see that cannot read properties of null. That means the shadow Dom is not accessible. Now if we just go to elements and expand this custom button, you'll see a shadow root and in bracket you can see closed. This means the shadow Dom is there, but it's not accessible by the other components. You can see all the styles as well as the button here, but it is not accessible. So if we change this to open and save, you can see that the color of the button changed and the shadow root is now again changed to open. You can still see the styles and modify it using the JavaScript functions. So this is how you can use shadow Dom in your web applications. You can scan this QR code to connect to me on LinkedIn and also access the port. Thank you for joining in.", "words": [], "utterances": null, "confidence": 0.928967891414142, "audio_duration": 334.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Shadowdom is a fundamental web technology that helps you encapsulate your web components and styles, making them immune to global scope. It has been embraced by some of the most popular web applications including YouTube, Google Maps and even material UI. How you can implement Shadow Dom in popular web developers frameworks like React and angular.", "auto_highlights_result": {"status": "success", "results": [{"count": 27, "rank": 0.13, "text": "shadow Dom", "timestamps": [{"start": 31778, "end": 32552}, {"start": 37362, "end": 38168}, {"start": 39618, "end": 40456}, {"start": 42178, "end": 42776}, {"start": 44812, "end": 45436}, {"start": 74220, "end": 75124}, {"start": 82450, "end": 83096}, {"start": 87202, "end": 87816}, {"start": 90808, "end": 91384}, {"start": 95244, "end": 95756}, {"start": 97460, "end": 98364}, {"start": 106912, "end": 107456}, {"start": 113792, "end": 114464}, {"start": 121022, "end": 121684}, {"start": 128718, "end": 129256}, {"start": 135840, "end": 136744}, {"start": 149030, "end": 149756}, {"start": 156202, "end": 156816}, {"start": 173102, "end": 173764}, {"start": 181970, "end": 183180}, {"start": 190338, "end": 191420}, {"start": 226862, "end": 227620}, {"start": 228462, "end": 229124}, {"start": 233922, "end": 234584}, {"start": 284322, "end": 285064}, {"start": 295798, "end": 296396}, {"start": 325866, "end": 326576}]}, {"count": 3, "rank": 0.12, "text": "Open Shadow Dom", "timestamps": [{"start": 81920, "end": 83096}, {"start": 86978, "end": 87816}, {"start": 233682, "end": 234584}]}, {"count": 2, "rank": 0.1, "text": "simple web components", "timestamps": [{"start": 125310, "end": 126820}, {"start": 150022, "end": 151436}]}, {"count": 1, "rank": 0.09, "text": "can encapsulation property", "timestamps": [{"start": 141986, "end": 144224}]}, {"count": 4, "rank": 0.09, "text": "custom button", "timestamps": [{"start": 163610, "end": 164532}, {"start": 167406, "end": 168072}, {"start": 244726, "end": 245810}, {"start": 290018, "end": 290572}]}, {"count": 1, "rank": 0.08, "text": "popular web developers", "timestamps": [{"start": 45638, "end": 46764}]}, {"count": 1, "rank": 0.08, "text": "how shadow Dom works", "timestamps": [{"start": 228174, "end": 229384}]}, {"count": 2, "rank": 0.08, "text": "other components", "timestamps": [{"start": 179442, "end": 180456}, {"start": 299094, "end": 300204}]}, {"count": 1, "rank": 0.07, "text": "web development", "timestamps": [{"start": 27498, "end": 28616}]}, {"count": 2, "rank": 0.07, "text": "background color", "timestamps": [{"start": 210874, "end": 212070}, {"start": 260378, "end": 261236}]}, {"count": 2, "rank": 0.06, "text": "closed shadow dom", "timestamps": [{"start": 90498, "end": 91384}, {"start": 94918, "end": 95756}]}, {"count": 2, "rank": 0.06, "text": "attached shadow function", "timestamps": [{"start": 131218, "end": 132460}, {"start": 151894, "end": 153250}]}, {"count": 1, "rank": 0.06, "text": "attach shadow function", "timestamps": [{"start": 174366, "end": 176216}]}, {"count": 5, "rank": 0.06, "text": "styles", "timestamps": [{"start": 61386, "end": 62112}, {"start": 110106, "end": 110464}, {"start": 189378, "end": 189944}, {"start": 301318, "end": 301820}, {"start": 320026, "end": 320688}]}, {"count": 2, "rank": 0.06, "text": "closed shadow", "timestamps": [{"start": 90498, "end": 91096}, {"start": 94918, "end": 95516}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}