{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/3b8a54f5-2bb0-4280-985c-f4444bde1849", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["algorithms", "tech leader", "zeno", "algorithms", "andrew murphy", "athens", "believe", "born", "calls", "conf fourty two", "lies", "prowess", "requires", "tech leaders launchpad", "told", "two", "years", "zeno"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "e62992db-9694-4bcf-b84c-c7bdd6e9b255", "status": "completed", "error": null, "text": "Welcome to the lightning talk on Athens to algorithms, what the ancient greek philosopher Zeno can tell us about tech leadership in the 21st century. I'm Jim Murphy. I'm going to be talking about this topic for roughly 15 to 20 minutes. A quick lightning talk. And I like to start my presentations with a story that humiliates me. I do this for a couple of reasons. I do it because I want you to understand why this topic is meaningful for me and why I put it together to hopefully help you empathize with the content. But I also do it so that you feel sorry for me and vote my talk highly. So hopefully I can do that. The story I'm going to tell is actually putting together this talk. I love mathematics. I love learning about mathematics. And I learn about a greek mathematician, Xeno, and things like Xeno's paradox and the work that he did in that area. And I also learn about stoicism and the concept of stoicism. And I had this person, Xeno, in investigating this. I thought these two Zeno were actually the same person. And I put a whole introductory part to this presentation about the mathematics that Zeno did, only to present it for the first time and have a good friend of mine say, andrew, those are two different Zeno. Turns out Zeno is the John Smith of the ancient greek era, and these two xenos have nothing to do with each other. So I am not going to be talking about Xeno's paradox. I'm not going to be talking about turtles and arrows. I'm going to be talking about Zeno of Sitium, who was an ancient greek philosopher and created and helped create a lot of concepts, the one of which we're going to talk the most in depth about today is stoicism and how stoicism can be tied into technology leadership. So I mentioned, I'm Andrew Murphy. I want to tell you a little bit more about me before we go into the meat of this presentation. I am a long term father of a flock of chickens, or as we call them in Australia, chucks. I'm a short term father of a flock of humans, or as we call them in Australia, financial burdens. And I really like travel. I love getting around the world. And this will come into play a little bit later in our discussion from a professional point of view. I've been a coder and a programmer for as long as I can remember. I learned to write code very, very early, and I've been paid to write code for about 20 years at this point. But I also had a few formative experiences that got me into the told of technology leadership really, really early. By the time I was 24 years old, I was running a team of ten people. And I don't say that to say, wow, aren't I awesome for running a team of ten people? I sucked at it. I was a bad leader. What 24 year old knows how to be an employee, let alone a leader of people? And so I made a bunch of mistakes. And unfortunately, when you're a leader and you make mistakes, often those mistakes are at the expense of the people you lead. So this lent me to go on a pathway of learning to be a better leader, learning to understand the skills of leadership. Two, the point where I taught other leaders how to lead, taught new leaders to understand the concepts of leadership and the difference between being an excellent individual contributor and an excellent leader, and what the difference between those two was. This has now led me to run my own company, tech leader's launchpad, which focuses solely on helping new and emerging tech leader understand their roles better through training, coaching, and consultation. Let's talk a little bit more about Zeno. Zeno was an ancient greek philosopher. He was born on the island of Cyprus. Cyprus is in the middle of the Mediterranean. It's an island that I've been to many, many times, if you can't tell from the accent. I grew up in England, and so Cyprus was a mere four or five hour plane ride away, which might sound a lot for those of you who live in Europe, but now that I live in Australia, you get on a plane for 4 hours and you're still in the country. So it's something I miss. Being from Europe is that ability to travel. Zeno is part of a whole tranche of philosophers who came up about the same time at around the third to fourth century BC. They focused on learning a lot about philosophy, coming up with a bunch of theories and concepts and ideas that in the modern era, we just kind of take as part of who we are. The three that I've highlighted at the bottom in those pictures on that slide are logos. The first, the idea of logic. Somebody had to invent the idea of logic, which just seems so strange to us nowadays, that logic didn't exist at some point and somebody created it. But he, along with a few other people, created and fundamentalized the idea of logic and predicates and things that are either true or not true, and how you can reason and decide whether one thing is true based on other things being true or not being true. He also was fundamental in a concept called cosmopolitanism. Not the drink that you see in the picture, which is named after the concept, but cosmopolitanism is this idea that we are not citizens of a country or a city or a tribe. We are citizens of the world. You are either an individual human being, or you are a citizen of the world. And there is nothing in the middle of those. You don't belong to a tribe or a creed or a race or a country or a region. You are part of the world. And I really like this idea. As somebody who was born in northern Europe and now lives in Australia, I love the freedom that we can have to travel and see the world and to learn and to become part of it and to break down those boundaries. I think there's nothing better and nothing more important in the world than seeing it and seeing the people that are in it. And lastly, the main topic of the discussion today. He was fundamental in the creation of stoicism. He taught a whole idea around stoicism, which is fundamentally in that one image. That image in the bottom right is stoicism in a single image. Let's go into that, and let's talk about the basics of stoicism. This is stoicism in a single image. It's represented as a triangle. And the points of the Triangle, the angles of it, represent the three tenets of stoicism. At the bottom right is something called the dichotomy of control. That's fundamental. Two stoics. It's the idea that you should focus on that which you can control and only that which you can control. You should forget about or accept those things which you can't control in order to save the time and energy to focus on the things you can control. And we'll dive into that later. The top angle is, take responsibility for the actions you take, the judgments you make. Take responsibility for those things which are in your control. So if we are separating the world through the dichotomy of control into things we can control and things we can't control, then we should take responsibility for the things we can control. Then in the bottom left is hopefully through doing those things, through focusing on the things we can control and taking responsibility for them. We can live with arate, which roughly translates to living your best self. And by doing these things, we hopefully lead towards this concept of eudaimonia, which literally translates as happy inner demon. But modern usage of the word demon doesn't really translate in the same way. You can think of it more as happy inner self. And so by focusing on what we can control, taking responsibility for it, focusing on improving ourselves. By living with arate, we hopefully reach this state of eudaimonia, this happy inner spirit, if we want to use that word. And that's the three core tenets that no matter what happens to us around us, we should focus on what we can control, take responsibility for our judgments, and live by constantly improving ourselves with arate. So at this point, you're probably asking me, Andrew, we're almost ten minutes into this talk. What does this have to do with tech leadership? Let's get there. Let's talk about how these concepts of stoicism apply very directly to being a tech leader in 2024. The first concept is applying the stoic dichotomy of control. Focus on what we can control. So, really, what it's saying is, we can control our actions, reactions, and attitudes, but we cannot control external events or other people's actions, reactions, and attitudes. We can influence those things, but we cannot control them. And so if we look at what that means in leadership, there are a certain list of things that are in our control, and we should focus on those things, and there are a certain list of things that are not in our control. And so what's in our control, for example, is managing our team effectively. We can control this. It is within our power to affect change in that area. What is not in our control are the team dynamics, when you join your team, and we could often find ourselves, when we join a new team, going, oh, I wish things were different, or, why did they have to get into this? Or they've got bad mindsets, bad habits, bad skill sets. It's so frustrating the way they are, and it's just causing me two kind of give up hope that I can ever help this team become the best they can be. The stoic would say, it doesn't matter why they got to where they are, and you weren't in control of that situation, but you are in control of how you go forward with it. You are in control with how that makes you feel, and you are in control of the judgments that you make in order to progress forward. Now, we can have an interesting debate around the fact that you don't want to completely ignore how the team got to where they are, but fixating on it and using it as an excuse for why you can't progress or feeling like it's an obstacle you cannot overcome in order to improve the team doesn't help anybody. Another thing you can't control are market dynamics. I'm recording this at the start of 2024. 2023 was a rough year. 2022, end of 2022 was an even rougher period for our industry. We can't control that. We can't control the market dynamics. But what we can do is constantly develop our team, their skills and their ability to handle these situations. If we just throw our hands up and go, the market is terrible, there's nothing we can do, and woe is us, then that's not going to help you. It's going to just give you an excuse. It's just going to make you frustrated and give up. Whereas if you focus on the things you can control, which is how you respond to that situation, you can focus on the development and improvement of your team to help them better respond to the situation. Lastly, in the things we can't control, user and client decisions. For those of you who work in consultancies, you know that often clients don't make decisions that are in their best interests or the best interests of their users. And so you can often feel frustrated and angry that the client just doesn't get it. And why are they making these decisions? That is not productive and conducive to a healthy relationship with the client. But it's also not useful for you as an individual to feel this sense of anger, frustration and resentment constantly. And letting go of that and accepting that that is the way it is and we have to respond to that, means that what we should actually be doing is focusing on building teams and prowess and systems and software that are responsive to change, and that enable us to innovate and adjust and improve the way we do things when these decisions inevitably don't go the way we expect, or when those decisions are changing constantly. And so all of these things, this dichotomy of control and this giving, not allowing those things that are not in our control to drive our emotions to such a deep extent, but also accepting our part in how we move forward, means that we're leading towards rational decision making. As a technology leader, understanding this dichotomy of control means we can understand the things in which we have influence over and the things we don't, and therefore devote our efforts where they are most effective. Second, in our stoic principles is taking responsibility for our judgments. What do I mean by judgments? I don't mean wearing a wig and making proceedings over things in a courtroom. I mean the decisions we make and the actions we take based on things that happen to us, the events that happen in our lives, and also the emotional responses that those events trigger. We cannot control the emotional response that we get to certain circumstances, there's always going two be things that push us beyond our ability to stay composed and our ability to not trigger an emotional response. We have this word trigger, which means we are sometimes rationally or irrationally emotionally evoked by certain circumstances. And this idea of taking responsibility for our judgments is not about having a suppression of those emotional responses. It's about understanding the reactions, the actions, the judgments we make after we feel those emotions and allowing us to change those based on those emotional responses. It's really difficult for us to change those emotional responses themselves. But what we can do is control the judgments, the actions, reactions that we take because of those emotions. So you can think about this as a process, as a series on a flowchart. There's the event that happens. We have no control over that at all. There's the emotional response we have because of that event. We have very little emotional control over that. We can, through other processes, like CBT and like, we can influence that. But sometimes it's really difficult to change those emotional responses. But as logical homo sapiens, we do have control over the actions and reactions, or as stoicism will call them, the judgments. We do have control over those. And so that's where we should focus our energy. That's where we should focus. Our effort is accepting the fact we can't control the events and the emotions, but we can control those actions and reactions, and therefore, we should take responsibility for those. Really what we're talking about here is emotional resilience, understanding those things that are within our control and what emotions those evoke and allowing ourselves. Two, understand that those emotions are sometimes not able to be controlled immediately, but we can control the actions and reactions that those emotions evoke in us. Lastly is the concept of living with arate by expressing our best self. What am I talking about with that? Well, this is about living up to your full potential through empathy and constant learning and development. We have so much around us that enables us to improve ourselves. And the world is constantly changing. The industry we're in is constantly changing. The technologies are constantly changing. And if we just accept status quo, then we're not living with arate. And this means we can't reach that state of eudaimonia, this happy inner demon. And so constant focus on what we can do to improve ourselves is living with a stoic life. What are the areas in which we can improve? What are the areas in which we can strengthen? What are the areas in which we can invest time in improving ourselves? This means we're going to be able to tackle everything better. We're going to improve our judgments. We're going to be able to increase the sphere of influence of our dichotomy of control. We're going to be able to improve ourselves constantly. This isn't about investing every single hour of every single day into getting better, but it's just being aware that there is this stoic principle of just what have you done this week? What have you done this month? What have you done this year to improve yourself? Because living with stoicism is constantly improvement as a leader. There's another interesting dynamic here, which is that in doing this, we're setting an example for others to follow. If we show ourselves as somebody who wants two improve, wants to get better, then we're encouraging that behavior in other people. And what we're also doing is showing that we're not perfect. We have flaws, we have things we can get better at. And that enables other people to be open about the areas in which they can improve and they can get better at. So we're talking here about the concept of continual self improvement calls, right? So I want to end with a quote from Zeno themselves, which is that man conquers the world by conquering himself. I apologize for the very gendered language in this quote. Zeno, like I said, is from three to 400 bc. We would write this very differently nowadays, but hopefully the concepts resonate, which is if we want to exert influence on the world, we have to exert influence on ourselves. And we can do that through many ways. One of them that Zeno himself would advocate, and I would advocate, is by living with the principles of stoicism, especially if you're a technology leader. To wrap up, I want to share a couple of links with you if you want to know more about me and what I do. I do regular live streams on LinkedIn where I talk about technology leadership topics. I also post content on there pretty regularly, and I have a blog. All of those are in the QR codes that you can see in front of you. There's also a link to tech leader's launchpad, which is my online technology leadership training platform where I've got a bunch of great courses that help you become a better technology leader in whatever area you need help in. If you've got any questions, feel free to reach out to me. I love talking about this stuff and will love to have a continued conversation about where you see this fits in with your lives. I'll see you next time.", "words": [], "utterances": null, "confidence": 0.954732701863349, "audio_duration": 1357.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Jim Murphy: What the ancient greek philosopher Zeno can tell us about tech leadership in the 21st century. Murphy: How stoicism can be tied into technology leadership. Murphy likes to start his presentations with a story that humiliates him.\n- Andrew Murphy has been a coder and a programmer for as long as he can remember. By the time he was 24 years old, he was running a team of ten people. Now he runs his own company, tech leader's launchpad, which focuses solely on helping new tech leader understand their roles better.\n- Zeno was an ancient greek philosopher. He was born on the island of Cyprus. He taught a whole idea around stoicism. He also was fundamental in a concept called cosmopolitanism. As somebody who was born in northern Europe and now lives in Australia, he loves the freedom to travel.\n- The first concept is applying the stoic dichotomy of control. Focus on what we can control. What is not in our control are the team dynamics. What we can do is constantly develop our team, their skills.\n- Technology leaders can't control user and client decisions. But they can control the emotional responses that those events trigger. This dichotomy of control means we can focus our efforts where they are most effective.\n- Living with stoicism is constantly improvement as a leader. Living up to your full potential through empathy and constant learning and development. In doing this, we're setting an example for others to follow.\n- So I want to end with a quote from Zeno themselves, which is that man conquers the world by conquering himself. One of them that Zeno himself would advocate, is by living with the principles of stoicism. If you've got any questions, feel free to reach out to me.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.07, "text": "other things", "timestamps": [{"start": 386652, "end": 387142}]}, {"count": 1, "rank": 0.06, "text": "other leaders", "timestamps": [{"start": 260154, "end": 261002}]}, {"count": 1, "rank": 0.05, "text": "technology leadership topics", "timestamps": [{"start": 1315192, "end": 1316958}]}, {"count": 1, "rank": 0.05, "text": "new leaders", "timestamps": [{"start": 262058, "end": 262566}]}, {"count": 4, "rank": 0.05, "text": "technology leadership", "timestamps": [{"start": 160676, "end": 162110}, {"start": 213188, "end": 214478}, {"start": 1315192, "end": 1316174}, {"start": 1332572, "end": 1333970}]}, {"count": 3, "rank": 0.05, "text": "other people", "timestamps": [{"start": 372312, "end": 372946}, {"start": 1239468, "end": 1240280}, {"start": 1247638, "end": 1248170}]}, {"count": 2, "rank": 0.05, "text": "tech leadership", "timestamps": [{"start": 46828, "end": 47730}, {"start": 640576, "end": 641690}]}, {"count": 14, "rank": 0.04, "text": "stoicism", "timestamps": [{"start": 102340, "end": 103258}, {"start": 104548, "end": 105034}, {"start": 156132, "end": 157130}, {"start": 158420, "end": 159162}, {"start": 461108, "end": 462230}, {"start": 467512, "end": 468462}, {"start": 473976, "end": 474970}, {"start": 479276, "end": 480162}, {"start": 480748, "end": 481410}, {"start": 494704, "end": 495770}, {"start": 645872, "end": 646774}, {"start": 1084236, "end": 1084882}, {"start": 1220712, "end": 1221342}, {"start": 1301712, "end": 1302758}]}, {"count": 1, "rank": 0.04, "text": "building teams", "timestamps": [{"start": 888112, "end": 888966}]}, {"count": 5, "rank": 0.04, "text": "concepts", "timestamps": [{"start": 150948, "end": 151594}, {"start": 263848, "end": 264206}, {"start": 344912, "end": 345366}, {"start": 645056, "end": 645574}, {"start": 1283132, "end": 1283874}]}, {"count": 1, "rank": 0.04, "text": "happy inner self", "timestamps": [{"start": 591200, "end": 592620}]}, {"count": 12, "rank": 0.04, "text": "Zeno", "timestamps": [{"start": 44866, "end": 45314}, {"start": 110948, "end": 111354}, {"start": 119688, "end": 120046}, {"start": 127052, "end": 127910}, {"start": 129676, "end": 130146}, {"start": 144448, "end": 144886}, {"start": 292492, "end": 293406}, {"start": 293538, "end": 294566}, {"start": 328492, "end": 329170}, {"start": 1264244, "end": 1265222}, {"start": 1274990, "end": 1275674}, {"start": 1295072, "end": 1295526}]}, {"count": 2, "rank": 0.04, "text": "happy inner demon", "timestamps": [{"start": 581740, "end": 583458}, {"start": 1167432, "end": 1169010}]}, {"count": 46, "rank": 0.04, "text": "control", "timestamps": [{"start": 500864, "end": 501278}, {"start": 507252, "end": 507790}, {"start": 509508, "end": 510078}, {"start": 514702, "end": 515300}, {"start": 520040, "end": 520514}, {"start": 534732, "end": 535320}, {"start": 541088, "end": 541610}, {"start": 542832, "end": 543130}, {"start": 544326, "end": 544986}, {"start": 548976, "end": 549580}, {"start": 558132, "end": 558574}, {"start": 596272, "end": 596762}, {"start": 621816, "end": 622370}, {"start": 656708, "end": 656990}, {"start": 658068, "end": 658686}, {"start": 661108, "end": 661486}, {"start": 666510, "end": 667234}, {"start": 675714, "end": 676166}, {"start": 685276, "end": 685782}, {"start": 692656, "end": 693260}, {"start": 696288, "end": 696570}, {"start": 702628, "end": 702910}, {"start": 709044, "end": 709582}, {"start": 745008, "end": 745290}, {"start": 748032, "end": 748426}, {"start": 751104, "end": 751390}, {"start": 754212, "end": 754654}, {"start": 788242, "end": 788694}, {"start": 803562, "end": 803870}, {"start": 804538, "end": 804878}, {"start": 832076, "end": 832390}, {"start": 845302, "end": 845898}, {"start": 913432, "end": 913778}, {"start": 919272, "end": 919618}, {"start": 934332, "end": 934918}, {"start": 975442, "end": 975990}, {"start": 1035884, "end": 1036470}, {"start": 1052532, "end": 1053166}, {"start": 1063262, "end": 1063762}, {"start": 1080556, "end": 1081110}, {"start": 1086892, "end": 1087238}, {"start": 1096278, "end": 1096474}, {"start": 1098736, "end": 1099050}, {"start": 1112468, "end": 1112770}, {"start": 1124280, "end": 1124610}, {"start": 1197792, "end": 1198090}]}, {"count": 1, "rank": 0.04, "text": "continual self improvement calls", "timestamps": [{"start": 1256484, "end": 1259998}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}