{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/8f6d9914-7858-458d-9314-40b840f6545b", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["begin", "cases", "conf fourty two", "indepth", "organizations", "realworld", "saas product development", "stories", "tabraiz feham", "usecases"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_audio_quality": null, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "speech_model": null, "id": "5d02ee2d-eb34-4dd8-bee5-d6126cad0261", "status": "completed", "error": null, "text": "Hi everyone, my name is Tabrez and I am part of the team at Aviatrix that is implementing AI, machine learning and generative AI initiatives. Aviatrix is a multi cloud networking company dedicated to simplifying cloud infrastructure management and security across major cloud providers including AWS, Azure, GCP and Alibaba. Trusted by over 500 enterprises worldwide, Aviatrix offers a comprehensive platform that ensures visibility, control and security, enabling businesses to adapt quickly and move forward efficiently. Today, I will be showcasing some of the innovative AI and ML solutions we've developed to drive efficiency and transformation within our organization. Let's dive into the detail. The first initiative I am going to talk about is the network mission briefs for customers. The mission brief integrates real time customer insights from multiple sources, providing a comprehensive 360 degree view of customers. This initiative empowers the sales team with data driven decision making capabilities, enabling them to close deals more efficiently and maintain a competitive edge. By aggregating data from various platforms, Aviatrix ensures that all relevant customer information is easily accessible, enhancing the overall customer engagement and support processes. The mission briefs utilizes tools such as Coda for document generation, copy AI for AI narratives, and xeno data lake for data storage. We've generated over 500 mission briefs. This initiative has reduced our sales cycle time by 30%, doubled data accessibility speed, and achieved a 95% accuracy in insights, significantly enhancing our sales team's effectiveness. The next initiative is the lead scoring app. The app leverages AI to streamline the lead qualification process by matching leads with the ideal customer profile or ICP. The app automates data retrieval from various sources and assigns detailed lead scores based on multiple factors, enhancing sales efficiency and precision. By providing a comprehensive view of potential leads, the app helps prioritize high value prospects, ensuring the sales team can focus their efforts on the most promising opportunities. Our lead scoring app leverages AI tools like copy AI for content generation, coda for workflow automation, and Salesforce for CRM. By integrating these technologies, we score over 5000 leads monthly, resulting in a 25% increase in lead conversion and a 15% boost in sales productivity. The next initiative I'm going to talk about is the AI powered customer support chatbot. The chatbot utilizes AI and machine learning to autonomously handle common customer inquiries and efficiently escalate complex issues. To support teams operating through the Aviatrix support portal, the chatbot integrates with the Zendesk ticketing system, logs tickets automatically, and directs them to the relevant support tier. This initiative significantly enhances the customer support experience, ensuring timely and accurate responses to customer queries. The chatbot utilizes copy AI for content automation, intercom for real time chat, and Zendesk for ticket management. By integrating these tools, we achieve 80% automation of common inquiries, reduce response time by 60%, and decrease support tickets by 50%. This tech stack significantly enhances our customer support efficiency and effectiveness. The next featured initiative is implementation of GitHub Copilot at Aviatrix. This initiative revolutionizes code development by leveraging generative AI and machine learning to assist developers. This AI powered tool analyzes developers intents, suggests improvements, automates tasks, and even writes code. This initiative allows developers to focus on more complex aspects of their projects while maintaining a high quality codebase. The GitHub copilot leverages machine learning and generative AI for code completion integrated with visual studio code. By utilizing machine learning models for code analysis and suggestions, and integrating with our CI CD pipeline, we've increased development speed by 50%, boosted developer productivity by 40%, and contributed 30,000 lines of code. This tech stack significantly enhances our development efficiency. The last featured initiative I would like to talk about is present AI. Present AI transforms business communication by leveraging AI to create engaging and effective presentations. This AI powered platform significantly enhances productivity by automating the creation of slides, ensuring brand compliance, and facilitating visual storytelling. By reducing the time spent on preparing presentations, present AI allows employees to focus on delivering impactful and interactive content tailored to the audience's needs. Using present AI, we've achieved a 70% reduction in presentation preparation time, a two x increase in presentation engagement rates, and a 30% increase in content personalization. This AI powered platform significantly enhances our efficiency and impact in creating engaging, customized presentations.", "words": [], "utterances": null, "confidence": 0.927093392857142, "audio_duration": 373.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Aviatrix is a multi cloud networking company dedicated to simplifying cloud infrastructure management and security across major cloud providers. Trusted by over 500 enterprises worldwide, Aviatrix offers a comprehensive platform that ensures visibility, control and security. Today, I will be showcasing some of the innovative AI and ML solutions we've developed.\n- The network mission briefs for customers integrates real time customer insights from multiple sources. This initiative empowers the sales team with data driven decision making capabilities. The next initiative is the lead scoring app. The app leverages AI to streamline the lead qualification process.\n- The chatbot utilizes AI and machine learning to handle common customer inquiries and efficiently escalate complex issues. The next featured initiative is implementation of GitHub Copilot at Aviatrix which revolutionizes code development. This tech stack significantly enhances our development efficiency.\n- Present AI transforms business communication by leveraging AI to create engaging and effective presentations. Using present AI, we've achieved a 70% reduction in presentation preparation time. This AI powered platform significantly enhances our efficiency and impact in creating engaging, customized presentations.", "auto_highlights_result": {"status": "success", "results": [{"count": 1, "rank": 0.09, "text": "generative AI initiatives", "timestamps": [{"start": 39154, "end": 40986}]}, {"count": 1, "rank": 0.09, "text": "AI tools", "timestamps": [{"start": 179902, "end": 180550}]}, {"count": 3, "rank": 0.09, "text": "generative AI", "timestamps": [{"start": 39154, "end": 40058}, {"start": 264450, "end": 265442}, {"start": 287212, "end": 288092}]}, {"count": 2, "rank": 0.09, "text": "app leverages AI", "timestamps": [{"start": 146632, "end": 147848}, {"start": 179182, "end": 180214}]}, {"count": 1, "rank": 0.08, "text": "AI narratives", "timestamps": [{"start": 124004, "end": 124940}]}, {"count": 1, "rank": 0.07, "text": "real time customer insights", "timestamps": [{"start": 88964, "end": 90684}]}, {"count": 1, "rank": 0.07, "text": "AI powered customer support chatbot", "timestamps": [{"start": 199986, "end": 202522}]}, {"count": 1, "rank": 0.07, "text": "common customer inquiries", "timestamps": [{"start": 206858, "end": 208386}]}, {"count": 2, "rank": 0.06, "text": "customers", "timestamps": [{"start": 86252, "end": 87092}, {"start": 95764, "end": 96612}]}, {"count": 1, "rank": 0.06, "text": "customer queries", "timestamps": [{"start": 229052, "end": 230144}]}, {"count": 1, "rank": 0.06, "text": "sales efficiency", "timestamps": [{"start": 163718, "end": 164694}]}, {"count": 1, "rank": 0.06, "text": "presentation preparation time", "timestamps": [{"start": 350600, "end": 352328}]}, {"count": 5, "rank": 0.06, "text": "machine learning", "timestamps": [{"start": 37730, "end": 38698}, {"start": 204834, "end": 205418}, {"start": 265754, "end": 266442}, {"start": 286292, "end": 286948}, {"start": 293116, "end": 293748}]}, {"count": 1, "rank": 0.06, "text": "machine learning models", "timestamps": [{"start": 293116, "end": 294108}]}, {"count": 2, "rank": 0.06, "text": "AI powered platform", "timestamps": [{"start": 325556, "end": 326764}, {"start": 359538, "end": 361026}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}