{"language_code": "en_us", "audio_url": "https://cdn.assemblyai.com/upload/8942776e-bdc0-4fdd-9ed8-2ce6dd761218", "punctuate": true, "format_text": true, "dual_channel": null, "webhook_url": null, "webhook_auth_header_name": null, "webhook_auth_header_value": null, "audio_start_from": null, "audio_end_at": null, "word_boost": ["captivating", "conffourtytwo", "delving", "domains", "fortifies", "globalsoftwareoperationsarchitect", "iot", "markets", "profound", "redefines", "revolutionizes", "revolutions", "shifts", "signifyphilipslighting", "susiesu", "these", "transformative", "workforce"], "boost_param": "high", "filter_profanity": false, "redact_pii": false, "redact_pii_audio": false, "redact_pii_policies": null, "redact_pii_sub": null, "speaker_labels": false, "speakers_expected": null, "content_safety": false, "content_safety_confidence": null, "iab_categories": false, "custom_spelling": null, "disfluencies": false, "sentiment_analysis": false, "auto_chapters": false, "entity_detection": false, "summarization": true, "summary_model": "informative", "summary_type": "bullets_verbose", "auto_highlights": true, "language_detection": false, "speech_threshold": null, "id": "4d1f65a8-890f-4f35-995e-10c37c0234fd", "status": "completed", "error": null, "text": "Hello everyone, I'm suzy. See you again. Today we will dive deep into you, the intersection of AI and IoT. Before we just start over today's session, I would like to extend my gratitude to the Kong 44 who invite me to be here and meet all of you again. Now let's begin. If you didn't watch my previous videos or recordings, these is a little bit about me. I'm currently working as a DevOps manager and software operations architect at signify formerly famous lighting. Over the past three years, I have deeply delved into and involved into these AI and machine learning, etc. Which is why I'm here. And meanwhile, I'm also an irate contributor to open source. So if you are curious, scan the QR code on the left side where you will gain my latest articles, speeches, and also my upcoming technical books. So now, first we'll discuss the AIot. So what does it mean Iot? Here Iot is. Iot is just a new term. AI in Iot is Iot. Here I just choose three examples. It's quite practical examples for AI in Iot. The first one, automated vehicles. You may realize some brand is quite famous, right? For example like Tesla Wimble is kind of for pioneers in this industry and also smart city. For example like lighting, our company is a lighting leader and radio surveillance and monitoring traffic and smart buildings for manufacturing. They take advantage like deep learning and deep neural networks to do the kind of product quality checks in production line. And here I pick five use case in real life AIop industry. And for each part, for example like Niop, it's a subfield for AI. Because for AI, these have more than seven major subfields. But here I pick five to related AIot. So let's dive into the first one. Alexa, google Assistant, Siri, these are all kind of virtual assistant. But you know, in Iot we have some like a speaker, we can have interaction with alexa, right? To light alexa, this speaker to play videos or play music or to implement some tasks, et cetera. So they take advantage like the NLP and also for example like voice recognition model as well, right? To achieve human being to interact with this kind of IoT product. Second, expert systems, take IBI Morsen for example. It has been utilized in hospital and what they can do like medical diagnosis is quite amazing and also very practical. And number three, machine region, as I mentioned before, like neural network and has been used for this purpose. But here is machine region, it can be used in production line to do this kind of production quality checks. Number four, here it is, planning is also one of these sub is one subfield of AI self delving car. They take advantage like applying AI technology to navigate the routes. And it can help the driver. It's a self driving car. IoT can help the driver to find the best route. Number five is quite amazing part. For example like Boston dynamics sport robot. Have you heard this news before? And it's really astonishing because this robot can navigate terrain and also to conduct like rescue missions in dangerous situation. It will save human beings life dramatically. It's really practical in Iot. But if we think about it for the Iot part, we take advantage. AI technology, it's captivating. It's like AI technology. It's like a coin with two sides. Now we just explore amazing part of AI. But think about, it's not like a traditional software, right? If our traditional software, if it has been hacked by AI, it will just cause your website downtime or your financial losses. But if it coming to the Iot, for example like this robots or some machine or something else, or increase your flies, your bedrooms temperature more than 100 degree celsius, it will kill people, right? So we must prioritize the Iot security, right? So now let's go ahead AIot security. So we will focus on how we can enhance security in Iot. In AIot. AI technology is not new term. IoT has been coined in 1966, almost seven years ago. But you know, with the explosion of AI technologies, the current AI security, the scope of AI security will extend. It will expand very fast. But we can still take advantage for the old security classification, right? For example, these. It is. Look at the diagram and you will see there's an overlap between Iot security and information security. Is network security. And network security belongs to cybersecurity. And look at the cybersecurity. I think you are quite familiar with the cybersecurity a lot, right? We got hacked all kind of related to the information security. And cybersecurity belongs to information security. These. It is Iot security has been included in cybersecurity. What is Iot? What's a Iot security? For example, like a 5G networks, Internet for vehicles and also industrial Iot. When we just talk about industrial control system, sorry, related to Iot, we definitely need to refer to this term ICI. Iot means industrial control system. So what is it? Look at the right side. There is a timeline. Is ICI is a separate incident. It's a real case happened since 19 three. Take one, for example, like 2012. There is a campaign called Guys pipeline cyber intrusion campaign. Think about it. This pipeline is very crucial infrastructure or even a nuclear industry. If they had been kind of hacked by AI, it will potentially not kill a couple of persons. These will dramatically destroy a city or even an entire country, right. I think nobody will let this kind of aiot out of our control. Human beings control. So we definitely need to prioritize Iot security as much as possible, and also as soon as possible. And when we talk about AIot security, we definitely need to learn the AI security, right? Because for Iot part there is product, it's a real object just send in front of you or just beside you. And here is the AI technology, or you can regard as AI model. These have interaction with each other, the product and the AI part. Between AI model and also these Iot object, our product devices, et cetera. And we must make sure the connection cybersecurity, right? And also we need make sure the data security, right? Yeah. These is between these AI model and Iot devices. But we must make sure for the AI part, also the IoT part, both the security, they can make sure themselves secure, right? So for AI part, here is these is some list about AI security. Like first data security, definitely privacy preservation, because it's related to the AI part and information security. And also explainability, transparency. Because we are kind of AI, this technology or model or machine informed of human being is kind of a black box. We must make sure everything expandable and also transparent. Otherwise it has been trained by, for example, what should I say the very, by the purpose or malicious purpose. Wow. You couldn't imagine this machine can go, can take which direction, right? Iot may be just do some very evil stuff. We do not want this kind of thing happen into the reality. And Iot security has been included in AI security as well. And also human AI interaction. Security model security with the AI explosion, I mean, AI technology explosion, we will see more and more model will be launched. So definitely model security and the best finance security. We are human being living in a world with different cultures, civilization and even different religions, right? So we found the machine. It's just a box. Oh, it's just a machine. It's some. We are human being to give them data, to train them to get the result. What we are looking forward, what do we expect, right? So we definitely make sure there's a bears and fairness. These barriers and fairness can be solved. These cannot be exploited by malicious purpose and lifecycle security and regulatory compliance, hybrid AI human security. For each of these, we definitely need to make sure the AI part is secure and also, we will make sure our Iot devices, for example, like firmware and hardware, as we all know, our apps or software, they have bots. We definitely need make sure our IoT product has kind of a regular update and fix kind of for potential vulnerability box, right? And for the AI part, no matter, we are in Iot, sorry, we are in IoT industry or any industry, for AI side, for everyone. We need prioritize this AI security. But today we talk about AIot, right? So for the IoT part, we need to make sure the regular updates and between both of them and these cybersecurity and also the data security, et cetera, right? So now here's a summary. We talk about alt definition and these real life use case in reality, and also the information security IoT security in AI and also AI security definition, right? I think we just talk about all kinds of AIoT stuff. Some very astonishing use case it has been applied in reality. And see, even for example, like that robotics can conduct a rescue. Okay? And so another part, we need to care about the AI security very much because it's not like software, right? It's some object kind of interact with a human being directly. And also the infrastructure like nuclear industry, ICIs, this kind of thing. So do we definitely need to prioritize the AI security, especially in IoT? I hope you all enjoyed this talk and maybe get a little bit inspiration. I will be very grateful and thank you. See you soon. Bye.", "words": [], "utterances": null, "confidence": 0.90542918231375, "audio_duration": 926.0, "webhook_status_code": null, "webhook_auth": false, "summary": "- Today we will dive deep into you, the intersection of AI and IoT. scan the QR code on the left side where you will gain my latest articles, speeches, and also my upcoming technical books.\n-  AI in Iot is just a new term. And here I pick five use case in real life AIop industry. For each part, for example like Niop, it's a subfield for AI. We must prioritize the Iot security, right?\n- In AIot. AI technology is not new term. IoT has been coined in 1966, almost seven years ago. With the explosion of AI technologies, the current AI security, the scope of AI security will extend. We definitely need to prioritize Iot security as much as possible.", "auto_highlights_result": {"status": "success", "results": [{"count": 9, "rank": 0.11, "text": "AI security", "timestamps": [{"start": 420710, "end": 422100}, {"start": 424216, "end": 425054}, {"start": 573112, "end": 573858}, {"start": 633020, "end": 633910}, {"start": 696576, "end": 697580}, {"start": 820472, "end": 821380}, {"start": 853716, "end": 854350}, {"start": 886828, "end": 887478}, {"start": 910532, "end": 911694}]}, {"count": 1, "rank": 0.11, "text": "Security model security", "timestamps": [{"start": 700778, "end": 702814}]}, {"count": 1, "rank": 0.11, "text": "hybrid AI human security", "timestamps": [{"start": 762874, "end": 765070}]}, {"count": 6, "rank": 0.09, "text": "AI part", "timestamps": [{"start": 594592, "end": 595434}, {"start": 620888, "end": 621860}, {"start": 629196, "end": 630246}, {"start": 641024, "end": 642154}, {"start": 771192, "end": 771986}, {"start": 804244, "end": 805200}]}, {"count": 3, "rank": 0.09, "text": "AI model", "timestamps": [{"start": 590048, "end": 590874}, {"start": 596256, "end": 597818}, {"start": 614952, "end": 615698}]}, {"count": 6, "rank": 0.09, "text": "AI technology", "timestamps": [{"start": 283186, "end": 284200}, {"start": 332674, "end": 334040}, {"start": 337084, "end": 338170}, {"start": 401630, "end": 403580}, {"start": 587196, "end": 588822}, {"start": 705412, "end": 706574}]}, {"count": 7, "rank": 0.09, "text": "Iot security", "timestamps": [{"start": 386636, "end": 387978}, {"start": 441904, "end": 442954}, {"start": 465912, "end": 467060}, {"start": 473656, "end": 475198}, {"start": 560610, "end": 562218}, {"start": 693232, "end": 694300}, {"start": 851396, "end": 852318}]}, {"count": 5, "rank": 0.09, "text": "information security", "timestamps": [{"start": 443456, "end": 444682}, {"start": 459908, "end": 460814}, {"start": 463448, "end": 464706}, {"start": 642880, "end": 644234}, {"start": 850228, "end": 851262}]}, {"count": 2, "rank": 0.09, "text": "network security", "timestamps": [{"start": 445280, "end": 446330}, {"start": 447408, "end": 448570}]}, {"count": 1, "rank": 0.09, "text": "AI side", "timestamps": [{"start": 814744, "end": 816180}]}, {"count": 1, "rank": 0.09, "text": "AI technology explosion", "timestamps": [{"start": 705412, "end": 707610}]}, {"count": 1, "rank": 0.08, "text": "lifecycle security", "timestamps": [{"start": 759172, "end": 760398}]}, {"count": 1, "rank": 0.08, "text": "first data security", "timestamps": [{"start": 634924, "end": 636902}]}, {"count": 1, "rank": 0.08, "text": "AI self delving car", "timestamps": [{"start": 278252, "end": 280902}]}, {"count": 1, "rank": 0.07, "text": "current AI security", "timestamps": [{"start": 419432, "end": 422100}]}]}, "content_safety_labels": null, "iab_categories_result": null, "chapters": null, "sentiment_analysis_results": null, "entities": null}